{
    "title": "10 Great Datasets on Movies",
    "url": "http://zanmel.com/2015/12/14/10-great-datasets-on-movies/",
    "date_saved": "07/18/2016 11:15-09",
    "excerpt": "Data on movies is very useful from a statistical learning perspective. Instructors of statistics &amp; machine learning programs use movie data instead of dryer &amp; more esoteric data sets to&hellip;"
}, {
    "title": "A Learning Advance in Artificial Intelligence Rivals Human Abilities",
    "url": "http://www.nytimes.com/2015/12/11/science/an-advance-in-artificial-intelligence-rivals-human-vision-abilities.html",
    "date_saved": "07/18/2016 10:21-48",
    "excerpt": "Computer researchers reported artificial-intelligence advances on Thursday that surpassed human capabilities for a narrow set of vision-related tasks. The improvements are noteworthy because&hellip;"
}, {
    "title": "Algorithm turns smartphones into 3-D scanners",
    "url": "http://www.kurzweilai.net/algorithm-turns-smartphones-into-3-d-scanners",
    "date_saved": "07/18/2016 11:15-36",
    "excerpt": "Structured light 3-D scanning normally requires a projector and camera to be synchronized. A new technique eliminates the need for synchronization, which makes it possible to do structured light&hellip;"
}, {
    "title": "A Linear-Time Sorting Algorithm for FPGAs",
    "url": "http://hackaday.com/2016/01/20/a-linear-time-sorting-algorithm-for-fpgas/",
    "date_saved": "07/18/2016 10:56-56",
    "excerpt": "Sorting. It&#x2019;s a classic problem that&#x2019;s been studied for decades, and it&#x2019;s a great first step towards &#x201C;thinking algorithmically.&#x201D;&#xA0;Over the years, a handful of&hellip;"
}, {
    "title": "Applied Spatial Data Science with R",
    "url": "http://blog.dominodatalab.com/applied-spatial-data-science-with-r/",
    "date_saved": "07/18/2016 10:41-35",
    "excerpt": "Introduction I recently started working on my Ph.D dissertation which utilizes a vast amount of different spatial data types. During the process, I discovered that there were a lot of concepts about&hellip;"
}, {
    "title": "Art and Math and Science, Oh My!",
    "url": "https://medium.com/@sailorhg/art-and-math-and-science-oh-my-f1dc4ebb3223#.woh4rghco",
    "date_saved": "07/18/2016 09:47-33",
    "excerpt": "Growing up, I had two favorite things.I loved art."
}, {
    "title": "A scalable geometrical model for muscle and tendon units: An algorithmic solution on how to fit a template muscle on a high resolution muscle mesh",
    "url": "http://www.visualacuity.nl/2016/02/a-scalable-geometrical-model-for-muscle.html",
    "date_saved": "07/18/2016 10:26-29",
    "excerpt": "The reason for this blog post is to share a bit on a particular hard problem that I've encountered during my Master's thesis with a broader audience. I will try my best to write it in plain English,&hellip;"
}, {
    "title": "A walk through the SA-IS algorithm - Screwtape's Notepad",
    "url": "http://zork.net/~st/jottings/sais.html",
    "date_saved": "07/18/2016 11:12-02",
    "excerpt": "Screwtape's Notepad A walk through the SA-IS Suffix Array Construction Algorithm Some time ago, while looking for solutions to some string-searching problem I was having, I stumbled across the Suffix&hellip;"
}, {
    "title": "basic infrastructure patterns",
    "url": "http://www.scriptcrafty.com/basic-infrastructure-patterns/",
    "date_saved": "07/18/2016 11:17-46",
    "excerpt": "Some basic patterns I&#x2019;ve noticed come up over and over again while working on build/CI/deployment related things. Pipeline The pipeline is the bedrock on which pretty much everything else is&hellip;"
}, {
    "title": "Databases are dead, long live the immutable state atom!",
    "url": "http://dchambers.github.io/articles/databases-are-dead/",
    "date_saved": "07/18/2016 11:17-51",
    "excerpt": "As an app developer, I've always had a dislike of databases, and I've always had this feeling that the best thing would be to not have a database at all, and to just let the program memory be the&hellip;"
}, {
    "title": "Datacratic MLDB",
    "url": "http://mldb.ai/blog/posts/2016/01/ml-meets-economics/",
    "date_saved": "07/18/2016 10:38-15",
    "excerpt": "The business world is full of streams of items that need to be filtered or evaluated: parts on an assembly line, resum&#xE9;s in an application pile, emails in a delivery queue, transactions awaiting&hellip;"
}, {
    "title": "Data Science tricks: Simple anomaly detection for metrics with a weekly pattern",
    "url": "https://medium.com/@iliasfl/data-science-tricks-simple-anomaly-detection-for-metrics-with-a-weekly-pattern-2e236970d77#.9wgkp1scg",
    "date_saved": "07/18/2016 10:29-42",
    "excerpt": "A recurring problem that engineers have to deal with is creating an alarm system to give them early warnings when things start to go wrong. For example, they may need to monitor CPU or memory usage&hellip;"
}, {
    "title": "Data Scientist Training for Librarians – re-skilling libraries for the future",
    "url": "http://christianlauersen.net/2015/09/21/data-scientist-training-for-librarians-re-skilling-libraries-for-the-future/",
    "date_saved": "07/18/2016 10:41-58",
    "excerpt": "Loud and clear:&#xA0;Data Scientist Training for Librarians (DST4L) is a wonderful concept. It&#x2019;s an experimental course developed at Harvard-Smithsonian Center for Astrophysics Library with&hellip;"
}, {
    "title": "Deep Learning vs Probabilistic Graphical Models vs Logic",
    "url": "http://www.computervisionblog.com/2015/04/deep-learning-vs-probabilistic.html",
    "date_saved": "07/18/2016 10:10-18",
    "excerpt": "Today, let's take a look at three paradigms&#xA0;that have shaped the field of Artificial Intelligence in the last 50 years: Logic, Probabilistic Methods, and Deep Learning. The empirical,&hellip;"
}, {
    "title": "Directed graph traversal, orderings and applications to data-flow analysis",
    "url": "http://eli.thegreenplace.net/2015/directed-graph-traversal-orderings-and-applications-to-data-flow-analysis/",
    "date_saved": "07/18/2016 11:19-35",
    "excerpt": "October 16, 2015 at 05:45 Tags Programming , Python , Compilation When traversing trees with DFS, orderings are easy to define: we have pre-order, which visits a node before recursing into its&hellip;"
}, {
    "title": "Doctors Unionize to Resist the Medical Machine",
    "url": "http://www.nytimes.com/2016/01/10/business/doctors-unionize-to-resist-the-medical-machine.html",
    "date_saved": "07/18/2016 10:24-24",
    "excerpt": "Early in the morning on Aug. 12, 2015, a 68-year-old man named Barry turned up at PeaceHealth Sacred Heart Medical Center in Springfield, Ore., confused and feverish. The case was not a candidate for&hellip;"
}, {
    "title": "Factorization Machines",
    "url": "http://tech.adroll.com/blog/data-science/2015/08/25/factorization-machines.html",
    "date_saved": "07/18/2016 10:17-00",
    "excerpt": "The data science team at AdRoll is constantly working to improve our programmatic bidding algorithm, BidIQ. One recent improvement to BidIQ has been the introduction of a novel modeling technique&hellip;"
}, {
    "title": "Getting dirty with open source databases",
    "url": "http://www.computerweekly.com/feature/Getting-dirty-with-open-source-databases",
    "date_saved": "07/18/2016 10:42-27",
    "excerpt": "A decade ago, most enterprises building a database had only two or three choices: Oracle, Microsoft SQL Server and &#x2013; to a lesser extent &#x2013; IBM DB2. Open source systems such as MySQL and&hellip;"
}, {
    "title": "How a matchmaking algorithm saved lives",
    "url": "https://medium.com/@UofCalifornia/how-a-matchmaking-algorithm-saved-lives-2a65ac448698#.wjkggv616",
    "date_saved": "07/18/2016 09:47-42",
    "excerpt": "Long before dating sites, a pair of economists delved into the question of matchmaking, and hit upon a formula with applications far beyond romance.Would you let an economist set you up on a date?"
}, {
    "title": "How I Rewired My Brain to Become Fluent in Math",
    "url": "http://nautil.us/issue/17/big-bangs/how-i-rewired-my-brain-to-become-fluent-in-math-rd",
    "date_saved": "07/18/2016 10:08-58",
    "excerpt": "I was a wayward kid who grew up on the literary side of life, treating math and science as if they were pustules from the plague. So it&#x2019;s a little strange how I&#x2019;ve ended up&hellip;"
}, {
    "title": "How to Code and Understand DeepMind's Neural Stack Machine",
    "url": "https://iamtrask.github.io/2016/02/25/deepminds-neural-stack-machine/?i=4",
    "date_saved": "07/18/2016 09:44-49",
    "excerpt": "Summary: I learn best with toy code that I can play with. This tutorial teaches DeepMind's Neural Stack machine via a very simple toy example, a short python implementation. I will also explain my&hellip;"
}, {
    "title": "How to Create Remote VM using docker-machine Generic SSH Driver",
    "url": "http://www.thegeekstuff.com/2016/02/docker-machine-create-generic/",
    "date_saved": "07/18/2016 10:04-28",
    "excerpt": "Using docker, you can package your enterprise application into one self-contained container, which is guaranteed to run on any environment. This makes it easy for both developer and sysadmins to&hellip;"
}, {
    "title": "How to monitor your Linux machine",
    "url": "http://www.netinstructions.com/how-to-monitor-your-linux-machine/",
    "date_saved": "07/18/2016 09:48-11",
    "excerpt": "If you're in charge of running or maintaining any Linux machines, you probably want some visibility to what's going on. Typically users can SSH onto a machine and run top to get system load, CPU,&hellip;"
}, {
    "title": "How You Consist of Trillions of Tiny Machines",
    "url": "http://www.nybooks.com/articles/2015/07/09/how-you-consist-trillions-tiny-machines/",
    "date_saved": "07/18/2016 10:12-32",
    "excerpt": "by Paul G. Falkowski Princeton University Press, 205 pp., $24.95 A New History of Life: The Radical New Discoveries About the Origins and Evolution of Life on Earth by Peter Ward and Joe Kirschvink&hellip;"
}, {
    "title": "Incorporating and accessing binary data into a C program",
    "url": "http://smackerelofopinion.blogspot.com/2015/12/incorporating-and-accesses-binary-data.html",
    "date_saved": "07/18/2016 11:28-33",
    "excerpt": "The other day I needed to incorporate a large blob of binary data in a C program. One simple way is to use xxd, for example, on the binary data in file blob, one can do: xxd --include blob unsigned&hellip;"
}, {
    "title": "Learning to Think Different",
    "url": "http://www.newyorker.com/magazine/2016/03/07/altschools-disrupted-education",
    "date_saved": "07/18/2016 09:38-15",
    "excerpt": "AltSchool embeds fish-eye lenses in the walls of its classrooms, capturing every word, action, and interaction, for potential analysis. Credit Illustration by Olimpia Zagnoli"
}, {
    "title": "Learn to Create D3.js Data Visualizations by Example",
    "url": "https://www.sitepoint.com/d3-js-data-visualizations/",
    "date_saved": "07/19/2016 22:34-55",
    "excerpt": "This article was peer reviewed by Michaela Lehr and Tim Severien. Thanks to all of SitePoint&#x2019;s peer reviewers for making SitePoint content the best it can be! D3.js is a JavaScript library for&hellip;",
    "thumbnail": "png/thumbs/learn_to_create_d3js_data_visualizations_by_example.png"
}, {
    "title": "Machine Learning: Bayes",
    "url": "http://blog.rokkincat.com/machine-learning-bayes/",
    "date_saved": "07/18/2016 09:40-58",
    "excerpt": "Welcome to machine learning week 2. If you did not check out the introduction yet, go check it out. It is about cool scatterplot stuff -- don't worry, this post will still be here &#x1F60A;. Once&hellip;"
}, {
    "title": "Math & Beauty & Brain Areas",
    "url": "http://www.dam.brown.edu/people/mumford/blog/2015/MathBeautyBrain.html",
    "date_saved": "07/18/2016 10:18-17",
    "excerpt": "Two questions about the general nature of math have a certain interest to the larger public: mathematicians like to talk of a 'beautiful result' but what does this mean?; and is there a special part&hellip;"
}, {
    "title": "Meet the shadowy tech brokers that deliver your data to the NSA",
    "url": "http://www.zdnet.com/article/meet-the-shadowy-tech-brokers-that-deliver-your-data-to-the-nsa/",
    "date_saved": "07/18/2016 10:49-33",
    "excerpt": "NEW YORK &#x2014; Picture two federal agents knocking at your door, ready to serve you a top secret order from the U.S. government, demanding that you hand over every shred of data you own &#x2014;&hellip;"
}, {
    "title": "Metadata Investigation : Inside Hacking Team",
    "url": "https://labs.rs/en/metadata/",
    "date_saved": "07/18/2016 11:14-14",
    "excerpt": "Once online, our every movement, every click, sent or received email, our every activity produces a vast amount of invisible traces. These traces, once collected, put together and analysed, can&hellip;"
}, {
    "title": "Next areas of math to be applied",
    "url": "http://www.johndcook.com/blog/2016/01/27/next-areas-of-math-to-be-applied/",
    "date_saved": "07/18/2016 10:41-29",
    "excerpt": "Not that long ago&#xA0;number theory was considered strictly pure math. Then&#xA0;came applications to cryptography. Now number theory is at the foundation of the online economy. What are the next&hellip;"
}, {
    "title": "Nvidia GPU + CoreOS + Docker + TensorFlow = A Fast, Flexible, Deep Learning Platform",
    "url": "http://www.emergingstack.com/2016/01/10/Nvidia-GPU-plus-CoreOS-plus-Docker-plus-TensorFlow.html",
    "date_saved": "07/18/2016 10:54-26",
    "excerpt": "The Challenge Providing data scientists with the best tool for the job is hard. They need everything from their computers - raw performance, bleeding-edge software and free-rein to experiment.&hellip;"
}, {
    "title": "Replicate A Whole Data Center Locally With Onsho",
    "url": "https://blog.giantswarm.io/replicate-data-center-locally-with-onsho/",
    "date_saved": "07/18/2016 09:42-04",
    "excerpt": "Two weeks ago we introduced Mayu and Yochu, a set of tools to set up customized CoreOS clusters on bare metal, available as open source. However, not everyone has access to some bare metal or spare&hellip;"
}, {
    "title": "Researchers Create Matrix-Like Instant Learning Through Brain Stimulation",
    "url": "http://techcrunch.com/2016/02/29/researchers-create-matrix-like-instant-learning-through-brain-stimulation/",
    "date_saved": "07/18/2016 09:41-02",
    "excerpt": "You know Kung-Fu. Researchers at HRL Laboratories have discovered that when you use transcranial direct current stimulation to send the brain activity of commercial and military pilots into the heads&hellip;"
}, {
    "title": "Teaching “algorithms for Big Data”",
    "url": "http://grigory.us/blog/teaching-algorithms-for-big-data/",
    "date_saved": "07/18/2016 11:31-01",
    "excerpt": "&#x201C;algorithms for Big Data&#x201D; (sometimes the name can slightly vary) is a new graduate class that has been introduced by many top computer science programs in the recent years. In this post&hellip;"
}, {
    "title": "The concept of different “learning styles” is one of the greatest neuroscience myths",
    "url": "http://qz.com/585143/the-concept-of-different-learning-styles-is-one-of-the-greatest-neuroscience-myths/",
    "date_saved": "07/18/2016 11:06-43",
    "excerpt": "Are you a visual learner who writes notes in a rainbow of different colors, or do you have to read something aloud before it will sink it? Chances are, you’ve been asked a similar question at some&hellip;"
}, {
    "title": "The Math I Learned After I Thought Had Already Learned Math",
    "url": "http://blog.mrmeyer.com/2015/the-math-i-learned-after-i-thought-had-already-learned-math/",
    "date_saved": "07/18/2016 11:12-07",
    "excerpt": "True story: it&#x2019;s possible to fly through your own secondary math education &#x2013; honor roll bumper sticker on your mom&#x2019;s minivan and all &#x2013;&#xA0;but miss some of the Very Big&hellip;"
}, {
    "title": "Three things I wish I knew earlier about Machine Learning",
    "url": "https://peadarcoyle.wordpress.com/2015/12/23/three-things-i-wish-i-knew-earlier-about-machine-learning/",
    "date_saved": "07/18/2016 11:30-38",
    "excerpt": "I&#x2019;ve been working with Machine Learning models both in academic and industrial settings for a few years now. I&#x2019;ve recently been watching the excellent Scalable ML&#xA0;from Mikio Braun,&hellip;"
}, {
    "title": "Toward an exploratory medium for mathematics",
    "url": "http://cognitivemedium.com/emm/emm.html",
    "date_saved": "07/18/2016 09:45-07",
    "excerpt": "The world's oldest complete piece of surviving music is the 3,400-year-old Hurrian cult hymn. The hymn was found inscribed on clay tablets excavated from the ancient city of Ugarit, in modern-day&hellip;"
}, {
    "title": "Turing machine",
    "url": "https://en.wikipedia.org/wiki/Turing_machine",
    "date_saved": "07/18/2016 10:37-18",
    "excerpt": "This article is about the symbol manipulator. For the deciphering machine, see Bombe. For the test of artificial intelligence, see Turing test. For the instrumental rock band, see Turing Machine&hellip;"
}, {
    "title": "WSO2 Machine Learner: Why would You care?",
    "url": "https://iwringer.wordpress.com/2015/09/25/wso2-machine-learner-why-would-you-care/",
    "date_saved": "07/18/2016 11:11-48",
    "excerpt": "After about a year worth of work, WSO2 Machine Learner (WSO2 ML) is officially out. You can find the pack from&#xA0;"
}
