---
title: "0 to Microservice in 5 minutes with Go, go-microservice-template and Minke"
url: "http://nicholasjackson.github.io/microservices/go/building-and-testing-microservices-part1/"
date_saved: "07/18/2016 09:39-15"
excerpt: "Introduction I went to a conference a few weeks ago which was angled at technology in the retail environment, by lunchtime nobody had mentioned the words &#x201C;Docker&#x201D; or&hellip;"
thumbnail: [![](png/0_to_microservice_in_5_minutes_with_go_gomicroservicetemplate_and_minke.png)](png/full/0_to_microservice_in_5_minutes_with_go_gomicroservicetemplate_and_minke.png)
---
title: 4 open source tools for Linux system monitoring
url: https://opensource.com/life/16/2/open-source-tools-system-monitoring
date_saved: 07/18/2016 10:15-02
excerpt: Information is the key to resolving any computer problem, including problems with or relating to Linux and the hardware on which it runs. There are many tools available for and included with most&hellip;
---
---
title: 60 YouTube channels that will make you smarter — Startups, Wanderlust, and Life Hacking
url: https://medium.com/swlh/60-youtube-channels-that-will-make-you-smarter-44d8315c2548#.rbw7y5v2g
date_saved: 07/18/2016 11:13-18
excerpt: Time is finite. Social media and Netflix can all too easily swallow our precious hours. So why not put them to better use on YouTube? Beyond the music, virals and gaming videos, YouTube has many&hellip;
---
---
title: AngularJS + MongoDB: Goodbye middle tier? (part 1 of 2)
url: http://www.codebulb.ch/2015/05/angularjs-mongodb-goodbye-middle-tier-part-1.html
date_saved: 07/18/2016 11:27-24
excerpt: With the advent of client side JavaScript frameworks, it seems like the middle tier has become Java&#x2019;s last resort. But as a Java developer myself, I have to admit there are compelling&hellip;
---
---
title: A Tribute to VMware Workstation, Fusion, and Hosted UI
url: http://blog.chipx86.com/2016/01/26/a-tribute-to-vmware-workstation-fusion-and-hosted-ui/
date_saved: 07/18/2016 10:38-09
excerpt: Yesterday morning, the Hosted UI team, responsible for VMware&#x2019;s Workstation and Fusion products, woke up to find themselves out of a job. These products, despite being award-winning and&hellip;
---
---
title: Best Hacking Tools Of 2016 For Windows, Mac OS X, And Linux
url: http://fossbytes.com/best-hacking-tools-of-2016-windows-linux-mac-osx/
date_saved: 07/18/2016 10:29-13
excerpt: We have compiled this list of top hacking tools of 2016 with their best features and download links. Read about them, learn how to use them and share your reviews to make this list better.Disclaimer:&hellip;
---
---
title: Brief survey on methods for attacking Tor hidden service
url: http://translate.wooyun.io/2015/09/19/Brief-survey-on-methods-for-attacking-Tor-hidden-service.html
date_saved: 07/18/2016 11:12-16
excerpt: Author:Phunter From:http://drops.wooyun.org/papers/8265 Recently, MIT published an article for their recent work of identifying the hidden service of Tor by circuit fingerprinting with website&hellip;
---
---
title: Building a Software as a Service (SaaS) Startup – Part 2
url: http://slatepeak.com/guides/building-a-software-as-a-service-saas-startup-pt-2/
date_saved: 07/18/2016 09:52-18
excerpt: In the first part of this series, I covered starting a basic server with Node and Express, as well as downloading some of the dependencies we will need while we&#x2019;re building our software as a&hellip;
---
---
title: Building a Software as a Service (SaaS) Startup – Part 3
url: http://slatepeak.com/guides/building-a-saas-startup-pt-3-restful-api/
date_saved: 07/18/2016 09:52-24
excerpt: This tutorial is part of a series. Part 1: How to Start a Node/Express Server Part 2: How to Authenticate an API with Passport and JWT If you have followed along with the first two parts of this&hellip;
---
---
title: Building your own LoRa network
url: https://docs.mbed.com/docs/lora-with-mbed/en/latest/intro-to-lora/
date_saved: 07/18/2016 09:37-21
excerpt: There is a lot of buzz around LoRa, a wide-area network solution that promises kilometers of range with very low power consumption; a perfect fit for the Internet of Things. A number of telecom&hellip;
---
---
title: Computer network
url: https://en.wikipedia.org/wiki/Computer_network
date_saved: 07/18/2016 10:55-23
excerpt: A computer network or data network is a telecommunications network which allows computers to exchange data. In computer networks, networked computing devices exchange data with each other using a&hellip;
---
---
title: Create a really, really simple offline page using Service Workers
url: http://deanhume.com/home/blogpost/create-a-really--really-simple-offline-page-using-service-workers/10135
date_saved: 07/18/2016 10:40-44
excerpt: Let's imagine for a second that you are on a train. The train is cruising through the countryside and you are reading an awesome article on the web using your mobile device. At the same moment that&hellip;
---
---
title: Create Your Own Streaming Service With Emby
url: http://www.linux.com/news/software/multimedia/854527-create-your-own-streaming-service-with-emby/
date_saved: 07/18/2016 11:12-36
excerpt: We live in an age where everything is moving to cloud. This trend of course has its own advantages and disadvantages. The biggest advantage is that we can access our data anywhere, anytime from any&hellip;
---
---
title: Creating an Ionic App with MySQL and Backand
url: http://blog.ionic.io/creating-an-ionic-app-with-mysql-and-backand/
date_saved: 07/18/2016 10:13-55
excerpt: Ionic makes it easy to create a user interface that ports easily across multiple devices, but most apps that do something of interest can&#x2019;t rely on their frontend alone. In this post,&hellip;
---
---
title: Going Over the Edge with your VMware NSX and Cisco Nexus
url: http://bradhedlund.com/2015/02/06/going-over-the-edge-with-your-vmware-nsx-and-cisco-nexus/
date_saved: 07/18/2016 10:51-27
excerpt: Hey! Cisco Nexus peeps! What could possibly be more fun than connecting your awesome new NSX gear to your Cisco Nexus gear? For the life of me I really don&#x2019;t know. &#xA0;All right then. Lets&hellip;
---
---
title: Google’s Future: Neural Networks & Artificial intelligence
url: http://www.mobiusmedia.co.uk/google-neural-networks-and-artificial-intelligence/
date_saved: 07/18/2016 10:10-54
excerpt: Has Google Glass been Scrapped? Google announced on Thursday that the Google Glass project has now &#x201C;graduated&#x201D; from Google[x] labs
---
---
title: GPS hacking (PART 1)
url: http://translate.wooyun.io/2016/02/04/41.html
date_saved: 07/18/2016 09:49-27
excerpt: Author: Kevin2600 From: http://drops.wooyun.org/tips/11155 0x00 Preface GPS hacking has alway been a hot topic on security conferences over the past few years. But the contents are over academic and&hellip;
---
---
title: #HackerLivesMatter
url: https://medium.com/@bryanedds/hackerlivesmatter-d5cf25bbeaac#.x8nf9tnu1
date_saved: 07/18/2016 09:49-57
excerpt: A strikingly large portion of the most talented developers engage in work that cannot be supported in commercial development environments. This is because those environments are far too compromising&hellip;
---
---
title: Hackers do the Haka – Part 1
url: http://thisissecurity.net/2015/11/23/hackers-do-the-haka-part-1/
date_saved: 07/18/2016 11:19-52
excerpt: Haka is an open source network security oriented language that allows writing security rules and protocol dissectors. In this first part of a two-part series, we will focus on writing security rules.&hellip;
---
---
title: Hacking GSM Signals with an RTL-SDR and Topguw
url: http://www.rtl-sdr.com/hacking-gsm-signals-with-an-rtl-sdr-and-topguw/
date_saved: 07/18/2016 11:13-41
excerpt: The ability to hack some GSM signals has been around for some time now, but the steps to reproduce the hack have been long and difficult to set up. Recently RTL-SDR.com reader&#xA0;Bastien wrote into&hellip;
---
---
title: Hacking the Zsun WiFi SD Card Reader
url: https://wiki.hackerspace.pl/projects:zsun-wifi-card-reader
date_saved: 07/18/2016 10:27-32
excerpt: The goal of this project is to learn as much as possible about the Zsun WiFi card reader and run OpenWrt on it to turn it into an awesome wifi device. People Involved Current status All the important&hellip;
---
---
title: Hacking your brain
url: http://www.economist.com/news/technology-quarterly/21645509-diy-bundle-electronics-or-ready-made-device-it-possible-stimulate
date_saved: 07/18/2016 10:10-03
excerpt: &#x201C;IT&#x2019;S like coffee times ten,&#x201D; raves one enthusiast. &#x201C;I use it a couple of times a week and problems solve themselves. At the end of the day, I haven&#x2019;t wasted hours&hellip;
---
---
title: hacksalot/HackMyResume
url: https://github.com/hacksalot/HackMyResume
date_saved: 07/18/2016 11:30-25
excerpt: Create polished r&#xE9;sum&#xE9;s and CVs in multiple formats from your command line or shell. Author in clean Markdown and JSON, export to Word, HTML, PDF, LaTeX, plain text, and other arbitrary&hellip;
---
---
title: How to access a Linux server behind NAT via reverse SSH tunnel
url: http://xmodulo.com/access-linux-server-behind-nat-reverse-ssh-tunnel.html
date_saved: 07/18/2016 09:58-43
excerpt: You are running a Linux server at home, which is behind a NAT router or restrictive firewall. Now you want to SSH to the home server while you are away from home. How would you set that up? SSH port&hellip;
---
---
title: How to Build a Really Small Hacking Box
url: http://null-byte.wonderhowto.com/how-to/build-really-small-hacking-box-0167942/
date_saved: 07/18/2016 10:28-14
excerpt: picoFlamingo
---
---
title: How to Configure apt-get behind proxy server for Ubuntu 14/15/16
url: http://www.unixmen.com/45713-2/
date_saved: 07/18/2016 09:37-50
excerpt: After Installing Ubuntu 16.04 to make some monitoring tests, I was not able to get or update behind the http/https/ftp&#xA0; proxy&#xA0; . Here how i solved this.i think this solution should work&hellip;
---
---
title: How to configure NFS Server and Client Configuration on Ubuntu 15.10
url: http://www.ubuntugeek.com/16480.html
date_saved: 07/18/2016 10:56-19
excerpt: NFS was developed at a time when we weren't able to share our drives like we are able to today -- in the Windows environment. It offers the ability to share the hard disk space of a big server with&hellip;
---
---
title: How to Install and Run Private Parse Server in Production
url: http://blog.kontena.io/how-to-install-and-run-private-parse-server-in-production/
date_saved: 07/18/2016 10:36-50
excerpt: 29 January 2016 Over the past few years, we have had pleasure to use Parse to provide robust backend for various projects. Unfortunately, Parse just announced they will be winding down the Parse&hellip;
---
---
title: How to install Mac OS X Yosemite 10.10 on VirtualBox?
url: http://hintdesk.com/how-to-install-mac-os-x-yosemite-10-10-on-virtualbox/
date_saved: 07/18/2016 09:36-11
excerpt: Years ago I wrote a post for installing Mac OS X on VirtualBox. At that time the version of Mac OS X was 10.7.3 Lion. The installation may not work with current version of VirtualBox anymore.&hellip;
---
---
title: How to monitor OpenFlow messages with packet sniffer
url: http://xmodulo.com/monitor-openflow-messages.html
date_saved: 07/18/2016 09:58-52
excerpt: OpenFlow was initially introduced in the academia as a way to enable innovation on production networks which had traditionally been built with close and proprietary networking hardware. OpenFlow&hellip;
---
---
title: How to Perform Network Sniffing with Tshark
url: http://linoxide.com/linux-how-to/network-sniffing-tshark/
date_saved: 07/18/2016 09:40-23
excerpt: This time let's talk about Tshark, a powerful command-line network analyzer that comes with the well known Wireshark. It works like Tcpdump,&#xA0;but with powerful decoders and filters, capable to&hellip;
---
---
title: How To Run Parse Server on Ubuntu 14.04
url: https://www.digitalocean.com/community/tutorials/how-to-run-parse-server-on-ubuntu-14-04
date_saved: 07/18/2016 10:29-00
excerpt: Parse is a Mobile Backend as a Service platform, owned by Facebook since 2013. In January of 2016, Parse announced that its hosted services would shut down in January of 2017. In order to help its&hellip;
---
---
title: How to Use Incron to Monitor Important Files and Folders
url: https://www.linux.com/learn/how-use-incron-monitor-important-files-and-folders
date_saved: 07/18/2016 09:35-08
excerpt: I&#x2019;ve seen it happen: a Linux server is taken over by a rootkit and no one was the wiser...at least not until some errant behavior occurred or something outside of the company reported an&hellip;
---
---
title: How To Use Systemctl to Manage Systemd Services and Units
url: https://www.digitalocean.com/community/tutorials/how-to-use-systemctl-to-manage-systemd-services-and-units
date_saved: 07/18/2016 11:31-07
excerpt: Introduction Systemd is an init system and system manager that is widely becoming the new standard for Linux machines. While there are considerable opinions about whether systemd is an improvement&hellip;
---
---
title: Introducing Vector Networks — Figma Design
url: https://medium.com/figma-design/introducing-vector-networks-3b877d2b864f#.9bfdtwvb0
date_saved: 07/18/2016 09:57-55
excerpt: Before I co-founded Figma my background was in game development, not in design. I remember being very surprised when I first encountered modern vector editing tools. Many of the interactions felt&hellip;
---
---
title: Making A Service Worker
url: https://www.smashingmagazine.com/2016/02/making-a-service-worker/
date_saved: 07/18/2016 09:35-13
excerpt: There&#x2019;s no shortage of boosterism or excitement about the fledgling service worker API, now shipping in some popular browsers. There are cookbooks and blog posts, code snippets and tools. But&hellip;
---
---
title: Mojolicious, Nginx and FastCGI
url: http://showmetheco.de/articles/2010/4/mojolicious-nginx-and-fastcgi.html
date_saved: 07/18/2016 11:31-34
excerpt: To use Mojolicious under nginx you should first install Mojo::Server::FCGI. We are going to use fcgi_prefork server, since we need a manager. Nginx configuration file needs a couple tweaks. Here is a&hellip;
---
---
title: Network Switching Tutorial
url: http://www.lantronix.com/resources/networking-tutorials/network-switching-tutorial/
date_saved: 07/18/2016 10:06-24
excerpt: Network Switching Switches can be a valuable asset to networking. Overall, they can increase the capacity and speed of your network. However, switching should not be seen as a cure-all for network&hellip;
---
---
title: nginx
url: http://www.aosabook.org/en/nginx.html
date_saved: 07/18/2016 11:19-23
excerpt: nginx (pronounced "engine x") is a free open source web server written by Igor Sysoev, a Russian software engineer. Since its public launch in 2004, nginx has focused on high performance, high&hellip;
---
---
title: PQCHacks
url: https://media.ccc.de/v/32c3-7210-pqchacks#video
date_saved: 07/18/2016 11:27-31
excerpt: ccc-tv C3TV - News C3TV - RSS, last 100 C3TV - Podcast feed of the last two years C3TV - Podcast audio feed of the last year
---
---
title: Report from the VMware GPL court hearing
url: http://laforge.gnumonks.org/blog/20160225-vmware-gpl/
date_saved: 07/18/2016 09:45-12
excerpt: Today, I took some time off to attend the court hearing in the GPL violation/infringement case that Christoph Hellwig has brought against VMware. I am not in any way legally involved in the lawsuit.&hellip;
---
---
title: SmartOS as a Virtualisation Platform
url: http://www.procmind.com/blog/2016/01/31/smartos-as-a-virtualisation-platform/
date_saved: 07/18/2016 10:28-54
excerpt: Virtualisation platforms and technologies represent a big focal point of the technology scene these days. Recently I&#x2019;ve watched a dockercon 2015 presentation by Bryan Cantrill, CTO of Joyent,&hellip;
---
---
title: Teen says he hacked CIA director’s AOL account
url: http://nypost.com/2015/10/18/stoner-high-school-student-says-he-hacked-the-cia/
date_saved: 07/18/2016 10:18-23
excerpt: Hillary Rodham Clinton&#x2019;s email scandal didn&#x2019;t stop the head of the CIA from using his own personal AOL account to stash work-related documents, according to a high school student who&hellip;
---
---
title: Telecoms Band Together to Virtualize and Open Source their Network Stacks
url: http://thenewstack.io/telecoms-band-together-virtualize-open-source-network-stacks/
date_saved: 07/18/2016 09:40-53
excerpt: A group of telecommunication companies and their software providers have come together to bring Network Functions Virtualization&#xA0;to their data centers. NFV is an industry-developed framework to&hellip;
---
---
title: Three tools to scan a Linux server for Malware and Rootkits
url: https://www.howtoforge.com/tutorial/how-to-scan-linux-for-malware-and-rootkits/
date_saved: 07/18/2016 09:59-54
excerpt: Servers connected to the internet are seeing a constant level of attacks and scans all day. While a firewall and regular system updates are a good first defense to keep the system safe, you should&hellip;
---
---
title: Top 30 Nmap Command Examples For Sys/Network Admins
url: http://www.cyberciti.biz/networking/nmap-command-examples-tutorials/
date_saved: 07/18/2016 09:35-27
excerpt: Nmap is short for Network Mapper. It is an open source security tool for network exploration, security scanning and auditing. However, nmap command comes with lots of options that can make the&hellip;
---
---
title: Wireless "smart skin" sensors to provide remote monitoring of infrastructure
url: http://www.rdmag.com/news/2013/04/wireless-smart-skin-sensors-provide-remote-monitoring-infrastructure
date_saved: 07/18/2016 10:08-09
excerpt: Major bridge failures in recent years have focused attention on the need to monitor America&#x2019;s highway bridges and other infrastructure. As thousands of bridges, parking garages, and other&hellip;
---
---
title: Writing Blazing Fast MySQL Queries
url: http://code.tutsplus.com/tutorials/writing-blazing-fast-mysql-queries--cms-25085
date_saved: 07/18/2016 10:31-44
excerpt: The differences between well written SQL and not are vast, and in production on a high-demand site they cause serious repercussions in performance and reliability of service. In this guide I will&hellip;
---
