---
title: Animating (dashed) lines with Spirographs
url: http://www.visualcinnamon.com/2016/01/animating-dashed-line-d3.html
date_saved: 07/18/2016 10:41-48
excerpt: In this blog I&#x2019;ll explain how to animate both solid and dashed lines. To make things slightly less boring, I&#x2019;ve created a Spirograph drawing app/script&#xA0;to use for the examples! It&hellip;
---
---
title: A Valid SSL Certificate for Every IP Address | Pivotal P.O.V.
url: https://blog.pivotal.io/labs/labs/sslip-io-a-valid-ssl-certificate-for-every-ip-address
date_saved: 07/18/2016 11:13-07
excerpt: sslip.io enables developers to equip their servers with valid SSL certificates for free (on the downside, the server's URI will be an awkward mash-up of the server's IP address and the sslip.io&hellip;
---
---
title: Brad Neuberg: Cloudless: Open Source Deep Learning Pipeline for Orbital Satellite Data
url: http://codinginparadise.org/ebooks/html/blog/introducing_cloudless.html
date_saved: 07/18/2016 10:04-58
excerpt: Introduction I'm proud to announce the 1.0 release of Cloudless, an open source computer vision pipeline for orbital satellite data, powered by data from Planet Labs and using deep learning under the&hellip;
---
---
title: Building an Intelligent Bot Using the Slack API
url: http://nordicapis.com/building-an-intelligent-bot-using-the-slack-api/
date_saved: 07/18/2016 10:38-50
excerpt: Slack is a messaging app that has exploded in popularity among all sorts of&#xA0;teams. One of the things that makes Slack so compelling is that it integrates well with all kinds of other&hellip;
---
---
title: Congressman with computer science degree: Encryption back-doors are ‘technologically stupid’
url: https://www.washingtonpost.com/news/the-switch/wp/2015/04/30/congressman-with-computer-science-degree-encryption-back-doors-are-technologically-stupid/
date_saved: 07/18/2016 10:12-46
excerpt: Rep. Ted Lieu (D-Calif.) questions the technical security of encryption back-doors in a recent hearing.  (YouTube) The debate over whether companies should be forced to build in ways for law&hellip;
---
---
title: Connect your Raspberry Pi to Wireless Enterprise Environments with WPA supplicant
url: https://netbeez.net/2014/10/14/connect-your-raspberry-pi-to-wireless-enterprise-environments-with-wpa-supplicant/
date_saved: 07/18/2016 10:57-21
excerpt: It&#x2019;s not a surprise that, at NetBeez, we love the Raspberry Pi! This little device can do magic on wired as well as wireless networks. Few weeks ago, Panos posted an article that offered some&hellip;
---
---
title: Create your first connected light using Raspberry Pi
url: http://lelylan.github.io/lab-projects/raspberry-pi-light/
date_saved: 07/18/2016 10:25-17
excerpt: To better understand how the Raspberry Pi sketch works, follows a brief description of what most important sections do. GPIO Setup Set GPIO mode to BOARD and set pin mode for the led and the button&hellip;
---
---
title: Developing With Sass and Chrome DevTools - Tuts+ Code Tutorial
url: http://code.tutsplus.com/tutorials/developing-with-sass-and-chrome-devtools--net-32805
date_saved: 07/18/2016 09:57-20
excerpt: In this article we'll take a look at how we can better integrate Chrome DevTools into our Sass development workflow. Tutorial Sneak Peek! Here's a peek of what we'll be doing in this tutorial via an&hellip;
---
---
title: DisplayLink #3 – Ubuntu 9.10 (32 bit)
url: http://mulchman.org/blog/?p=90
date_saved: 07/18/2016 10:01-26
excerpt: Well, it&#x2019;s time to see if I can get my DisplayLink device working on an old dying laptop using Ubuntu 9.10 (32 bit) &#x2013; so here goes. Install Ubuntu 9.10 (32 bit). &#xA0;Once finally&hellip;
---
---
title: DisplayLink
url: https://wiki.archlinux.org/index.php/DisplayLink
date_saved: 07/18/2016 09:57-30
excerpt: DisplayLink devices on Linux still only have experimental support. While some people have had success in using them, it is generally not an easy process and not guaranteed to work. The steps on this&hellip;
---
---
title: DisplayLink on Fedora Linux
url: https://nameq.wordpress.com/2011/09/21/displaylink-dl-165-running-on-linux-fedora/
date_saved: 07/18/2016 10:01-15
excerpt: As a next step I&#x2019;ve tailored this hexadecimal array into a C array as follows: unsigned char sony_sdmhs53_edid[] = { 0x00, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0x00, 0x4d, 0xd9, 0x50, 0x22,&hellip;
---
---
title: DisplayLink on Linux
url: http://mulchman.org/blog/?p=21
date_saved: 07/18/2016 10:00-02
excerpt: I bought a Sewell USB External Video Card as I wanted to extend my 2 monitor setup on my desktop machine into a 3 monitor setup. The desktop machine is my &#x2018;beefiest&#x2019; rig and it&#x2019;s&hellip;
---
---
title: DisplayLink USB 2.0 Graphics Adapters on Linux – 2014 Edition
url: http://plugable.com/2014/03/06/displaylink-usb-2-0-graphics-adapters-on-linux-2014-edition
date_saved: 07/18/2016 10:02-08
excerpt: A little over a year ago I wrote a blog post discussing the state of USB Graphics on Linux systems, specifically, Fedora 18. What follows is an update on the situation, looking at both Fedora 20 and&hellip;
---
---
title: DisplayLink USB Devices on Linux Kernel 3.4.0
url: http://plugable.com/2012/06/21/displaylink-usb-devices-on-linux-kernel-3-4-0
date_saved: 07/18/2016 10:01-39
excerpt: Linux kernel 3.4.0 is the first to include a new driver for DisplayLink-based USB 2.0 devices, called &#x201C;udl&#x201D;. udl is a port of the udlfb driver to Linux&#x2019;s DRM architecture. David&hellip;
---
---
title: DIY Linux autopilot - cool for cats... and geeks
url: http://diydrones.com/profiles/blogs/diy-linux-autopilot-cool-for-cats-and-geeks
date_saved: 07/18/2016 11:18-01
excerpt: I want to share with you the tremendous fun I'm having with the BBBmini DIY ArduPilot project, which I discovered during the summer. Hopefully, I can demonstrate what a sexy DIY Linux Autopilot for&hellip;
---
---
title: Easy data scraping with Google Apps Script in 5 minutes
url: http://www.kutil.org/2016/01/easy-data-scrapping-with-google-apps.html
date_saved: 07/18/2016 10:35-11
excerpt: I'm using Google Apps Script for a lot of things - from automate tasks to data analysis. I have discovered, that there was repetitive use-case: scrape data from web &#xA0;and parse exact value from&hellip;
---
---
title: Faraday Picks Las Vegas Suburb for $1 Billion Auto Plant
url: http://www.bloomberg.com/news/articles/2015-12-10/faraday-future-picks-las-vegas-suburb-for-1-billion-auto-plant
date_saved: 07/18/2016 10:21-31
excerpt: Faraday Future, the electric-vehicle startup backed by Chinese billionaire Jia Yueting, has chosen Nevada for the company&#x2019;s planned $1 billion U.S. factory."We hope to bring our $1 billion&hellip;
---
---
title: Fedora 18 and DisplayLink USB 2.0 Graphics Adapters
url: http://plugable.com/2013/01/18/fedora-18-and-displaylink-usb-2-0-graphics-adapters
date_saved: 07/18/2016 10:01-58
excerpt: With the recent release of Fedora 18, we have been testing the many changes and improvements to the DisplayLink software stack that have landed for this latest version of the popular open-source&hellip;
---
---
title: How a Math Genius Hacked OkCupid to Find True Love
url: http://www.wired.com/2014/01/how-to-hack-okcupid/
date_saved: 07/18/2016 10:08-15
excerpt: Emily Shur (Grooming by Andrea Pezzillo/Artmix Beauty) With that, he created two profiles, one with a photo of him rock climbing and the other of him playing guitar at a music gig. “Regardless of&hellip;
---
---
title: How Collecting Opium Antiques Turned Me Into an Opium Addict
url: http://www.collectorsweekly.com/articles/journey-into-the-opium-underworld/
date_saved: 07/18/2016 10:18-48
excerpt: You really have to work hard to get hooked on smoking opium. The Victorian-era form of the drug, known as chandu, is rare, and the people who know how to use it aren&#x2019;t exactly forthcoming. But&hellip;
---
---
title: How does it work in Mono's C# compiler?
url: http://www.codeproject.com/Articles/330184/How-does-it-work-in-Mono-s-C-compiler
date_saved: 07/18/2016 09:35-20
excerpt: Download source code - 1.78 MB Table of Contents Introduction Mono is an Open Source free programming language project. It is an implementation of Microsoft&#x2019;s .NET Framework based on the&hellip;
---
---
title: How I Taught Myself to Listen Despite My ADHD
url: http://lifehacker.com/how-i-taught-myself-to-listen-despite-my-adhd-1543097586
date_saved: 07/18/2016 10:08-20
excerpt: Those of you with attention deficit disorder might not make it to the end of this sentence. I had that problem as a kid, but I found ways to trick my brain into paying attention and listening&hellip;
---
---
title: Howto: DisplayLink USB Single Monitor on Linux
url: http://plugable.com/2011/12/23/usb-graphics-and-linux
date_saved: 07/18/2016 10:00-14
excerpt: Unfortunately, Linux doesn&#x2019;t support multiple graphics adapters the way Windows does, which means you can&#x2019;t just plug in USB graphics adapters and expect them to extend your desktop&hellip;
---
---
title: How to Install Mailpile with Nginx on Ubuntu 15.10
url: https://www.howtoforge.com/tutorial/how-to-install-mailpile-with-nginx-on-ubuntu-15-10/
date_saved: 07/18/2016 10:28-36
excerpt: Mailpile is an open source mail client that focuses on encryption and users privacy. Mailpile makes the PGP setup easy, it allows you to create PGP keys directly in the email application and send PGP&hellip;
---
---
title: How to turn the Raspberry Pi into a wireless printer server
url: http://www.techradar.com/how-to/computing/how-to-turn-the-raspberry-pi-into-a-wireless-printer-server-1312717
date_saved: 07/18/2016 10:56-06
excerpt: A printer isn't the most convenient of peripherals. They look out of place on most work desks and create quite a racket when spitting out pages. You could throw a few hundred quid on a snazzy new&hellip;
---
---
title: How to Use SSH Pipes on Linux
url: https://www.maketecheasier.com/ssh-pipes-linux/
date_saved: 07/18/2016 09:59-01
excerpt: Like most commands on Linux, SSH can be used with input/output redirection via | (Unix Pipe). SSH can be used with this pipeline too. The basic concept here is understanding how the Unix pipeline&hellip;
---
---
title: I’m afraid of Americans — The Bigger Picture
url: https://medium.com/bigger-picture/i-m-afraid-of-americans-65a6034ae014#.cbnzzu9ay
date_saved: 07/18/2016 10:21-21
excerpt: A few years ago I was working at Northwestern University when, one dull afternoon, everyone&#x2019;s phones, desk and cell, started ringing at the same time. I picked up my cell and heard an&hellip;
---
---
title: Inspiration for Line Menu Styles
url: http://tympanus.net/codrops/2016/01/06/inspiration-for-line-menu-styles/
date_saved: 07/18/2016 10:50-57
excerpt: Some ideas for menu styles and effects that employ the line as a creative design element. This is an open collection; contributions are welcome! View demo
---
---
title: Install Spotweb on Raspberry Pi for Personal Usenet Indexer
url: http://www.htpcguides.com/install-spotweb-on-raspberry-pi-for-personal-usenet-indexer/
date_saved: 07/18/2016 09:35-35
excerpt: Spotweb is a usenet indexing software very popular in the Netherlands. Spotweb has a simple interface for displaying&#xA0;the latest spots and associated nzbs. The Spotweb framework provides a&hellip;
---
---
title: Introducing Endpoint and Literate APIs
url: http://blog.tonicdev.com/2016/01/26/endpoint.html
date_saved: 07/18/2016 10:40-39
excerpt: We're excited to announce our latest feature: Tonic Endpoint. One thing we've always wanted is a great way to use Tonic to experiment with HTTP servers. Node is for servers, and now with Endpoint,&hellip;
---
---
title: Ionic and the Internet of Things, Part 5: A Connected Home and a Daft Punk-Inspired Robot Helmet
url: http://blog.ionic.io/ionic-and-the-internet-of-things-part-5-a-connected-home-and-a-daft-punk-inspired-robot-helmet/
date_saved: 07/18/2016 10:14-08
excerpt: By Katie on January 22, 2016 We&#x2019;re constantly excited by the creativity Ionic developers demonstrate when using Ionic for IoT projects. Ionic developer North McCormick, who started Ionic Uta
---
---
title: Lenovo LT1421 USB DisplayLink monitor on a RaspberryPi
url: https://www.igorkromin.net/index.php/2015/03/14/lenovo-lt1421-usb-displaylink-monitor-on-a-raspberrypi/
date_saved: 07/18/2016 10:00-23
excerpt: I started a project to build a photo frame out of a Raspberry Pi (Model A) and an old Lenovo LT1421 USB monitor that I've had laying around. There were lots of confusing posts on whether DisplayLink&hellip;
---
---
title: Lilliput DisplayLink monitor
url: http://wiki.wildsong.biz/index.php/Lilliput_DisplayLink_monitor
date_saved: 07/18/2016 10:00-30
excerpt: I am configuring this 7" USB connected monitor with 8track on a car computer. Mounting options I stuck a Ram mount 3" pad to the back of the monitor with foam back mounting tape. So far it's holding&hellip;
---
---
title: Lilliput DisplayLink USB Monitor UM-70 (17e9:02a9) with QNAP TS-110 on Debian Linux (armel)
url: http://karuppuswamy.com/wordpress/2011/04/11/lilliput-displaylink-usb-monitor-um-70-17e902a9-with-qnap-ts-110-on-debian-linux-armel/
date_saved: 07/18/2016 10:00-49
excerpt: Some times before I posted about how I got this monitor working in Ubuntu How to get Lilliput DisplayLink based USB Monitor UM-70 (17e9:02a9) working in Ubuntu Linux. This post is about&hellip;
---
---
title: Lilliput DisplayLink USB Monitor UM-70 (17e9:02a9) with Raspberry Pi on raspbian
url: http://karuppuswamy.com/wordpress/2012/08/17/lilliput-displaylink-usb-monitor-um-70-17e902a9-with-raspberry-pi-on-raspbian/
date_saved: 07/18/2016 10:00-57
excerpt: Some times before I posted about how I got this monitor working in Ubuntu&#xA0;How to get Lilliput DisplayLink based USB Monitor UM-70 (17e9:02a9) working in Ubuntu Linux. This post is about&hellip;
---
---
title: Model Parts for 3D Printing Using Context From Pix4D Reconstruction
url: http://www.stefangordon.com/3dprint-from-3d-reconstruction/
date_saved: 07/18/2016 10:03-56
excerpt: While constructing a new fixed wing drone I needed to design and 3d print a small mount for a GoPro action camera. &#xA0;Typically I would do this by taking a large number of measurements using a&hellip;
---
---
title: Pirate Bay Founder Builds The Ultimate Piracy Machine
url: https://torrentfreak.com/pirate-bay-founder-builds-the-ultimate-piracy-machine-151219/
date_saved: 07/18/2016 11:27-10
excerpt: Former Pirate Bay spokesperson Peter Sunde has always been very outspoken about people&#x2019;s inherent drive to copy things. Last year he paid the ultimate price of sacrificing his freedom for his&hellip;
---
---
title: PiscesMATEImages
url: https://www.raspbian.org/PiscesMATEImages
date_saved: 07/18/2016 09:57-26
excerpt: UPDATED TO MATE v1.4 - Aug. 17, 2012 Please Note: The Raspberry Pi Foundation has produced and released their own recommended image of Raspbian that can be obtained directly from the Raspberry Pi&hellip;
---
---
title: Ramping up with Rigger: Deploying Deis on DigitalOcean
url: https://deis.com/blog/2016/ramping-up-rigger-deploying-deis-digitalocean
date_saved: 07/18/2016 10:36-12
excerpt: Deis is an open source private Platform as a Service (PaaS) that simplifies deploying and managing your applications on your own servers. By leveraging technologies such as Docker and CoreOS, Deis&hellip;
---
---
title: Raspberry Pi and Distributed Network Monitoring: Iperf
url: https://netbeez.net/2014/08/19/raspberry-pi-and-distributed-network-monitoring-iperf/
date_saved: 07/18/2016 10:57-16
excerpt: The Raspberry Pi (RPi) has been a smash hit in so many different areas. Hobbyists love them and professionals have found a reliable, low-cost, and small-footprint platform to build commercial&hellip;
---
---
title: Raspberry Pi as a Network Monitoring Node
url: http://www.networkworld.com/article/2225683/cisco-subnet/raspberry-pi-as-a-network-monitoring-node.html
date_saved: 07/18/2016 10:57-29
excerpt: The Raspberry Pi is an amazing little inexpensive Linux-based computer. It has been remarkably successful and there have been over 1 million Raspberry Pi systems sold. The Raspberry Pi can also be a&hellip;
---
---
title: Raspberry Pi GUI Tutorial
url: https://www.baldengineer.com/raspberry-pi-gui-tutorial.html
date_saved: 07/18/2016 10:03-35
excerpt: My favorite Raspberry Pi add-on is the PiTFT from Adafruit. With it, you easily get a Raspberry Pi GUI interface and touch screen. The PiTFT software install is just a few things and it is good to go.
---
---
title: Raspberry Pi Kernel Compile
url: http://mitchtech.net/raspberry-pi-kernel-compile/
date_saved: 07/18/2016 10:00-42
excerpt: 27 This tutorial will demonstrate how to cross compile the kernel for the Raspberry Pi on Ubuntu 12.04 LTS. The kernel is functional with both the Debian and Arch Linux Raspberry Pi images.&hellip;
---
---
title: Raspberry Pi
url: https://www.raspberrypi.org/blog/the-eagerly-awaited-raspberry-pi-display/
date_saved: 07/18/2016 10:03-21
excerpt: You&#x2019;ve been incredibly patient: thank you. The official Raspberry Pi touch display is on sale today, priced at $60 (plus local taxes and shipping): you can buy it at the Swag Store, at RS&hellip;
---
---
title: README:Shipit-deploy.md
url: https://gist.github.com/chimon2000/47ca242d619b206d72e1
date_saved: 07/18/2016 10:31-55
excerpt: Skip to content Create a gist now Instantly share code, notes, and snippets. Something went wrong with that request. Please try again.
---
---
title: Setting Up Your Own PaaS and CI/CD Pipeline
url: https://deis.com/blog/2016/paas-continuous-integration-deployment
date_saved: 07/18/2016 10:36-07
excerpt: Docker and the ecosystem around it have done some great things for developers, but from an operational standpoint, it's mostly just the same old issues with a fresh coat of paint. Real change happens&hellip;
---
---
title: SGA, MassPIRG work together on open source textbook initiative
url: http://dailycollegian.com/2016/02/11/sga-masspirg-work-together-on-open-source-textbook-initiative/
date_saved: 07/18/2016 10:05-39
excerpt: Posted by Stuart Foster on February 11, 2016 &#xB7; Leave a Comment&#xA0; (Judith Gibson-Okunieff/Daily Collegian) Members of the Student Government Association and MassPIRG are seek
---
---
title: Swift Functors, Applicatives, and Monads in Pictures
url: http://www.mokacoding.com/blog/functor-applicative-monads-in-pictures/
date_saved: 07/18/2016 10:24-59
excerpt: This is a translation of Functors, Applicatives, And Monads In Pictures from Haskell into Swift. I don't want to take any merit for writing this, I only went through the fun exercise of translating&hellip;
---
---
title: The Entrepreneur Disrupting The Tech World By Spilling Her Company’s Secrets
url: https://collectively.org/en/article/the-entrepreneur-disrupting-the-tech-world-by-spilling-her-companys-secrets/
date_saved: 07/18/2016 10:13-20
excerpt: At the age of 25,&#xA0;Limor Fried founded Adafuit, ten years ago, with the&#xA0;goal of creating the go-to online hub&#xA0;for learning electronics and creating the best designed products for makers&hellip;
---
---
title: The new art of war: How trolls, hackers and spies are rewriting the rules of conflict
url: http://toinformistoinfluence.com/2015/09/15/the-new-art-of-war-how-trolls-hackers-and-spies-are-rewriting-the-rules-of-conflict/
date_saved: 07/18/2016 11:12-42
excerpt: It is nice to read an article that rolls cyber into information warfare. Cyber is not done for cyber&#x2019;s sake, although almost the entire cyber community thinks in those terms &#x2013; never&hellip;
---
---
title: The Pine A64 is about to become the cheapest ARM 64-bit platform to run Docker · Docker Pirates ARMed with explosive stuff
url: http://blog.hypriot.com/post/the-pine-a64-is-about-to-become=the-cheapest-ARM-64-bit-platform-to-run-Docker/
date_saved: 07/18/2016 10:34-42
excerpt: Mon, Jan 25, 2016 Last Saturday one of the more promising Kickstarter campaigns that picked our curiosity ended after 44 days and was able to raise 1.7 million dollars. It was a campaign to fund the&hellip;
---
---
title: The Research Pirates of the Dark Web
url: http://www.theatlantic.com/technology/archive/2016/02/the-research-pirates-of-the-dark-web/461829/
date_saved: 07/18/2016 10:15-48
excerpt: Reuters Donald Trump and the Twilight of White America Racial resentment and economic anxiety are not separate forces. For many Trump supporters, they are inextricably linked. On June 25, 2015, a&hellip;
---
---
title: This API is so Fetching!
url: https://hacks.mozilla.org/2015/03/this-api-is-so-fetching/
date_saved: 07/18/2016 11:07-15
excerpt: For more than a decade the Web has used XMLHttpRequest (XHR) to achieve asynchronous requests in JavaScript. While very useful, XHR is not a very nice API. It suffers from lack of separation of&hellip;
---
---
title: trinker/topicmodels_learning
url: https://github.com/trinker/topicmodels_learning
date_saved: 07/18/2016 10:41-44
excerpt: Topic Models Learning and R Resources This is a collection documenting the resources I find related to topic models with an R flavored focus. A topic model is a type of generative model used to&hellip;
---
---
title: Two Documentaries Introduce Delia Derbyshire, the Pioneer in Electronic Music
url: http://www.openculture.com/2015/07/two-documentaries-introduce-delia-derbyshire-the-pioneer-in-electronic-music.html
date_saved: 07/18/2016 11:07-24
excerpt: With her buttoned-up style, work with the UN, and name like a plucky character in a certain English wizard series, Delia Derbyshire&#xA0;may not seem a likely pioneer of experimental electronic&hellip;
---
---
title: Using HTML5's Native Drag and Drop API
url: http://www.sitepoint.com/html5-native-drag-and-drop-api/
date_saved: 07/18/2016 10:38-19
excerpt: Everyone loves an easy-to-use and interactive user interface and ever since the introduction of smartphones there has been a jump in expectations from users; The expectation is that your website will&hellip;
---
---
title: Using The Gamepad API In Web Games – Smashing Magazine
url: https://www.smashingmagazine.com/2015/11/gamepad-api-in-web-games/
date_saved: 07/18/2016 10:06-57
excerpt: The Gamepad API is a relatively new piece of technology that allows us to access the state of connected gamepads using JavaScript, which is great news for HTML5 game developers. A lot of game genres,&hellip;
---
---
title: When coding style survives compilation: De-anonymizing programmers from executable binaries
url: https://freedom-to-tinker.com/blog/aylin/when-coding-style-survives-compilation-de-anonymizing-programmers-from-executable-binaries/
date_saved: 07/18/2016 11:15-40
excerpt: In a recent paper, we showed that coding style is present in source code and can be used to de-anonymize programmers. But what if only compiled binaries are available, rather than source code? Today&hellip;
---
