---
title: 100+ Best Node.js Frameworks
url: http://www.cssauthor.com/node-js-frameworks/
date_saved: 07/18/2016 11:00-03
excerpt: Node.js is the platform built on chrome&#x2019;s javascript runtime for easily building fast, scalable network applications. It uses an event-driven non-blocking IO modal that makes it lightweight&hellip;
---
---
title: "10 Cool Things You Can Do with CodePen and JavaScript"
url: "https://www.sitepoint.com/cool-things-codepen-javascript/"
date_saved: "07/19/2016 07:59-09"
excerpt: "Hey web people! I work on CodePen a playground for front end web design and development. One of the things you can do on CodePen is create Pens, which are HTML, CSS, and JavaScript you create and see&hellip;"
thumbnail: [![](png/10_cool_things_you_can_do_with_codepen_and_javascript.png)](png/full/10_cool_things_you_can_do_with_codepen_and_javascript.png)
---
title: 4 JavaScript Design Patterns You Should Know
url: https://scotch.io/bar-talk/4-javascript-design-patterns-you-should-know
date_saved: 07/18/2016 10:39-52
excerpt: The Scotchmas Day 2 giveaway can be found at the end of this article. Every developer strives to write maintainable, readable, and reusable code. Code structuring becomes more important as&hellip;
---
---
title: A Beginner’s Guide To Grunt: Build Tool for JavaScript
url: http://designmodo.com/grunt/
date_saved: 07/18/2016 10:32-54
excerpt: Modern Web development is rapidly moving toward more complicated client-side applications. The ability to build more advanced applications requires more sophisticated tools that allow developers to&hellip;
---
---
title: A Beginners Guide to Mobile Development with Meteor
url: http://www.sitepoint.com/beginners-guide-mobile-development-meteor/
date_saved: 07/18/2016 10:58-43
excerpt: Out of the box, the Meteor JavaScript framework includes Cordova, &#x201C;a set of device APIs that allow a mobile app developer to access native device functions such as the camera or accelerometer&hellip;
---
---
title: A Dive Into Plain JavaScript
url: http://blog.adtile.me/2014/01/16/a-dive-into-plain-javascript/
date_saved: 07/18/2016 09:50-48
excerpt: While I&#x2019;ve worked over a decade building various websites, it has only been the past 3 years that I&#x2019;ve started learning more on how to work with plain JavaScript, instead of using&hellip;
---
---
title: Advanced jQuery Mobile tutorial – Part 1 – Responsive design
url: http://www.gajotres.net/advanced-jquery-mobile-tutorial-part-1-responsive-design/
date_saved: 07/18/2016 11:06-31
excerpt: I intended to write this article one year ago just as I started writing this blog. It is meant for jQuery Mobile developers, doesn&#x2019;t matter how advanced your knowledge is. I will try to cover&hellip;
---
---
title: A Gentle Introduction to Functional JavaScript: Part 1
url: http://jrsinclair.com/articles/2016/gentle-introduction-to-functional-javascript-intro/
date_saved: 07/18/2016 09:57-59
excerpt: This is part one of a threefour-part series introducing &#x2018;functional&#x2019; programming in JavaScript. In this article we take a look at the building blocks that make JavaScript a&hellip;
---
---
title: A Gentle Introduction to Functional JavaScript: Part 2
url: http://jrsinclair.com/articles/2016/gentle-introduction-to-functional-javascript-arrays/
date_saved: 07/18/2016 09:41-54
excerpt: This is part two of a three-part series introducing &#x2018;functional&#x2019; programming in JavaScript. In the previous article, we saw how functions can be used to make certain code abstractions&hellip;
---
---
title: A Gentle Introduction to Functional JavaScript: Part 3
url: http://jrsinclair.com/articles/2016/gentle-introduction-to-functional-javascript-functions/
date_saved: 07/18/2016 09:41-50
excerpt: This is part three of a four-part series introducing &#x2018;functional&#x2019; programming in JavaScript. In the last article we saw how we can use functional programming with arrays and lists. In&hellip;
---
---
title: A Gentle Introduction to Functional JavaScript: Part 4
url: http://jrsinclair.com/articles/2016/gentle-introduction-to-functional-javascript-style/
date_saved: 07/18/2016 09:41-46
excerpt: This is part four of a four-part introduction to functional programming in JavaScript. In the last article we looked at higher-order functions: functions for making functions. Inthis article, we&hellip;
---
---
title: Authenticate a Node.js API with JSON Web Tokens
url: https://scotch.io/tutorials/authenticate-a-node-js-api-with-json-web-tokens
date_saved: 07/18/2016 10:59-03
excerpt: Introduction Authentication is one of the big parts of every application. Security is always something that is changing and evolving. In the past, we have gone over Node authentication using the&hellip;
---
---
title: Becoming fully reactive: an in-depth explanation of Mobservable
url: https://medium.com/@mweststrate/becoming-fully-reactive-an-in-depth-explanation-of-mobservable-55995262a254#.1ue3s24h2
date_saved: 07/18/2016 11:15-19
excerpt: Due to popular demand (and to have a cool story for my grand-children), these are the inner workings of Mobservable. A lot of people are surprised how consis
---
---
title: Build A Real-Time Twitter Stream with Node and React.js
url: https://scotch.io/tutorials/build-a-real-time-twitter-stream-with-node-and-react-js
date_saved: 07/18/2016 10:59-13
excerpt: Introduction Welcome to the second installation of Learning React, a series of articles focused on becoming proficient and effective with Facebook&#x2019;s React library. If you haven&#x2019;t read&hellip;
---
---
title: Build a WhatsApp clone with Meteor and Ionic - Meteor Platform version
url: http://info.meteor.com/blog/whatsapp-with-meteor-angular-and-ionic
date_saved: 07/18/2016 10:27-04
excerpt: Now that Angular is a first class citizen in Meteor, you can use all of its vast libraries, giving you full access to the Angular ecosystem.&#xA0;Also,&#xA0;Ionic recently added official support for&hellip;
---
---
title: Building a Blog with React
url: https://themeteorchef.com/recipes/building-a-blog-with-react/
date_saved: 07/18/2016 10:50-36
excerpt: What we're going to learn In this recipe, we'll work with HD Buff, a curated video streaming service to create a blog for their website using React. We'll see how to create a simple admin area,&hellip;
---
---
title: Building a customized accounts ui for Meteor
url: http://blog.benmcmahen.com/post/41741539120/building-a-customized-accounts-ui-for-meteor
date_saved: 07/18/2016 10:58-35
excerpt: This is the third article in a series aimed at explaining how I built fiddleware Subtitles. You can also learn how to build the timeline using d3 and SVG, and how to embed local videos into your web&hellip;
---
---
title: Building a React Universal Blog App: A Step-by-Step Guide
url: http://www.sitepoint.com/building-a-react-universal-blog-app-a-step-by-step-guide/
date_saved: 07/18/2016 10:02-38
excerpt: When we think of single page applications (SPAs) we think browsers, JavaScript, speed and, in my case, invisibility to search engines. This is because a SPA renders a page&#x2019;s content using&hellip;
---
---
title: Building a React Universal Blog App: Implementing Flux
url: http://www.sitepoint.com/building-a-react-universal-blog-app-implementing-flux/
date_saved: 07/18/2016 10:32-11
excerpt: In the first part of this mini-series we&#x2019;ve started digging into the world of React and see how we can use it, together with Node.js, to build a React Universal Blog App. In this second and&hellip;
---
---
title: Building a Slack Clone in Meteor.js: Getting Started
url: https://scotch.io/tutorials/building-a-slack-clone-in-meteor-js-getting-started
date_saved: 07/18/2016 11:08-49
excerpt: This is the first of a five-part series on building a Slack clone using Meteor. The aim of these tutorials are not just for you to blindly follow instructions, but it&#x2019;s our hope that&hellip;
---
---
title: Building news feeds & activity streams with Meteor
url: http://blog.getstream.io/post/136611889848/building-news-feeds-activity-streams-with-meteor
date_saved: 07/18/2016 10:55-40
excerpt: Today we are happy to announce stream-meteor. This integration library makes it easy to build scalable newsfeeds and activity streams for your Meteor app. It&#x2019;s powered by getstream.io and&hellip;
---
---
title: Building Your First React.js App — Learning New Stuff
url: https://medium.com/learning-new-stuff/building-your-first-react-js-app-d53b0c98dc#.a1rnyzcwv
date_saved: 07/18/2016 10:39-48
excerpt: This tutorial is suitable from age 3. Credit: Donnie Ray JonesThis article will take you through every step of building the simplest React app possible. Even simpler than a to-do list.
---
---
title: Create a GitHub File Explorer Using Vue.js
url: https://scotch.io/tutorials/create-a-github-file-explorer-using-vue-js
date_saved: 07/18/2016 10:59-40
excerpt: Vue.js makes everything easy. Creating seemingly complex applications becomes super simple and is something that can be done in much less time than previously. We will demonstrate this by creating a&hellip;
---
---
title: Creating a Dictionary App Using React Native for Android - Envato Tuts+ Code Tutorial
url: http://code.tutsplus.com/tutorials/creating-a-dictionary-app-using-react-native-for-android--cms-24969
date_saved: 07/18/2016 10:50-52
excerpt: Introduction Facebook&#x2019;s React Native is a powerful framework that allows you to quickly and effortlessly build Android and iOS apps using just JavaScript and JSX. Apps built using React Native&hellip;
---
---
title: Creating a GraphQL Server with Node.js and MongoDB
url: http://www.sitepoint.com/creating-graphql-server-nodejs-mongodb/
date_saved: 07/18/2016 09:36-45
excerpt: This article was peer reviewed by Ryan Chenkie. Thanks to all of SitePoint&#x2019;s peer reviewers for making SitePoint content the best it can be! Requesting data from the server on the client side&hellip;
---
---
title: Creating a Photo Discovery App with NW.js (part 1)
url: https://scotch.io/tutorials/creating-a-photo-discovery-app-with-nw-js-part-1
date_saved: 07/18/2016 09:41-36
excerpt: NW.js (formerly known as Node Webkit) is a framework for creating cross-platform desktop applications using HTML, CSS, and JavaScript. In this tutorial, we&#x2019;re going to a desktop application&hellip;
---
---
title: Creating a Photo Discovery App with NW.js (part 2)
url: https://scotch.io/tutorials/creating-a-photo-discovery-app-with-nw-js-part-2
date_saved: 07/18/2016 09:41-29
excerpt: NW.js (formerly known as Node Webkit) is a framework for creating cross-platform desktop applications using HTML, CSS, and JavaScript. This is part 2 of our tutorial on building a Photo Discovery App&hellip;
---
---
title: Creating a Simple RESTful Web App with Node.js, Express, and MongoDB
url: http://cwbuecheler.com/web/tutorials/2014/restful-web-app-node-express-mongodb/
date_saved: 07/18/2016 10:59-54
excerpt: By Christopher Buecheler Last Updated: June 7, 2015 You can find/fork the sample project on GitHub Hey! This and all my other tutorials will soon be moving to a new home at CloseBrace, a site for&hellip;
---
---
title: Creating A Simple Shopping Cart with React.js and Flux
url: https://scotch.io/tutorials/creating-a-simple-shopping-cart-with-react-js-and-flux
date_saved: 07/18/2016 10:59-19
excerpt: Introduction Welcome to the fourth and final installment of the Learning React series! Up to this point, we&#x2019;ve learned how React&#x2019;s API allows us to create rich stateful components, how&hellip;
---
---
title: Creating Node.js Command Line Utilities to Improve Your Workflow
url: http://developer.telerik.com/featured/creating-node-js-command-line-utilities-improve-workflow/
date_saved: 07/18/2016 10:27-50
excerpt: Once upon a time, the command line seemed scary and intimidating to me. I felt as if it stared back at me blankly like the price tag on something extremely expensive saying, &#x201C;If you have to&hellip;
---
---
title: Data Structures With JavaScript: Singly-Linked List and Doubly-Linked List - Tuts+ Code Article
url: http://code.tutsplus.com/articles/data-structures-with-javascript-singly-linked-list-and-doubly-linked-list--cms-23392
date_saved: 07/18/2016 10:41-13
excerpt: What You'll Be CreatingTwo of the most commonly taught data structures in computer science are the singly-linked list and doubly-linked list.&#xA0;When I was taught these data structures, I asked my&hellip;
---
---
title: Data Structures With JavaScript: Stack and Queue - Tuts+ Code Article
url: http://code.tutsplus.com/articles/data-structures-with-javascript-stack-and-queue--cms-23348
date_saved: 07/18/2016 10:41-19
excerpt: What You'll Be CreatingTwo of the most commonly used data structures in web development are stacks and queues. Many users of the Internet, including web developers, are unaware of this amazing fact.&hellip;
---
---
title: Data Structures With JavaScript: Tree - Tuts+ Code Article
url: http://code.tutsplus.com/articles/data-structures-with-javascript-tree--cms-23393
date_saved: 07/18/2016 10:41-02
excerpt: What You'll Be CreatingTrees are one of the most commonly used data structures in web development. This statement holds true for both developers and users. Every web developer who has written HTML&hellip;
---
---
title: Data Structures With JavaScript: What's a Data Structure? - Tuts+ Code Tutorial
url: http://code.tutsplus.com/tutorials/data-structures-with-javascript-whats-a-data-structure--cms-23347
date_saved: 07/18/2016 10:41-24
excerpt: What You'll Be CreatingI&#x2019;ve always considered the term &#x201C;data structure&#x201D; to be confusing. What the heck is it? Is it data with structure, which is an equally ambiguous&hellip;
---
---
title: Develop command line application using NodeJS
url: https://codeforgeek.com/2015/09/command-line-application-nodejs/
date_saved: 07/18/2016 11:13-28
excerpt: Node.js provides utilities to develop command line application. There are some cool application like express-geenrator and nodemo
---
---
title: Developing our first iOS App with React Native
url: http://code.hireart.com/2016/02/24/react-native-ios-app/
date_saved: 07/18/2016 09:45-25
excerpt: When we started talking about creating a mobile app for our candidates, we were pretty clueless about what it would actually take to build a mobile app. We knew generally that we wanted something&hellip;
---
---
title: Discover Meteor
url: https://www.discovermeteor.com/blog/javascript-for-meteor/
date_saved: 07/18/2016 10:52-12
excerpt: JavaScript is a language full of contradictions: it&#x2019;s named after Java even though it doesn&#x2019;t have anything to do with it, it was created in 10 days but is still in use 20 years later,&hellip;
---
---
title: Elmish: Functional Programming in Javascript
url: https://medium.com/@chetcorcos/elmish-functional-programming-in-javascript-50995f1d4b9e#.lgnk6tq4u
date_saved: 07/18/2016 09:46-59
excerpt: For the past few months, I’ve been on adventure learning everything I could about functional programming. It seems like every week there’s a new frontend framework or library claiming some&hellip;
---
---
title: First Experiences Scaling A Meteor App
url: https://medium.com/@eliezer/first-experiences-scaling-a-meteor-app-14a48e62a4af#.446yipl8h
date_saved: 07/18/2016 09:37-56
excerpt: Recently I went through the challenge and ordeal of having to scale my Meteor app. It’s a project that had already been running in production for about a year. This summer the app became a lot more&hellip;
---
---
title: Flux and Meteor harmony
url: https://medium.com/@borellvi/flux-and-meteor-harmony-7180680257e8#.o9f27pa28
date_saved: 07/18/2016 09:47-38
excerpt: Meteor’s integration with npm is a game changerA month ago I wrote a short article and I did a short
---
---
title: Functions are first class objects in javascript
url: http://helephant.com/2008/08/19/functions-are-first-class-objects-in-javascript/
date_saved: 07/18/2016 09:50-23
excerpt: Functions in javascript are first class objects. This means that javascript functions are just a special type of object that can do all the things that regular objects can do. Really, just like any&hellip;
---
---
title: Getting Started with Node.js + MySQL
url: https://www.codementor.io/nodejs/tutorial/node-js-mysql
date_saved: 07/18/2016 10:52-19
excerpt: Through code examples, this Node.js Tutorial will teach you how to get started with using MySQL, how to use it in production, and how to test the concurrent users. The article was originally posted&hellip;
---
---
title: Getting Started with React
url: https://themeteorchef.com/recipes/getting-started-with-react/
date_saved: 07/18/2016 10:50-22
excerpt: What we're going to learn In this recipe, we'll learn how to get started with the React user interface library. We'll refactor Base, the starter kit used here at The Meteor Chef, replacing Blaze with&hellip;
---
---
title: Getting To Know Flux, the React.js Architecture
url: https://scotch.io/tutorials/getting-to-know-flux-the-react-js-architecture
date_saved: 07/18/2016 10:59-29
excerpt: So what&#x2019;s this Dispatcher all about? The Dispatcher is basically the manager of this entire process. It is the central hub for your application. The dispatcher receives actions and dispatches&hellip;
---
---
title: Getting your C++ to the Web with Node.js
url: http://blog.scottfrees.com/getting-your-c-to-the-web-with-node-js
date_saved: 07/18/2016 11:15-31
excerpt: So, you've got some old C or C++ code, playing an important role in your business - but you desperately want to get that functionality on the web - maybe just internally to streamline your workflow,&hellip;
---
---
title: How to Build Node.js Barcode Reader on Windows, Linux and Mac
url: http://www.codeproject.com/Articles/1078098/How-to-Build-Node-js-Barcode-Reader-on-Windows-Lin
date_saved: 07/18/2016 10:04-45
excerpt: More and more Web developers tend to choose Node.js to build their Website because it is convenient to build complex server-side Web applications using only JavaScript. To extend and empower the&hellip;
---
---
title: "How to Create a Distributable JavaScript Component: bit-social"
url: "http://blog.bitovi.com/distributable-javascript-component/"
date_saved: "07/19/2016 07:58-15"
excerpt: "This article will show how to create a JavaScript component for sharing content through social media link (bit-social) and make it distributable to a wide audience using AMD, CommonJS, or even script&hellip;"
thumbnail: [![](png/how_to_create_a_distributable_javascript_component_bitsocial.png)](png/full/how_to_create_a_distributable_javascript_component_bitsocial.png)
---
title: How to Create a News Reader With React Native: Setup and News Item Component - Envato Tuts+ Code Tutorial
url: http://code.tutsplus.com/tutorials/how-to-create-a-news-reader-with-react-native-setup-and-news-item-component--cms-25935
date_saved: 07/18/2016 09:39-36
excerpt: In this tutorial, we'll be creating a news reader app with React Native. In this two-part series, I'm going to&#xA0;assume that this isn't your first React Native app and&#xA0;I won't go too much&hellip;
---
---
title: How to Create a Smart Device With Arduino and Node.js Using PubNub - Envato Tuts+ Code Tutorial
url: http://code.tutsplus.com/tutorials/how-to-create-a-smart-device-with-arduino-and-nodejs-using-pubnub--cms-25508
date_saved: 07/18/2016 10:34-36
excerpt: With the rise of the maker movement&#x2014;Maker Faire, 3D printers, DIY robots, drones, and so on&#x2014;the popularity of Arduino, an open-source, microcontroller-based kit, has turned many&hellip;
---
---
title: How to Create Cross-Platform Desktop Apps with NW.js
url: https://www.codementor.io/javascript/tutorial/how-to-create-cross-platform-desktop-apps-with-nwjs
date_saved: 07/18/2016 10:52-49
excerpt: After creating two successful apps based on NW.js, Messenger for Desktop and WhatsApp for Desktop, I was told that I should create a tutorial. So here I am, telling you (almost) all there is to know&hellip;
---
---
title: How to Develop iOS Apps on Linux using React Native
url: http://www.proreactnative.com/How-to-Develop-iOS-Apps-on-Linux-Using-React-Native/
date_saved: 07/18/2016 09:57-46
excerpt: Hey there, Linux user! Are you trying to develop iOS apps, but don't want to spring for a Mac? Or, perhaps you have plenty of cash, but using a closed-source operating system brings you pain? I know&hellip;
---
---
title: How to make a carousel using only HTML and CSS (no JavaScript required!)
url: http://dancort.es/web-design/2015/05/17/how-to-make-carousel-only-html-css-no-javascript.html
date_saved: 07/18/2016 11:20-33
excerpt: Recently, I&#x2019;ve been working on a site that uses a CMS that&#x2019;s a bit limiting. I can add my own HTML and CSS to the site, but JavaScript is off-limits. The designs I&#x2019;m working from&hellip;
---
---
title: How to make Multi-Layered Parallax Illustration with CSS & Javascript
url: https://medium.com/@PatrykZabielski/how-to-make-multi-layered-parallax-illustration-with-css-javascript-2b56883c3f27#.ihm1rcnnu
date_saved: 07/18/2016 09:37-34
excerpt: The Painting used for the parallax effect, made by Patryk Zabielski.Hey friends, I will be showing you how to create a simple multi-layered illustration with depth that transitions into the content&hellip;
---
---
title: How to process geospatial data with Node.js and TURF
url: http://blog.webkid.io/how-to-handle-geospatial-data-with-nodejs-and-turf/
date_saved: 07/18/2016 09:55-01
excerpt: In the last two years we created several map projects. When you do projects like this it&#x2019;s a common task that you have to process geospatial data before you can use it. You have to filter it,&hellip;
---
---
title: How to Speed Up Meteor Development with Scaffolding And Automatic Form Generation
url: https://scotch.io/tutorials/how-to-speed-up-meteor-development-with-scaffolding-and-automatic-form-generation
date_saved: 07/18/2016 10:49-20
excerpt: Meteor is a web development platform built on top of Node.js and MongoDB. It covers client and server development in JavaScript and fully supports real time behavior and reactivity (automatic update&hellip;
---
---
title: HTTP Live Streaming In Javascript
url: https://blog.peer5.com/http-live-streaming-in-javascript/
date_saved: 07/18/2016 11:10-58
excerpt: A flashocalypse is approaching - paraphrasing John Luther, JW Player (TL;DR) We can finally play HLS using only javascript. It works faster than Flash, unlocking the potential to stream live in 4k&hellip;
---
---
title: Implementing Sign in with Twitter for Node.js
url: https://www.codementor.io/nodejs/tutorial/how-to-implement-twitter-sign-expressjs-oauth
date_saved: 07/18/2016 10:52-39
excerpt: More and more recently, I&#x2019;ve been seeing small applications implementing sign in with Twitter, Google, GitHub, LinkedIn, etc. I think this is a great move for a number of reasons. First, so I&hellip;
---
---
title: Interactive JavaScript Charts Using Data from Google Sheets
url: http://www.sitepoint.com/interactive-javascript-charts-using-data-from-google-sheets/
date_saved: 07/18/2016 09:39-43
excerpt: This article was peer reviewed by Jeff Smith. Thanks to all of SitePoint&#x2019;s peer reviewers for making SitePoint content the best it can be! Meet my friend Jenny. She recently started coding&hellip;
---
---
title: Introduction to Functional Reactive Programming with RxJS
url: http://www.sitepoint.com/functional-reactive-programming-rxjs/
date_saved: 07/18/2016 09:46-53
excerpt: This article was peer reviewed by Moritz Kr&#xF6;ger, Bruno Mota and Vildan Softic. Thanks to all of SitePoint&#x2019;s peer reviewers for making SitePoint content the best it can be! Before we dive&hellip;
---
---
title: Introduction to jCanvas: jQuery Meets HTML5 Canvas
url: http://www.sitepoint.com/introduction-to-jcanvas-jquery-meets-html5-canvas/
date_saved: 07/18/2016 10:36-34
excerpt: HTML5 lets you draw graphics straight into your web page using the &lt;canvas&gt; element and its related JavaScript API. In this post, I&#x2019;m going to introduce you to jCanvas, a free and open&hellip;
---
---
title: Introduction to Object-Oriented JavaScript
url: https://developer.mozilla.org/en-US/docs/Web/JavaScript/Introduction_to_Object-Oriented_JavaScript
date_saved: 07/18/2016 09:52-13
excerpt: Object-oriented to the core, JavaScript features&#xA0;powerful, flexible OOP capabilities. This article starts with an introduction to object-oriented programming, then reviews the JavaScript object&hellip;
---
---
title: Intro to the React Framework - Tuts+ Code Tutorial
url: http://code.tutsplus.com/tutorials/intro-to-the-react-framework--net-35660
date_saved: 07/18/2016 10:58-14
excerpt: In today's world of Javascript Application frameworks, design philosophy is the key differentiating factor. If you compare the popular JS frameworks, such as EmberJS, AngularJS, Backbone, Knockout,&hellip;
---
---
title: JavaScript Animation
url: https://davidwalsh.name/intro-javascript-animation
date_saved: 07/18/2016 09:58-38
excerpt: Despite what many developers believe, CSS-based animation is not the only performant way to animate on the web. There's also JavaScript&#x2014;and JS has some incredible advantages. By abandoning&hellip;
---
---
title: Javascript anonymous functions
url: http://helephant.com/2008/08/23/javascript-anonymous-functions/
date_saved: 07/18/2016 09:50-27
excerpt: Anonymous functions are functions that are dynamically declared at runtime. They&#x2019;re called anonymous functions because they aren&#x2019;t given a name in the same way as normal functions.&hellip;
---
---
title: JavaScript Design Patterns: Bridge
url: http://www.joezimjs.com/javascript/javascript-design-patterns-bridge/
date_saved: 07/18/2016 09:54-40
excerpt: In my last blog post article I discussed the Singleton Design Pattern and how it is used in JavaScript. This time around the Bridge design pattern is poking its head up and asking for a bit of&hellip;
---
---
title: JavaScript Design Patterns: Chain of Responsibility
url: http://www.joezimjs.com/javascript/javascript-design-patterns-chain-of-responsibility/
date_saved: 07/18/2016 09:55-12
excerpt: We&#x2019;ve made it to the final installment in the JavaScript Design Patterns series. That&#x2019;s right, after this you&#x2019;ll no longer have any clue what post will be coming out every&hellip;
---
---
title: JavaScript Design Patterns: Composite
url: http://www.joezimjs.com/javascript/javascript-design-patterns-composite/
date_saved: 07/18/2016 09:55-32
excerpt: My last post was about the Bridge Design Pattern, which continued the JavaScript Design Patterns series that started off with the Singleton. Today we&#x2019;ve moved onto the Composite Pattern.&hellip;
---
---
title: JavaScript Design Patterns: Proxy
url: http://www.joezimjs.com/javascript/javascript-design-patterns-proxy/
date_saved: 07/18/2016 09:55-18
excerpt: This is the 9th installment of the JavaScript Design Patterns series and today we&#x2019;re featuring the Proxy pattern. The word &#x201C;proxy&#x201D; can be defined as a substitute, and that&hellip;
---
---
title: JavaScript In 2016 - Beyond the Browser -
url: http://developer.telerik.com/featured/what-to-expect-from-javascript-in-2016-beyond-the-browser/
date_saved: 07/18/2016 10:31-59
excerpt: This is the third part of a 3 part series on what to expect from JavaScript in 2016 taken from our whitepaper, &#x201C;The Future of JavaScript: 2016 and Beyond&#x201C;. Today&#x2019;s post focuses&hellip;
---
---
title: JavaScript language a- z cheat sheet
url: http://dublintech.blogspot.com.es/2012/04/javascript-language-z-cheat-sheet.html
date_saved: 07/18/2016 10:38-26
excerpt: Here is an A - Z list of some Javascript idioms and patterns. The idea is to convey in simple terms some features of the actual Javascript language (rather than how it can interact with DOM).&hellip;
---
---
title: JavaScript Modules
url: https://medium.freecodecamp.com/javascript-modules-a-beginner-s-guide-783f7d7a5fcc?gi=f56f6ac066e
date_saved: 07/18/2016 10:40-22
excerpt: If you&#x2019;re a newcomer to JavaScript, jargon like &#x201C;module bundlers vs. module loaders,&#x201D; &#x201C;Webpack vs. Browserify&#x201D; and &#x201C;AMD vs. CommonJS&#x201D; can quickly&hellip;
---
---
title: JavaScript Scoping and Hoisting
url: http://www.adequatelygood.com/JavaScript-Scoping-and-Hoisting.html
date_saved: 07/18/2016 09:51-04
excerpt: Do you know what value will be alerted if the following is executed as a JavaScript program? var foo = 1; function bar() { if (!foo) { var foo = 10; } alert(foo); } bar(); If it surprises you that&hellip;
---
---
title: jQuery Select Box Components - Chosen vs Select2
url: http://www.sitepoint.com/jquery-select-box-components-chosen-vs-select2/
date_saved: 07/18/2016 10:32-18
excerpt: This article was peer reviewed by Mart&#xED;n Mart&#xED;nez and Chris Perry. Thanks to all of SitePoint&#x2019;s peer reviewers for making SitePoint content the best it can be! Have you ever worked&hellip;
---
---
title: jQuery webcam plugin
url: http://www.xarg.org/project/jquery-webcam-plugin/
date_saved: 07/18/2016 11:10-50
excerpt: The jQuery webcam plugin is a transparent layer to communicate with a camera directly in JavaScript. Overview This plugin provides three different modes to access a webcam through a small API&hellip;
---
---
title: Learning React: #1 Setting up the environment
url: http://nadeemkhedr.com/learning-react-setting-up-the-environment/
date_saved: 07/18/2016 10:27-28
excerpt: In this series I wanna discuss my learning experience with ReactJS, this will be an opinionated series on what I think of ReactJS &amp; other libraries, Why I switched to it, and why I think ReactJS&hellip;
---
---
title: Learning React.js: Getting Started and Concepts
url: https://scotch.io/tutorials/learning-react-getting-started-and-concepts
date_saved: 07/18/2016 10:58-09
excerpt: Introduction Today we are going to kick off the first installment in a new series of tutorials, Learning React, that will focus on becoming proficient and effective with Facebook&#x2019;s React&hellip;
---
---
title: Learn Python, Meteor, AngularJS and more by cloning real startups
url: http://www.codeupstart.com/project/build-kickstarter-with-python-and-flask
date_saved: 07/18/2016 11:27-36
excerpt: 
---
---
title: Let's Build a Redux Powered React Application - Stormpath User Identity API
url: https://stormpath.com/blog/build-a-redux-powered-react-application/
date_saved: 07/18/2016 09:36-51
excerpt: In this blogpost, we&#x2019;ll dig into Redux and learn why it&#x2019;s valuable when building a React application. I&#x2019;ll also walk you through building your first Redux application, including&hellip;
---
---
title: Make a Mobile App with ReactJS in 30 Minutes
url: https://scotch.io/tutorials/make-a-mobile-app-with-reactjs-in-30-minutes
date_saved: 07/18/2016 10:59-08
excerpt: Now we have an interface with no logic. Before we can link together the Button to the display of photos, we need to grab the photos from Flickr using React conventions. First, get yourself a Flickr&hellip;
---
---
title: Meteor Meets GraphQL — KADIRA VOICE
url: https://voice.kadira.io/meteor-meets-graphql-3cba2e65fd00#.pzdd33ozl
date_saved: 07/18/2016 11:15-14
excerpt: We have been using GraphQL at Kadira for about four months. Everyone at Kadira loves it. We introduced Learn GraphQL online course in October, which allows you to master the basics of GraphQL in&hellip;
---
---
title: Meteor-React-Ionic Mobile App Part 1: The Basic Template
url: https://medium.com/@SamCorcos/meteor-react-ionic-mobile-app-part-1-the-basic-template-9355ebf3397f#.szcjpw1xx
date_saved: 07/18/2016 11:10-02
excerpt: Meteor now has reasonable support for React.js, so it’s about time to start using it for hybrid mobile apps, which is one of the huge advantages of using Meteor. This template app (repo) will use&hellip;
---
---
title: Minimal Docker Containers for Node.js
url: https://blog.risingstack.com/minimal-docker-containers-for-node-js/
date_saved: 07/18/2016 10:04-21
excerpt: As some of the most innovative companies like Oculus and Gilt Groupe jump into Docker containers, more and more base images appear on Docker Hub that can be used to containerize your applications.&hellip;
---
---
title: Modular JavaScript: A Beginners Guide to SystemJS & jspm
url: https://www.sitepoint.com/modular-javascript-systemjs-jspm/
date_saved: 07/18/2016 09:35-02
excerpt: This article was peer reviewed by Adrian Sandu and Mark Brown. Thanks to all of SitePoint&#x2019;s peer reviewers for making SitePoint content the best it can be! Over the past few years, the&hellip;
---
---
title: "Node Hero - Debugging Node.js applications"
url: "https://blog.risingstack.com/node-hero-node-js-debugging-tutorial/"
date_saved: "07/19/2016 07:58-41"
excerpt: "This article is the 10th part of the tutorial series called Node Hero - in these chapters, you can learn how to get started with Node.js and deliver software products using it. In this tutorial, you&hellip;"
thumbnail: [![](png/node_hero__debugging_nodejs_applications.png)](png/full/node_hero__debugging_nodejs_applications.png)
---
title: Node.js Websocket Examples with Socket.io
url: http://stackabuse.com/node-js-websocket-examples-with-socket-io/
date_saved: 07/18/2016 10:34-30
excerpt: What are Websockets? Over the past few years, a new type of communication started to emerge on the web and in mobile apps, called websockets. This protocol has been long-awaited and was finally&hellip;
---
---
title: Pointy Slider in CSS and jQuery
url: https://codyhouse.co/gem/pointy-slider/
date_saved: 07/18/2016 10:51-13
excerpt: A slideshow with sliding-in panels that unveil new, fixed background images. Browser support ie Chrome Firefox Safari Opera 9+ Today&#x2019;s resource is a simple, responsive slider, with a sharp&hellip;
---
---
title: Quick Tip: How to Use VueJS to Preview Images Before Uploading
url: http://taha-sh.com/blog/quick-tip-how-to-use-vuejs-to-preview-images-before-uploading
date_saved: 07/18/2016 10:40-53
excerpt: Let's say, for example, you're building an app where your users can upload images to their profiles. It's likely you want to preview those images before they are uploaded &#x2014; it's usually a good&hellip;
---
---
title: Reactive MVC and the Virtual DOM — Futurice
url: http://futurice.com/blog/reactive-mvc-and-the-virtual-dom
date_saved: 07/18/2016 11:06-49
excerpt: The web frontend scene is witness to many new frameworks and ways of working. It can be quite annoying when software becomes legacy quicker than ever. But actually, it's just good old innovation&hellip;
---
---
title: "React UI Libraries"
url: "http://blog.webkid.io/react-ui-libraries/"
date_saved: "07/19/2016 07:58-31"
excerpt: "This article introduces 5 React UI libraries. You will see how to setup and integrate them for your purposes. We will share our impressions and show an example for each library. We found rich UX&hellip;"
thumbnail: [![](png/react_ui_libraries.png)](png/full/react_ui_libraries.png)
---
title: Reading Progress Indicator in SVG, CSS & jQuery
url: https://codyhouse.co/gem/reading-progress-indicator/
date_saved: 07/18/2016 10:51-50
excerpt: A widget containing a list of suggested articles, with a reading progress indicator powered by SVG, CSS and jQuery. Browser support ie Chrome Firefox Safari Opera 9+ Today&#x2019;s resource was&hellip;
---
---
title: "Real" Mixins with JavaScript Classes
url: http://justinfagnani.com/2015/12/21/real-mixins-with-javascript-classes/
date_saved: 07/18/2016 11:26-41
excerpt: Mixins and Javascript: The Good, the Bad, and the Ugly. Mixins and JavaScript are a like the classic Clint Eastwood movie. The good is that composing objects out of small pieces of implementation is&hellip;
---
---
title: Real-Time Search in JavaScript
url: http://osvaldas.info/real-time-search-in-javascript
date_saved: 07/18/2016 11:26-07
excerpt: 11 Aug What I meant was scanning the DOM of a page for text equivalents and showing the actual parts of the page, as well as hiding the irrelevant ones. I came up with the technique when I was&hellip;
---
---
title: "Real-world RPC with RabbitMQ and Node.JS"
url: "https://facundoolano.wordpress.com/2016/06/26/real-world-rpc-with-rabbitmq-and-node-js/"
date_saved: "07/19/2016 07:58-36"
excerpt: "tl;dr: use the direct reply-to feature to implement RPC in RabbitMQ. I&#x2019;m currently working on a platform that relies heavily on RPC over RabbitMQ to move incoming requests through a&hellip;"
thumbnail: [![](png/realworld_rpc_with_rabbitmq_and nodejs.png)](png/full/realworld_rpc_with_rabbitmq_and nodejs.png)
---
title: Route360° : Open Source JavaScript-API for Location Analysis based on travel times
url: http://monde-geospatial.com/5808-2/
date_saved: 07/18/2016 09:40-37
excerpt: Route360&#xB0; : Open Source JavaScript-API for Location Analysis based on travel times 4.83/5 ( 6 votes ) Make it simple, please! It is time for a new generation of location planning tools Web&hellip;
---
---
title: Storing Base64 Files Directly in Couchbase via Node.js
url: http://blog.couchbase.com/2016/february/storing-base64-files-directly-in-couchbase-via-nodejs
date_saved: 07/18/2016 09:47-11
excerpt: So you're developing an application and you want to store your files in Couchbase. As of right now, Couchbase allows for documents up to 20MB in size which is larger than you think. Why would we&hellip;
---
---
title: The future of bundling JavaScript modules
url: http://www.2ality.com/2015/12/bundling-modules-future.html
date_saved: 07/18/2016 11:27-19
excerpt: This blog post examines how the bundling of modules is affected by two future developments: HTTP/2 and native modules. Bundling modules means combining several files with modules into a single file.&hellip;
---
---
title: The React Quick Start Guide
url: https://www.codementor.io/reactjs/tutorial/the-reactjs-quick-start-guide
date_saved: 07/18/2016 10:54-53
excerpt: This article will give you a quick overview of how to build user interfaces in React JS. There&#x2019;s just enough to get yourself started and nothing more. Code along with this starter kit&hellip;
---
---
title: The Ridiculously Easy Way to Animate Your Applications With VueJS
url: http://taha-sh.com/blog/the-ridiculously-easy-way-to-animate-your-applications-with-vuejs
date_saved: 07/18/2016 10:40-58
excerpt: Vue makes it incredibly easy to add transitions to your application. The transitions I'm talking about here are those that run when elements are inserted into or removed from the DOM. An example of&hellip;
---
---
title: The Two Pillars of JavaScript — JavaScript Scene
url: https://medium.com/javascript-scene/the-two-pillars-of-javascript-ee6f3281e7f3#.3hi6gq6d8
date_saved: 07/18/2016 11:07-04
excerpt: Before we get into this, allow me to introduce myself&#x200A;&#x2014;&#x200A;you&#x2019;re probably going to wonder who I think I am before this is over.I&#x2019;m Eric Elliott, author of&hellip;
---
---
title: The Two Pillars of JavaScript — Pt 2: Functional Programming — JavaScript Scene
url: https://medium.com/javascript-scene/the-two-pillars-of-javascript-pt-2-functional-programming-a63aa53a41a4#.kc2im991x
date_saved: 07/18/2016 11:06-59
excerpt: Two Pillars of JavaScript Part 1: &#x201C;How to Escape the 7th Circle of Hell&#x201D;. From the introduction:JavaScript is one of the most important programming languages of all time, not simply&hellip;
---
---
title: The What, How and Why Of Single Var Pattern in JavaScript?
url: http://www.smashingbuzz.com/2015/09/single-var-pattern-javascript/
date_saved: 07/18/2016 11:13-22
excerpt: Are you tired of dealing with language rules and conventions? Well, then you can switch to using JavaScript, as it gives flexibility over applying rules and code conventions. For instance, JavaScript&hellip;
---
---
title: Turn-key Electron apps with Meteor
url: https://mixmax.com/blog/turnkey-electron-apps-with-meteor
date_saved: 07/18/2016 10:40-00
excerpt: Monday, Jan 11th, 2016 Mixmax is a communications platform that brings email into the 21st century. We believe everything you do today on the web should be possible in any email. Last month, we&hellip;
---
---
title: Tutorial | React
url: https://facebook.github.io/react/docs/tutorial.html
date_saved: 07/18/2016 09:54-35
excerpt: Edit on GitHub We'll be building a simple but realistic comments box that you can drop into a blog, a basic version of the realtime comments offered by Disqus, LiveFyre or Facebook comments. We'll&hellip;
---
---
title: Understanding JavaScript OOP - Quils in Space
url: http://robotlolita.me/2011/10/09/understanding-javascript-oop.html
date_saved: 07/18/2016 09:49-37
excerpt: Now that we're able to inherit properties from other objects and extend the specialised objects to define their own behaviours, we have a little problem: what if we actually wanted to access the&hellip;
---
---
title: Understanding JavaScript’s Function.prototype.bind – Smashing Magazine
url: https://www.smashingmagazine.com/2014/01/understanding-javascript-function-prototype-bind/
date_saved: 07/18/2016 09:50-58
excerpt: Function binding is most probably your least concern when beginning with JavaScript, but when you realize that you need a solution to the problem of how to keep the context of this within another&hellip;
---
---
title: Understanding Loose Typing in JavaScript
url: http://blog.jeremymartin.name/2008/03/understanding-loose-typing-in.html
date_saved: 07/18/2016 09:51-08
excerpt: For many front end developers, JavaScript was their first taste of a scripting and/or interpretive language. To these developers, the concept and implications of loosely typed variables may be second&hellip;
---
---
title: Understanding Transducers in JavaScript
url: https://medium.com/@roman01la/understanding-transducers-in-javascript-3500d3bd9624#.h5x60x62x
date_saved: 07/18/2016 10:42-18
excerpt: I’ve found a very good article explaining Transducers. If you are familiar with Clojure, go and read it: “Understanding Transducers”. But if you are JavaScript developer and not used to read lisp&hellip;
---
---
title: Unit Testing and TDD in Node.js – Part 1
url: https://www.codementor.io/nodejs/tutorial/unit-testing-nodejs-tdd-mocha-sinon
date_saved: 07/18/2016 10:53-16
excerpt: Testing is an important practice in software development to improve software quality. There are many forms of testing; manual testing, acceptance testing, unit testing, and a few others. In this post&hellip;
---
---
title: Unit Testing and TDD in Node.js – Part 2
url: https://www.codementor.io/nodejs/tutorial/unit-testing-tdd-node-js-nockjs-part-2
date_saved: 07/18/2016 10:53-08
excerpt: In the previous article, we looked at how to write unit tests using Mocha and Chai using a test driven development (TDD) approach. We also looked at how and when to use test doubles using the Sinon&hellip;
---
---
title: Uploading Videos to YouTube Using NodeJS
url: https://www.codementor.io/nodejs/tutorial/uploading-videos-to-youtube-with-nodejs-google-api
date_saved: 07/18/2016 10:52-59
excerpt: Using different service APIs may be difficult, especially for beginners, but not only. In this post, I will try to make clearer how to upload a video on YouTube, using NodeJS. Back in 2013 I&hellip;
---
---
title: Using Meteor Data and React with Meteor 1.3 — KADIRA VOICE
url: https://voice.kadira.io/using-meteor-data-and-react-with-meteor-1-3-13cb0935dedb?gi=9ab61467c15b
date_saved: 07/18/2016 10:31-03
excerpt: In a previous post, I talked about how to use React with Meteor 1.3. In that post, I showed how to get React from NPM and use FlowRouter to build a simple app.Getting Started with Meteor 1.3 and
---
---
title: Using React with canvas element
url: https://medium.com/@lavrton/using-react-with-html5-canvas-871d07d8d753#.4eqd9dxn5
date_saved: 07/18/2016 10:31-29
excerpt: We have React that helps us to work with massive mutable DOM in a nice immutable functional style. That is awesome.But I would like to describe a way of using React that helps you to work with&hellip;
---
---
title: Vertical Fixed Navigation 2 in CSS and jQuery
url: https://codyhouse.co/gem/vertical-fixed-navigation-2/
date_saved: 07/18/2016 10:51-57
excerpt: A smart vertical navigation, with round indicators that turn into labelled icons when the user interacts with them. Browser support ie Chrome Firefox Safari Opera 9+ Our first concept of vertical&hellip;
---
---
title: VueJs: Components
url: http://coligo.io/vuejs-components/
date_saved: 07/18/2016 09:39-03
excerpt: Practical Intro to Components in VueJs In this tutorial we'll be looking at VueJs components and understanding how they work and when to use them through a bunch of practical examples to give you a&hellip;
---
---
title: VueJs: Filters
url: http://coligo.io/vuejs-filters/
date_saved: 07/18/2016 09:38-57
excerpt: In this tutorial we take a look filters in VueJs and how we can use them through a number of examples. We explore some of the powerful built-in filters such as orderBy and filterBy and how we can&hellip;
---
---
title: Writing Next Generation Reusable JavaScript Modules in ECMAScript 6 – Smashing Magazine
url: https://www.smashingmagazine.com/2016/02/writing-next-generation-reusable-javascript-modules/
date_saved: 07/18/2016 10:32-05
excerpt: Are you excited to take advantage of new JavaScript language features but not sure where to start, or how? You&#x2019;re not alone! I&#x2019;ve spent the better part of the last year and a half&hellip;
---
