---
title: 25 Useful IPtable Firewall Rules Every Linux Administrator Should Know
url: http://www.tecmint.com/linux-iptables-firewall-rules-examples-commands/
date_saved: 07/18/2016 09:38-37
excerpt: Managing network traffic is one of the toughest jobs a system administrators has to deal with. He must configure the firewall in such a way that it will meet the system and users requirements for&hellip;
---
---
title: Arduino Meets Linux: Arduino Introduces Its 3rd Generation Platform
url: http://electronics360.globalspec.com/article/5995/arduino-meets-linux-arduino-introduces-its-3rd-generation-platform
date_saved: 07/18/2016 11:18-07
excerpt: The Arduino platform's simplicity, open architecture and ease of use helped make it the most popular embedded development tool within the Maker community. In this article, we will look at the new&hellip;
---
---
title: a weekly newsletter for Linux and Open Source sysadmins
url: http://www.cronweekly.com/issue-13/
date_saved: 07/18/2016 10:29-22
excerpt: issue #13: Tails, Ruby, OpenSSL, Rundeck, Bash Concurrency, Namespaces &amp; many more! Published: 2016-01-31 Did you arrive at this page directly? You can subscribe to the weekly mailing list and&hellip;
---
---
title: Beej's Guide to Unix IPC
url: http://beej.us/guide/bgipc/output/html/singlepage/bgipc.html
date_saved: 07/18/2016 10:30-01
excerpt: Brian "Beej Jorgensen" Hall beej@beej.us Version 1.1.2 December 15, 2010 Copyright &#xA9; 2010 Brian "Beej Jorgensen" Hall Contents 1. Intro 1.1. Audience 1.2. Platform and Compiler 1.3. Official&hellip;
---
---
title: Cisco UCS Integrated Infrastructure with Red Hat Enterprise Linux OpenStack Platform and Red Hat Ceph Storage Deployment Guide
url: http://www.cisco.com/c/en/us/td/docs/unified_computing/ucs/UCS_CVDs/ucs_openstack_osp7.html
date_saved: 07/18/2016 09:39-52
excerpt: Cisco Validated Design program consist of systems and solutions that are designed, tested, and documented to facilitate and improve customer deployments. These designs incorporate a wide range of&hellip;
---
---
title: How to Convert Videos in Linux Using the Command Line
url: http://www.linux.com/learn/tutorials/857788-how-to-convert-videos-in-linux-using-the-command-line
date_saved: 07/18/2016 11:11-42
excerpt: Linux users don't need to transcode video files, because they have VLC and many other apps at their disposal that can play almost any media format out there. However, if you want to play videos on&hellip;
---
---
title: How to Install Graylog2 and Elasticsearch on Ubuntu 15.10
url: https://www.howtoforge.com/tutorial/how-to-Install-graylog2-and-elasticsearch-on-ubuntu-15-10/
date_saved: 07/18/2016 10:42-11
excerpt: Elasticsearch is a distributed search server based on Lucene that is available as OpenSource software. It is a full-text search engine,&#xA0;written in Java, with an HTTP web interface and it&hellip;
---
---
title: How to Install PSAD on Ubuntu 15.04 LTS
url: http://linoxide.com/ubuntu-how-to/install-psad-ubuntu-15-04-lts/
date_saved: 07/18/2016 10:04-34
excerpt: As name indicate, Port Scan Attack Detection (PSAD) tool is used to block port scanning on the server. Nmap, a well-known tool is mostly used for launching port scan to detect open/close ports. PSAD&hellip;
---
---
title: How to split large audio files on Linux
url: https://www.howtoforge.com/tutorial/how-to-split-large-audio-files-on-linux/
date_saved: 07/18/2016 11:11-35
excerpt: It is often the case that we want to split an &#x201C;one-piece&#x201D; audio recording into smaller files. A live concert could be broken down into songs so that you can burn it on a CD, or an&hellip;
---
---
title: Huge Number Of Critical Flaws Revealed In Apple, Android, Linux And Oracle Systems
url: http://www.forbes.com/sites/thomasbrewster/2016/01/20/huge-number-of-critical-flaws-revealed-in-apple-android-linux-and-oracle-systems/#5e0f9b24614f
date_saved: 07/18/2016 10:28-09
excerpt: false
---
---
title: Installing Ubuntu MATE on a MacBook Pro with UEFI
url: http://freedompenguin.com/articles/how-to/installing-ubuntu-mate-macbook-pro-uefi/
date_saved: 07/18/2016 10:04-41
excerpt: Back in October, I explained how you can install Ubuntu on a Mac. It was a complete guide that included everything from dual-booting with OS X down to making sure the you&#x2019;re able to use the&hellip;
---
---
title: Linux creator explains why a truly secure computing platform will never exist
url: http://bgr.com/2015/09/25/linus-torvalds-quotes-interview-linux-security/
date_saved: 07/18/2016 10:17-47
excerpt: Twenty-four years ago this month, a Finnish developer with a sharp tongue who&#x2019;s regarded by some as one of the most influential programmers alive today released version 0.01 of the Linux&hellip;
---
---
title: Linux driver support for ARM processors
url: http://displaylink.org/forum/showthread.php?s=f89c795ea50325b5343a25ad108cf006&t=64272
date_saved: 07/18/2016 10:01-10
excerpt: Junior Member &#xA0; Join Date: Dec 2015 Posts: 3 Linux driver support for ARM processors My company sells a product that uses DisplayLink monitors and BeagleBones together. Unfortunately, the&hellip;
---
---
title: Linux Vulnerability Rattles Open Source Community
url: http://www.enterprisetech.com/2016/02/19/linux-vulnerability-rattles-open-source-community/
date_saved: 07/18/2016 09:48-27
excerpt: A serious Linux vulnerability reverberated through the open source community this week, prompting major vendors like Cisco Systems to issue security alerts while experts attempted to determine the&hellip;
---
---
title: Multimedia on Linux Command Line: wget, PdfTK, ffmpeg, flac, SoX
url: https://sandilands.info/sgordon/multimedia-on-linux-command-line
date_saved: 07/18/2016 11:19-01
excerpt: Some examples of using the command line in Linux to: Modify PDF files, e.g. combine two files into one, re-order pages. Software: PdfTk Convert video and audio files into different formats. Software:&hellip;
---
---
title: Operations Management Suite Log Analytics with Linux
url: http://blogs.technet.com/b/systemcenter/archive/2016/01/28/operations-management-suite-log-analytics-with-linux.aspx
date_saved: 07/18/2016 10:34-50
excerpt: Last week we kicked off our series guiding you through the rich feature set of Operations Management Suite (OMS), starting with Log Analytics. One of the goals for Operations Management Suite is&hellip;
---
---
title: "Parsing an RSS News Feed with a Bash Script"
url: "http://www.linuxjournal.com/content/parsing-rss-news-feed-bash-script"
date_saved: "07/19/2016 22:33-15"
excerpt: "I am involved in several free software projects, including one or two where I maintain the website. For one of those projects, we currently are updating the website. Ours is probably similar to other&hellip;"
thumbnail: [![](png/parsing_an_rss_news_feed_with_a_bash_script.png)](png/full/parsing_an_rss_news_feed_with_a_bash_script.png)
---
title: Settling into Unix
url: http://matt.might.net/articles/settling-into-unix/
date_saved: 07/18/2016 11:30-05
excerpt: Interactive shells Your interactive shell determines the command-line dialect you will use to interact with your machine. There are two dominant families of interactive shells:&hellip;
---
---
title: ST Releases Free Linux IDE for 32-Bit MCUs
url: https://www.linux.com/news/embedded-mobile/mobile-linux/884961-st-releases-free-linux-ide-for-32-bit-mcus/
date_saved: 07/18/2016 10:05-31
excerpt: The 32-bit microcontroller world is starting to open up to world Linux. This week, leading ARM Cortex-M vendor STMicroelectronics (ST)&#xA0;released&#xA0;a free Linux desktop version of its&hellip;
---
---
title: Survival guide for Unix newbies
url: http://matt.might.net/articles/basic-unix/
date_saved: 07/18/2016 11:30-10
excerpt: What is computing with Unix? Unix is a family of operating systems and environments that exploits the power of linguistic abstraction and composition to orchestrate tasks. Unix users spend a lot of&hellip;
---
---
title: TED 2016: Linux founder not a 'people person'
url: http://www.bbc.com/news/technology-35599774
date_saved: 07/18/2016 09:55-58
excerpt: Image copyright TED Image caption
---
---
title: Ubuntu9.04
url: https://libdlo.freedesktop.org/wiki/Ubuntu9.04/
date_saved: 07/18/2016 10:01-22
excerpt: Ubuntu 9.04 follows similar steps, but requires some additional modifications vs the Ubuntu8.10 instructions, because of some new issues and increased reliance on xrandr. xf86-driver-displaylink&hellip;
---
---
title: What's next for Linux
url: http://www.theworldin.com/article/12077/what-next-linux?fsrc=scn%2Ftw%2Fte%2Fbl%2Fed%2Ftheworldin2016
date_saved: 07/18/2016 11:31-30
excerpt: Ludwig SiegeleFri Nov 20 2015Business
---
