---
title: Acknowledgements · Game Programming Patterns
url: http://gameprogrammingpatterns.com/acknowledgements.html
date_saved: 07/18/2016 10:06-11
excerpt: &#x2190;&#xA0;Previous &#xA0; &#x2261;&#xA0;About&#xA0; &#xA0; &#xA7;&#xA0;Contents &#xA0; Next&#xA0;&#x2192; I&#x2019;ve heard only other authors know what&#x2019;s involved in writing a book, but&hellip;
---
---
title: An introduction to visual programming using NoFlo
url: http://rawkes.com/articles/an-introduction-to-noflo-and-flow-based-programming
date_saved: 07/18/2016 11:12-53
excerpt: I recently stumbled upon NoFlo during my quest for a better way to manage the realtime processing and transformation of data within ViziCities. I was dubious about this bizarre JavaScript framework&hellip;
---
---
title: Anyone Can Learn To Code an LSTM-RNN in Python (Part 1: RNN)
url: http://iamtrask.github.io/2015/11/15/anyone-can-code-lstm/
date_saved: 07/18/2016 11:14-08
excerpt: Summary: I learn best with toy code that I can play with. This tutorial teaches Recurrent Neural Networks via a very simple toy example, a short python implementation. I'll tweet out (Part 2: LSTM)&hellip;
---
---
title: Beej's Guide to C Programming
url: http://beej.us/guide/bgc/output/html/singlepage/bgc.html
date_saved: 07/18/2016 10:29-52
excerpt: Brian "Beej" Hall beej@beej.us Revision alpha-25 May 17, 2007 Copyright &#xA9; 2007 Brian "Beej" Hall Contents 1. Foreward 1.1. Audience 1.2. Platform and Compiler 1.3. Building under Unix 1.4.&hellip;
---
---
title: Beej's Guide to Network Programming
url: http://beej.us/guide/bgnet/output/html/singlepage/bgnet.html
date_saved: 07/18/2016 10:30-08
excerpt: Brian "Beej Jorgensen" Hall beej@beej.us Version 3.0.20 March 11, 2016 Copyright &#xA9; 2015 Brian "Beej Jorgensen" Hall Contents 1. Intro 1.1. Audience 1.2. Platform and Compiler 1.3. Official&hellip;
---
---
title: Biopython Tutorial and Cookbook
url: http://biopython.org/DIST/docs/tutorial/Tutorial.html
date_saved: 07/18/2016 10:56-41
excerpt: Jeff Chang, Brad Chapman, Iddo Friedberg, Thomas Hamelryck, Michiel de Hoon, Peter Cock, Tiago Antao, Eric Talevich, Bartek Wilczy&#x144;skiLast Update &#x2013; 16 December 2015 (Biopython 1.66+)&hellip;
---
---
title: Build End-to-End Cloud Apps using Swift with Kitura - Swift
url: https://developer.ibm.com/swift/2016/02/22/building-end-end-cloud-apps-using-swift-kitura/
date_saved: 07/18/2016 09:45-16
excerpt: Kitura is a lightweight web framework that allows you to easily build web services with complex routes. Much of its design was inspired by Express.js based on the success of its overall design in&hellip;
---
---
title: Concept learnt while solving a simple python problem "Hackerone- Finding the percentage solution"
url: http://www.ownlocal.xyz/2015/12/concept-learnt-while-solving-simple.html
date_saved: 07/18/2016 11:27-42
excerpt: I was brushing up my Python skill on Hackerone, they have extremely good Python exercises. I was stuck in a question which just needed to find percentage but I learned other concepts in process of&hellip;
---
---
title: Document Clustering with Python
url: http://brandonrose.org/clustering
date_saved: 07/18/2016 11:11-29
excerpt: In this guide, I will explain how to cluster a set of documents using Python. My motivating example is to identify the latent structures within the synopses of the top 100 films of all time (per an&hellip;
---
---
title: donnemartin/data-science-ipython-notebooks
url: https://github.com/donnemartin/data-science-ipython-notebooks
date_saved: 07/18/2016 11:28-48
excerpt: This repo is a collection of IPython Notebooks I reference while working with data. Although I developed and maintain many notebooks, other notebooks I reference were created by various authors, who&hellip;
---
---
title: Embedded Programming with the GNU Toolchain
url: http://www.bravegnu.org/gnu-eprog/
date_saved: 07/18/2016 11:28-53
excerpt: The GNU toolchain is increasingly being used for deeply embedded software development. This type of software development is also called standalone C programming and bare metal C programming.&hellip;
---
---
title: extranapkins's series in functional Python
url: http://mike.place/2016/extranapkins/
date_saved: 07/18/2016 10:25-13
excerpt: 2016-02-03 Inspired by Douglas Hofstadter&#x2019;s and Martin Gardner&#x2019;s deeply profound works on mathematical series and recursion, and Joel Grus&#x2019;s talk Stupid Itertools Tricks for Data&hellip;
---
---
title: How to Use Swift on Linux - Envato Tuts+ Code Tutorial
url: http://code.tutsplus.com/tutorials/how-to-use-swift-on-linux--cms-25934
date_saved: 07/18/2016 09:48-21
excerpt: 1.&#xA0;State of the UnionAs with any new and emerging technology or language, it is always important to stay on top of the latest news and updates. Swift as a language is no different. Apple has&hellip;
---
---
title: Implementing a programming language in D: Lexical Analysis
url: http://blog.felixangell.com/implementing-a-programming-language-in-d-part-1/
date_saved: 07/18/2016 11:28-13
excerpt: I've been writing a lot of D lately, and it's slowly becoming one of my favourite languages to write in. I'm not a master at D, but it's a lot easier to write than C++, and it's a lot less verbose&hellip;
---
---
title: Introducing Lektor — A Static File Content Management System For Python
url: http://lucumr.pocoo.org/2015/12/21/introducing-lektor/
date_saved: 07/18/2016 11:31-38
excerpt: written on Monday, December 21, 2015 The longer I'm programming and creating software, the more I notice that I build a lot of stuff that requires maintenance even though it should not. In particular&hellip;
---
---
title: Introduction to Swift Tutorial Using the IBM Swift Sandbox
url: https://developer.ibm.com/swift/2015/12/08/introduction-to-swift-tutorial-using-the-ibm-swift-sandbox/
date_saved: 07/18/2016 09:49-11
excerpt: About this Tutorial This tutorial offers developers with a basic understanding of another language some insights on how to get familiar with Swift. Swift is a powerful and expressive language,&hellip;
---
---
title: Managing massive amounts of tick data with Python, simply and efficiently
url: http://gregharris.info/managing-massive-amounts-of-tick-data-with-python-simply-and-efficiently/
date_saved: 07/18/2016 11:20-01
excerpt: Tick data is hard to come by and hard to manage. This is my experience with it over the last month. I&#x2019;m interested in how stocks react to certain events, and tick data will let me study the&hellip;
---
---
title: Object Oriented Programming in Bash
url: http://hipersayanx.blogspot.sk/2012/12/object-oriented-programming-in-bash.html
date_saved: 07/18/2016 09:50-07
excerpt: Bash is a very common *nix shell, and it's programming language is purely procedural and focused on command execution. Object Oriented Programming (OOP) is a programming paradigm that represents the&hellip;
---
---
title: Profiling Python in Production
url: https://nylas.com/blog/performance
date_saved: 07/18/2016 11:28-56
excerpt: How We Reduced CPU Usage by 80% through Python Profiling By: Eben Freeman We recently reduced CPU usage across our fleet by 80%. One key technique that made this possible was a lightweight profiling&hellip;
---
---
title: [Python] A simple algorithm for drawing complex tables
url: https://snai.pe/python/algorithm/rendering-tables/
date_saved: 07/18/2016 11:09-12
excerpt: I was surprised to see, during the development of rst2ansi, that there were no simple python modules to pretty-print complex tables with ascii characters. Most of them only supported simple tables&hellip;
---
---
title: Pyxley: Python Powered Dashboards
url: http://multithreaded.stitchfix.com/blog/2015/07/16/pyxley/
date_saved: 07/18/2016 10:39-21
excerpt: Web-based dashboards are the most straightforward way to share insights with clients and business partners. For R users, Shiny provides a framework that allows data scientists to create interactive&hellip;
---
---
title: Swift Beginner's Guide to View Animations
url: https://www.codementor.io/swift/tutorial/view-animations-ios-tutorial
date_saved: 07/18/2016 10:53-42
excerpt: &#xD7; {{alert.msg}} Never ask again Introduction In this Tutorial, you are going to learn how to use view animation and how to convert a simple view into an awesome view. Ho
---
---
title: Swift.org
url: https://swift.org/getting-started/#using-the-lldb-debugger
date_saved: 07/18/2016 09:49-07
excerpt: Here, you&#x2019;ll find information about the how to use the Swift programming language. If you&#x2019;re new to Swift, check out A Swift Tour in The Swift Programming Language, for a quick&hellip;
---
---
title: The power of the command-line as a programming environment
url: http://pindexis.github.io/command-line/2015/12/23/power-of-commmand-line.html
date_saved: 07/18/2016 11:27-59
excerpt: While the programming world is full of sophisticated IDEs and text editors that are easy to use. Lot of people including myself still prefer the command-line as their main programming environment.&hellip;
---
---
title: The Swift Programming Language (Swift 2.2): Basic Operators
url: https://developer.apple.com/library/prerelease/ios/documentation/Swift/Conceptual/Swift_Programming_Language/BasicOperators.html#//apple_ref/doc/uid/TP40014097-CH6-ID60
date_saved: 07/18/2016 09:48-33
excerpt: An operator is a special symbol or phrase that you use to check, change, or combine values. For example, the addition operator (+) adds two numbers, as in let i = 1 + 2, and the logical AND operator&hellip;
---
---
title: The Swift Programming Language: The Basics
url: https://developer.apple.com/library/prerelease/ios/documentation/Swift/Conceptual/Swift_Programming_Language/TheBasics.html#//apple_ref/doc/uid/TP40014097-CH5-ID309
date_saved: 07/18/2016 09:48-50
excerpt: Swift is a new programming language for iOS and OS X app development. Nonetheless, many parts of Swift will be familiar from your experience of developing in C and Objective-C. Swift provides its own&hellip;
---
