---
title: 10 Essential Sublime Text Plugins for Full-Stack Developers
url: http://www.sitepoint.com/10-essential-sublime-text-plugins-full-stack-developer/
date_saved: 07/18/2016 11:09-57
excerpt: When I started with web development a few years ago, Vim was my first choice of text editor. It was easy to work with and I could get the basics done without much hassle. Also, many developers like&hellip;
---
---
title: 12 Greatest Programmers of all Time
url: http://www.arkhitech.com/12-greatest-programmers-of-all-time/
date_saved: 07/18/2016 09:41-16
excerpt: A programmer is a person who can create and modify computer programs. No matter what type of programmer one may be, each and every contributes something to the society, no matter how trivial. Yet,&hellip;
---
---
title: 3 Things We Learned Building a Chatbot for Slack
url: https://medium.com/@kipsearch/3-things-we-learned-building-a-chatbot-for-slack-2dc32321d77c#.v5mabd9ri
date_saved: 07/18/2016 10:38-33
excerpt: Kip is a chatbot that helps you save time by doing all the shopping for you and your team. Integrating with Slack was a logical choice, we’re Slack users and wanted a simple, efficient way of team&hellip;
---
---
title: 6 Easy to Follow Typography Practices that Boost Conversion Rates
url: http://www.designzzz.com/typography-boost-conversion-rates/
date_saved: 07/18/2016 09:46-42
excerpt: There was a time when designing was synonymous with artistry, it&#x2019;s not anymore. Design is a science and a designer is supposed to make conversions, conversions such as potential customer to&hellip;
---
---
title: A Beginner's Guide to the Synth
url: http://20khz.gizmodo.com/a-beginners-guide-to-the-synth-1736978695
date_saved: 07/18/2016 11:11-25
excerpt: You know the sound. Listen to Devo&#x2019;s &#x201C;Whip It&#x201D; or Parliament&#x2019;s &#x201C;Flash Light.&#x201D; Like countless modern pop songs, they&#x2019;re full of sounds that&hellip;
---
---
title: Academic Drivel Report
url: http://prospect.org/article/academic-drivel-report
date_saved: 07/18/2016 09:44-40
excerpt: I&#xA0;don&#x2019;t know if there is a statute of limitations on confessing one&#x2019;s sins, but it has been six years since I did the deed and I&#x2019;m now coming clean. Six years ago I&hellip;
---
---
title: A Complete Guide to Flexbox
url: https://css-tricks.com/snippets/css/a-guide-to-flexbox/
date_saved: 07/18/2016 10:51-43
excerpt: Background The Flexbox Layout (Flexible Box) module (currently a W3C Last Call Working Draft) aims at providing a more efficient way to lay out, align and distribute space among items in a container,&hellip;
---
---
title: ADHD Is Fuel for Adventure
url: http://www.outsideonline.com/2048391/adhd-fuel-adventure
date_saved: 07/18/2016 10:34-56
excerpt: By second grade, it was clear that while Zack Smith could sit in a chair, he had no intention of staying in it. He was disruptive in class, spoke in a loud voice, and had a hard time taking turns&hellip;
---
---
title: Advance Port Scanning with Nmap And Custom Idle Scan - InfoSec Institute
url: http://resources.infosecinstitute.com/nmap-cheat-sheet-discovery-exploits-part-2-advance-port-scanning-nmap-custom-idle-scan/
date_saved: 07/18/2016 09:35-45
excerpt: This is our second installment of Nmap cheat sheet. Basically, we will discuss some advanced techniques for Nmap scanning and we will conduct a Man In The Middle Attack (MITM). Let&#x2019;s start our&hellip;
---
---
title: A few spy tools for your operating system (other than strace!)
url: http://jvns.ca/blog/2015/04/06/a-few-spy-tools-for-your-operating-system-other-than-strace/
date_saved: 07/18/2016 10:10-33
excerpt: There are so many awesome tools you can use to find out what&#x2019;s going on with your computer. Here are some that exist on Linux. They might exist on your OS too! netstat netstat tells you what&hellip;
---
---
title: Against Neutrality
url: http://www.nytimes.com/2016/01/17/magazine/against-neutrality.html?_r=0
date_saved: 07/18/2016 10:42-33
excerpt: The photograph and the words arrive simultaneously. They guarantee each other. You believe the words more because the photograph verifies them, and trust the photograph because you trust the words.&hellip;
---
---
title: A Garden Variety of Bloom Filters
url: http://matthias.vallentin.net/blog/2011/06/a-garden-variety-of-bloom-filters/
date_saved: 07/18/2016 09:46-31
excerpt: In this article, I explain how Bloom filters work and introduce several variants that evolved as a result of extensive academic treatment of this topic. Moreover, I present libbf, an implementation&hellip;
---
---
title: Age: It’s All in Your Blood
url: http://sage.buckinstitute.org/age-its-all-in-your-blood/
date_saved: 07/18/2016 10:19-44
excerpt: We have all heard those particularly haunting tales about witches remaining ever youthful by imbibing a young woman&#x2019;s blood, but until a few years ago these tales were only told to frighten&hellip;
---
---
title: A Gentle Introduction to Secure Computation
url: http://www.alexirpan.com/2016/02/11/secure-computation.html
date_saved: 07/18/2016 09:59-30
excerpt: In Fall 2015, I took CS 276, a graduate level introduction to theoretical cryptography. For the final project, I gave a short presentation on secure computation. This blog post is adapted and&hellip;
---
---
title: Almost Profound
url: http://una.im/vintage-washout/#%F0%9F%92%81
date_saved: 07/18/2016 11:10-36
excerpt: Listen to this blog post: Your browser does not support the audio element. Last week, I gave a talk at CSS Conf EU called PS is Dead!: Editing Photos in CSS. My original idea was to outline 10 things&hellip;
---
---
title: American Panorama
url: http://dsl.richmond.edu/panorama/
date_saved: 07/18/2016 11:30-00
excerpt: American Panorama is created by the Digital Scholarship Lab at the University of Richmond. Robert K. Nelson and Edward L. Ayers serve as editors, Scott Nesbit as an associate editor. Justin Madron&hellip;
---
---
title: Amphetamines Are Hiding In Your Supplements
url: http://www.thedailybeast.com/articles/2015/04/08/amphetamines-hiding-in-your-supplements.html
date_saved: 07/18/2016 10:10-29
excerpt: iStockphotofacebook
---
---
title: A mucky business
url: http://www.economist.com/news/briefing/21667918-systematic-fraud-worlds-biggest-carmaker-threatens-engulf-entire-industry-and
date_saved: 07/18/2016 10:17-55
excerpt: HERBIE, a Volkswagen Beetle with a mind of its own in a series of Disney films launched in the 1960s, had its share of misadventures. But things had a way of ending up happily for both the car and&hellip;
---
---
title: Andrew Scala
url: http://andrewscala.com/meteor/
date_saved: 07/18/2016 10:58-39
excerpt: This tutorial is available in: Chinese thanks to @XguoX_L Korean thanks to @pismute Spanish thanks to Miquel serra caldentey French thanks to Etienne Balit Introduction Want to learn how this new,&hellip;
---
---
title: A New Generation of Airships Is Born
url: http://www.newyorker.com/magazine/2016/02/29/a-new-generation-of-airships-is-born
date_saved: 07/18/2016 09:47-52
excerpt: Much of the world has no access to paved roads. Vast cargo-bearing airships could reach places that planes and trucks can&#x2019;t. Credit Illustration by Harry Campbell
---
---
title: An innovative form of cheating emerges in MOOCs
url: http://techinamerica.com/an-innovative-form-of-cheating-emerges-in-moocs/
date_saved: 07/18/2016 10:17-36
excerpt: A new identity for cheating? Don Hankins Andrew Ho, Harvard University What if Massive Open Online Courses (MOOCs) aren&#x2019;t actually courses at all? Our research teams at Harvard and MIT have&hellip;
---
---
title: Anonymous Release NASA Documents Proving Something Unbelievable …
url: http://www.anonews.co/anon-release-leaked-nasa-information/
date_saved: 07/18/2016 10:15-41
excerpt: 12.6K Shares Share Tweet
---
---
title: A (relatively easy to understand) primer on elliptic curve cryptography
url: http://arstechnica.com/security/2013/10/a-relatively-easy-to-understand-primer-on-elliptic-curve-cryptography/
date_saved: 07/18/2016 09:45-41
excerpt: Author Nick Sullivan worked for six years at Apple on many of its most important cryptography efforts before recently joining CloudFlare, where he is a systems engineer. He has a degree in&hellip;
---
---
title: Assembly
url: https://freetserv.github.io/assembly.html
date_saved: 07/18/2016 11:15-23
excerpt: For safety reasons, you must not solder wires that transfer 230V, as the solder could get hot enough to unsolder itself. Hence, the power supply uses JST terminals, and on the power filter, we are&hellip;
---
---
title: A successful Git branching model
url: http://nvie.com/posts/a-successful-git-branching-model/
date_saved: 07/18/2016 09:59-40
excerpt: In this post I present the development model that I&#x2019;ve introduced for some of my projects (both at work and private) about a year ago, and which has turned out to be very successful.&hellip;
---
---
title: async/await: It’s Good and Bad
url: https://medium.com/@benlesh/async-await-it-s-good-and-bad-15cf121ade40#.qmrf59w0c
date_saved: 07/18/2016 09:46-27
excerpt: This might be controversial, as most people I know are huge fans of async/await. If you’re not familiar, it’s this nifty little syntax addition that allows developers to deal with APIs that return&hellip;
---
---
title: Asynchronous JS: Callbacks, Listeners, Control Flow Libs and Promises
url: http://sporto.github.io/blog/2012/12/09/callbacks-listeners-promises/
date_saved: 07/18/2016 09:38-52
excerpt: When it comes to dealing with asynchronous development in JavaScript there are many tool you can use. This post explains four of these tools and what their advantages are. These are Callbacks,&hellip;
---
---
title: AtariLeaks
url: http://www.atariarchives.org/atarileaks/
date_saved: 07/18/2016 11:27-55
excerpt: In 2009, I sent a Freedom of Information Act request to the FBI. I asked them for their 1970s and 1980s case files regarding Atari. They turned over a number of documents, and I quickly found what I&hellip;
---
---
title: Autocorrelation, Correlation and Causation
url: http://macroquantpdx.tumblr.com/post/116656634625/autocorrelation-correlation-and-causation
date_saved: 07/18/2016 10:12-06
excerpt: April 17, 2015In this post I will illustrate some concepts in financial time series analysis that are routinely ignored. I will be getting a bit technical, but if you bear with me, I promise that it&hellip;
---
---
title: Banned by the Publisher
url: http://www.nickcolebooks.com/2016/02/09/banned-by-the-publisher/
date_saved: 07/18/2016 10:15-15
excerpt: Or, Thank God for Jeff Bezos I launched a book this week and I went Indie with it. Indie means I released it on Amazon via Kindle Direct Publishing. I had to. My Publisher, HarperVoyager, refused to&hellip;
---
---
title: Basic Building Blocks
url: https://www.dashingd3js.com/basic-building-blocks
date_saved: 07/18/2016 10:14-43
excerpt: Modern Browsers The five modern web browsers are Internet Explorer, Firefox, Safari, Chrome and Opera. DashingD3js.com will focus on the web browsers that use WebKit. WebKit is a layout engine&hellip;
---
---
title: Beej's Quick Guide to GDB
url: http://beej.us/guide/bggdb/
date_saved: 07/18/2016 10:29-46
excerpt: Release 2 (2009 Jun 14) This is a very quick-and-dirty guide meant to get you started with the GNU Debugger, gdb, from the command line in a terminal. Often times gdb is run via an IDE, but many&hellip;
---
---
title: Beginner's Guide to Getting Started with Sails.js
url: https://www.codementor.io/nodejs/tutorial/how-to-setup-sailsjs-tutorial-beginners
date_saved: 07/18/2016 10:53-28
excerpt: Introduction Sails.js is node.js framework that allows you to build enterprise-ready, custom MVC ( model, view, controller ) application on-the-go. Sails.js has built-in features such as an API&hellip;
---
---
title: Biomedicine
url: https://www.technologyreview.com/s/542371/a-tale-of-do-it-yourself-gene-therapy/
date_saved: 07/18/2016 10:18-31
excerpt: Can aging be slowed by using gene therapy to make permanent changes to a person&#x2019;s DNA? One Seattle-area woman says she has tried exactly that. Her claim has entangled some high-profile&hellip;
---
---
title: Blog
url: http://gobot.io/blog/2015/10/27/gobot-0.10-less-is-more/
date_saved: 07/18/2016 11:11-16
excerpt: We've just released the new 0.10 version of Gobot, our open source robotics and Internet of Things (IoT) framework written in the Go programming language. This new version incorporates many changes&hellip;
---
---
title: Bookmarklet Scripts
url: http://botleg.com/stories/bookmarklet-scripts/
date_saved: 07/18/2016 11:29-18
excerpt: Bookmarklet allows you to run some script by clicking them after adding those to your browser as bookmarks. When your users click the bookmark, the script runs on the current page that the user is on&hellip;
---
---
title: BREAKING: The E-Cat has been replicated—here’s the recipe!
url: https://animpossibleinvention.com/2016/02/24/breaking-the-e-cat-has-been-replicated-hers-the-recipe/
date_saved: 07/18/2016 09:47-57
excerpt: Schematic view of MFMP&#x2019;s reactor, called &#x2018;glowstick&#x2019;. The &#x2018;open science&#x2019; group, Martin Fleischmann Memorial Project, MFMP, that I mention at the end of my book An&hellip;
---
---
title: Building a CMS: Structure and Styling
url: http://code.tutsplus.com/tutorials/building-a-cms-structure-and-styling--cms-24547
date_saved: 07/18/2016 09:37-43
excerpt: What You'll Be CreatingThere has been a trend of &#x201C;flat CMS design&#x201D; webservers. This simply refers to a Content Management System (CMS) that does not store its information in a database.&hellip;
---
---
title: Building Custom Appliances with SUSE Studio
url: http://www.linux.com/news/software/applications/881518-building-custom-appliances-with-suse-studio
date_saved: 07/18/2016 10:28-43
excerpt: Use SUSE Studio to build your own perfectly tailored SUSE Linux in multiple release formats. SUSE Studio is SUSE's excellent free custom-build service for creating your own customized openSUSE or&hellip;
---
---
title: Building ePub with PHP and Markdown
url: http://www.sitepoint.com/building-epub-with-php-and-markdown/
date_saved: 07/18/2016 11:10-22
excerpt: The ePub format is a publishing standard built on top of XHTML, CSS, XML and more. And since PHP is well suited for working with HTML and friends, why not use it to build ebooks? In this article&hellip;
---
---
title: Building & Maintaining OUI (Optimizely's UI Library): Part 1/2
url: https://css-tricks.com/optimizelys-ui-library-oui-1-of-2/
date_saved: 07/18/2016 10:33-11
excerpt: The following is a guest post by Tom Genoni. Tom is going to introduce us to the thinking and process behind Optimizely's new UI library / Sass framework. Part 2, by Daniel O'Connor, looks at some of&hellip;
---
---
title: Building & Maintaining OUI (Optimizely's UI Library): Part 2/2
url: https://css-tricks.com/optimizelys-ui-library-oui-2-of-2/
date_saved: 07/18/2016 10:33-06
excerpt: The following is a guest post by Daniel O'Connor. Daniel shares more about OUI, the UI library by Optimizely Tom Genoni introduced in Part 1. Over a year ago we set out on a mission at Optimizely to&hellip;
---
---
title: Canvassing
url: http://learnjs.io/canvassing/read/
date_saved: 07/18/2016 09:52-55
excerpt: Introduction Thank you! Thanks for checking out Canvassing! You'll learn these topics: Drawing paths, shapes, etc., and working with color Drawing images on the canvas How to create a game/animation&hellip;
---
---
title: CARDboard Illustrative Aid to Computation
url: https://en.wikipedia.org/wiki/CARDboard_Illustrative_Aid_to_Computation
date_saved: 07/18/2016 10:37-09
excerpt: CARDIAC (CARDboard Illustrative Aid to Computation) was a learning aid developed by David Hagelbarger and Saul Fingerman for Bell Telephone Laboratories in 1968 to teach high school students how&hellip;
---
---
title: Centralized logs with rsyslog, systemd and golang
url: http://indevwith.streamroot.io/centralized-logs-with-rsyslog-systemd-and-golang/
date_saved: 07/18/2016 09:41-11
excerpt: Here is how to build easily a centralized logging pipeline - log drain - with minimal dependencies. Through structured logging syntax, we will show how to effortlessly support monitoring and&hellip;
---
---
title: cgo is not Go
url: http://dave.cheney.net/2016/01/18/cgo-is-not-go
date_saved: 07/18/2016 10:57-47
excerpt: To steal a quote from JWZ, Some people, when confronted with a problem, think &#x201C;I know, I&#x2019;ll use cgo.&#x201D; Now they have two problems. Recently the use of cgo came up on the&hellip;
---
---
title: Choosing the Right Markdown Parser
url: https://css-tricks.com/choosing-right-markdown-parser/
date_saved: 07/18/2016 10:32-31
excerpt: The following is a guest post by Ray Villalobos. Ray is going to explore many of the different varietals of Markdown. All of them offer features beyond what the original Markdown can do, but they&hellip;
---
---
title: Claimed
url: http://www.slate.com/articles/news_and_politics/foreigners/2015/11/u_s_claims_in_cuba_the_strange_battle_that_is_exciting_speculators_and_could.html
date_saved: 07/18/2016 10:21-13
excerpt: Street life near the Capital building, Havana, Dec. 22, 2014. Photo by Michael Christopher Brown/Magnum Photos Back in April, at the Nasdaq marketplace in Ti
---
---
title: Clever New GitHub Tool Lets Coders Build Software Like Bridges
url: http://www.wired.com/2016/02/rebuilding-modern-software-is-like-rebuilding-the-bay-bridge/
date_saved: 07/18/2016 10:29-33
excerpt: Getty Images Jesse Toth says that upgrading an Internet service is like building a new bridge across San Francisco Bay. In building the new eastern span of the Bay Bridge, engineers didn&#x2019;t&hellip;
---
---
title: Climate Change Will Not Be Dangerous for a Long Time
url: http://www.scientificamerican.com/article/climate-change-will-not-be-dangerous-for-a-long-time/
date_saved: 07/18/2016 10:20-57
excerpt: &#xA9;iStock.comThe climate change debate has been polarized into a simple dichotomy. Either global warming is &#x201C;real, man-made and dangerous,&#x201D; as Pres. Barack Obama thinks, or&hellip;
---
---
title: code_of_the_damned();
url: http://codeofthedamned.com/index.php/introduction-to-the-math-of
date_saved: 07/18/2016 11:29-07
excerpt: Three-dimensional computer graphics is an exciting aspect of computing because of the amazing visual effects that can be created for display. All of this is created from an enormous number of&hellip;
---
---
title: Cognitive enhancement through real-time fMRI neurofeedback
url: http://www.sciencedirect.com/science/article/pii/S2352154615000625
date_saved: 07/18/2016 11:26-46
excerpt: Neuroscience has demonstrated that individual differences in cognitive task performance are closely linked to differences in brain activity. Neurofeedback training based on real-time functional&hellip;
---
---
title: CollagePlus
url: http://ed-lea.github.io/jquery-collagePlus/
date_saved: 07/18/2016 11:31-50
excerpt: This plugin for jQuery will arrange your images to fit exactly within a container. You can define the padding between images, give the images css borders and define a target row height. Example: Play&hellip;
---
---
title: Computing
url: https://www.technologyreview.com/s/536326/ibm-tests-mobile-computing-pioneers-controversial-brain-algorithms/
date_saved: 07/18/2016 10:11-49
excerpt: IBM is testing a contentious idea for making computers more intelligent by trying to copy mechanisms from the human brain. by Tom Simonite April 8, 2015 For more than a decade Jeff Hawkins, founder&hellip;
---
---
title: Conclusion
url: https://blog.abourget.net/en/2016/02/25/go-bridges-to-javascript-and-python/
date_saved: 07/18/2016 09:44-25
excerpt: This is the content of a talk given at Golang Montr&#xE9;al meetup on February 22nd 2016, at Google Montr&#xE9;al. This is a high level introduction to different bridges that exist between Go and&hellip;
---
---
title: Constructive destructuring
url: http://krasimirtsonev.com/blog/article/constructive-destructuring-es6-assignment
date_saved: 07/18/2016 09:48-06
excerpt: Destructuring is one of my favorite ES6(ES2015) features. It just shortens my code and helps me be more explicit with my statements. Let&#x2019;s see it in action.&#13;What&#x2019;s destructuring&hellip;
---
---
title: Cops hate encryption but the NSA loves it when you use PGP
url: http://www.theregister.co.uk/2016/01/27/nsa_loves_it_when_you_use_pgp/
date_saved: 07/18/2016 10:37-49
excerpt: Usenix Enigma Although the cops and Feds wont stop banging on and on about encryption – the spies have a different take on the use of crypto. To be brutally blunt, they love it. Why? Because using&hellip;
---
---
title: CoreOS Overview, Part One
url: https://deis.com/blog/2016/coreos-overview-p1
date_saved: 07/18/2016 10:36-23
excerpt: CoreOS is an important part of many container stacks. In this series of posts, we&#x2019;re going to take a look at CoreOS, why it&#x2019;s important, and how it works. If you don&#x2019;t know&hellip;
---
---
title: CoreOS Overview, Part Two
url: https://deis.com/blog/2016/coreos-overview-p2
date_saved: 07/18/2016 10:30-57
excerpt: This is the second post in a series looking at CoreOS. In my last post, we looked at how CoreOS is different from other Linux systems, atomic upgrades and release channels, and the basics of cluster&hellip;
---
---
title: Core Technology: Signals
url: https://www.linuxvoice.com/core-technology-signals/
date_saved: 07/18/2016 11:19-17
excerpt: In the world of Linux system programming, a signal is an event that&#x2019;s delivered to a process by the kernel. A signal says to the process &#x201C;something has happened that you might want to&hellip;
---
---
title: Coroutines in C
url: http://www.chiark.greenend.org.uk/~sgtatham/coroutines.html
date_saved: 07/18/2016 10:30-17
excerpt: by Simon Tatham Introduction Structuring a large program is always a difficult job. One of the particular problems that often comes up is this: if you have a piece of code producing data, and another&hellip;
---
---
title: CosmicMind/Material
url: https://github.com/CosmicMind/Material
date_saved: 07/18/2016 10:31-39
excerpt: Material is a graphics and animation framework for Google's Material Design. It is designed to allow the creativity of others to easily be expressed. Features Fully Configurable UI Components Base&hellip;
---
---
title: CPU Flame Graphs
url: http://www.brendangregg.com/FlameGraphs/cpuflamegraphs.html#Problem
date_saved: 07/18/2016 10:54-31
excerpt: MySQL CPU Flame Graph Determining why CPUs are busy is a routine task for performance analysis, which often involves profiling stack traces. Profiling by sampling at a fixed rate is a coarse but&hellip;
---
---
title: Create a Desktop Chat Application using the CEAN Stack and Electron
url: http://blog.couchbase.com/2016/january/create-a-desktop-chat-application-using-the-cean-stack-and-electron
date_saved: 07/18/2016 10:37-42
excerpt: So you're interested in creating a desktop chat application like Slack, but aren't sure where to start. Slack was very open in saying that they used Github's Electron platform for building the&hellip;
---
---
title: Creating a Computer Voice That People Like
url: http://www.nytimes.com/2016/02/15/technology/creating-a-computer-voice-that-people-like.html
date_saved: 07/18/2016 09:57-35
excerpt: When computers speak, how human should they sound? This was a question that a team of six IBM linguists, engineers and marketers faced in 2009, when they began designing a function that turned text&hellip;
---
---
title: Creating an Animated Product Slider with Sequence.js
url: https://davidwalsh.name/creating-animated-product-slider-sequencejs
date_saved: 07/18/2016 09:50-31
excerpt: In this tutorial, we're going to create a simple animated content slider with Sequence.js. We'll base our demo on the Sequence.js Theme, Mono. For the sake of brevity, our demo won't include&hellip;
---
---
title: Creation Museum: Bill Nye Debate Sparked Funding 'Miracle'
url: http://www.npr.org/sections/thetwo-way/2014/03/01/284397588/creation-museum-bill-nye-debate-sparked-funding-miracle
date_saved: 07/18/2016 10:07-56
excerpt: i Ken Ham, the founder of the Creation Museum who
---
---
title: "crocker"
url: "https://www.npmjs.com/package/crocker/"
date_saved: "07/19/2016 07:59-20"
excerpt: "Crank-Rocker -- Design and Analysis. Crocker is a javascript namespace and function library, which has proven successful in designing and analyzing Crank-Rockers as special planar fourbar mechanisms&hellip;"
thumbnail: [![](png/crocker.png)](png/full/crocker.png)
---
title: Cross-platform applications in practice
url: http://blog.airtame.com/how-electron-helps-airtame-to-provide-a-crossplatform-software/
date_saved: 07/18/2016 11:09-17
excerpt: From the very beginning, cross-platform capability has been one of our standard requirements at Airtame. It is our ultimate goal for users to be able to stream from any platform at any time. But how&hellip;
---
---
title: Cryptographic Module Standards at a Crossroads after Snowden’s Revelations
url: https://pomcor.com/2015/11/12/cryptographic-module-standards-at-a-crossroads-after-snowdens-revelations/
date_saved: 07/18/2016 10:20-01
excerpt: Last week I participated in the third International Cryptographic Module Conference (ICMC), organized by the Cryptographic Module User Forum (CMUF), and concerned with the validation of cryptographic&hellip;
---
---
title: C String Creation
url: http://maxsi.org/coding/c-string-creation.html
date_saved: 07/18/2016 10:05-45
excerpt: You often need to create a string in C. It's important to use the appropriate standard library functions for this, as this avoids a number of common error prone cases. This document shows how a&hellip;
---
---
title: D3.js First Steps
url: https://www.dashingd3js.com/d3js-first-steps
date_saved: 07/18/2016 10:14-39
excerpt: HTML Setup For now, you will just use a text file and the web browser. You will start with with a static page of HTML. Then you will add d3.js. Create a folder named d3js_projects. Create an HTML&hellip;
---
---
title: D3 + Leaflet
url: https://bost.ocks.org/mike/leaflet/
date_saved: 07/18/2016 09:58-23
excerpt: &#xA9; OpenStreetMap contributors This is a quick demonstration of using D3 to render GeoJSON shapes in conjunction with Leaflet. The implementation is straightforward, but Leaflet is regretfully&hellip;
---
---
title: Dancer2::Manual - A gentle introduction to Dancer2
url: https://metacpan.org/pod/Dancer2::Manual
date_saved: 07/18/2016 11:31-23
excerpt: NAME Dancer2::Manual - A gentle introduction to Dancer2 VERSION version 0.165000 DESCRIPTION Dancer2 is a free and open source web application framework written in Perl. It's a complete rewrite of&hellip;
---
---
title: Dartino Project
url: https://dartino.github.io/sdk/
date_saved: 07/18/2016 10:35-41
excerpt: Dartino is an experimental project to enable highly productive development for embedded devices. It is powered by the Dart language and a fast, lean runtime. This page walks you through running your&hellip;
---
---
title: Dconf configuration: GNOME 3 Fallback Mode
url: http://plugable.com/2012/08/19/switching-to-gnome-fallback-mode
date_saved: 07/18/2016 10:01-49
excerpt: The Linux GNOME 3 UI assumes you have a beefy 3D GPU and capable driver, which can cause problems when that isn&#x2019;t the case.Individual GNOME 3 users can fix this by setting their desktop&hellip;
---
---
title: dedis/cothority
url: https://github.com/DeDiS/cothority
date_saved: 07/18/2016 11:26-55
excerpt: Cothority This repository provides an implementation for the prototype of the collective authority (cothority) framework. The system is based on CoSi, a novel protocol for collective signing which&hellip;
---
---
title: Definitely an openresty guide
url: http://www.staticshin.com/programming/definitely-an-open-resty-guide/
date_saved: 07/18/2016 10:49-02
excerpt: It's neither comprehensive nor definitive but it will certainly help you get started Contents Why openresty? Back to the contents Before we answer the why let us first deal with the what. "What is&hellip;
---
---
title: Deserialization in Perl v5.8 | Agarri : Sécurité
informatique offensive
url: http://www.agarri.fr/kom/archives/2016/02/06/deserialization_in_perl_v5_8/index.html
date_saved: 07/18/2016 10:26-08
excerpt: During a pentest, I found an application containing a form with a hidden parameter named "state". Encoded as Base64, it contains a few strings and some binary data: $ echo&hellip;
---
title: Developer Edition 44: New visual editing and memory management tools
url: https://hacks.mozilla.org/2015/11/developer-edition-44-creative-tools-and-more/
date_saved: 07/18/2016 11:14-03
excerpt: This month marks the one-year anniversary of Firefox Developer Edition. To celebrate, we&#x2019;re excited to show you some new tools &#x2013; and some improvements to existing tools &#x2013; that&hellip;
---
---
title: DHCP configuration
url: http://www.packettracernetwork.com/tutorials/dhcpconfiguration.html
date_saved: 07/18/2016 10:33-24
excerpt: Details Last Updated: Friday, 06 February 2015 21:57 Hits: 52677	IntroductionDHCP service is a key component of your network infrastructure by allowing centralized ip address management on a single&hellip;
---
---
title: Distributed Dask Arrays
url: http://matthewrocklin.com/blog/work/2016/02/26/dask-distributed-part-3
date_saved: 07/18/2016 09:46-19
excerpt: This work is supported by Continuum Analytics and the XDATA Program as part of the Blaze Project In this post we analyze weather data across a cluster using NumPy in parallel with dask.array. We&hellip;
---
---
title: DIY Projects, How-Tos, Electronics, Crafts and Ideas for Makers
url: http://makezine.com/2011/09/06/zero-to-make-crash-course-in-welding/
date_saved: 07/18/2016 10:54-45
excerpt: Over the next month-plus, David Lang, something of a reluctant maker, is immersing himself in maker culture and learning as many DIY skills as he can, through a generous arrangement with our pals at&hellip;
---
---
title: Emotional and physical health benefits of expressive writing
url: http://apt.rcpsych.org/content/11/5/338
date_saved: 07/18/2016 10:21-38
excerpt: Abstract Writing about traumatic, stressful or emotional events has been found to result in improvements in both physical and psychological health, in non-clinical and clinical populations. In the&hellip;
---
---
title: Enginursday: KiCad and Open-Source Design
url: https://www.sparkfun.com/news/2041
date_saved: 07/18/2016 09:40-44
excerpt: Buckle up kids, it&#x2019;s Enginursday! This week I bring you the process of using open-source designs to get to a final product, featuring KiCad, PJRC and Advanced Circuits. A test and programming&hellip;
---
---
title: ES6 Rest/Spread, Defaults and Destructuring
url: http://www.datchley.name/es6-rest-spread-defaults-and-destructuring/
date_saved: 07/18/2016 11:27-51
excerpt: As I've been playing around with React and more specifically Redux these last couple of weeks, the usefulness and joy of ES6's new rest/spread '...' operator and default function arguments has become&hellip;
---
---
title: "ES6 Template Literals: Techniques and Tools"
url: "https://www.sitepoint.com/es6-template-literals-techniques-and-tools/"
date_saved: "07/19/2016 22:34-46"
excerpt: "This article is part of a web development series from Microsoft. Thank you for supporting the partners who make SitePoint possible. JavaScript template literals, new to ES6, provide a powerful new&hellip;"
thumbnail: [![](png/es6_template_literals_techniques_and_tools.png)](png/full/es6_template_literals_techniques_and_tools.png)
---
title: ESP8266 Troubleshooting Guide
url: http://randomnerdtutorials.com/esp8266-troubleshooting-guide/
date_saved: 07/18/2016 10:30-32
excerpt: The ESP8266 has a few common issues,&#xA0;specially&#xA0;when you are trying to flash a new firmware&#xA0;or&#xA0;uploading scripts. This is a companion guide to the Home Automation using ESP8266 and&hellip;
---
---
title: EverythingMe open and out
url: https://medium.com/@joeysim/everythingme-open-and-out-6ed94b436e4c#.vkxbhvncq
date_saved: 07/18/2016 11:17-56
excerpt: do not go gentle into that good nightThis post is not about the past but rather about the future, EverythingMe has announced it has shut down its operations a few weeks ago, and since then&hellip;
---
---
title: Exploring Dynamic Layout in Sketch — Facebook Design
url: https://medium.com/facebook-design/exploring-dynamic-layout-in-sketch-fdf0e825d1cf#.vz3b4g6n7
date_saved: 07/18/2016 09:39-09
excerpt: If you design interfaces, you probably often work with repeating elements, like rows in a table or a grid of items. While Sketch provides some way of applying the same style to many elements via&hellip;
---
---
title: Export Evernote Items to Day One
url: http://veritrope.com/code/export-evernote-items-to-day-one/
date_saved: 07/18/2016 11:10-10
excerpt: DescriptionDay One is a journal / diary / text logging application for the Mac which has attracted a lot of positive attention: It has tremendous visual polish and appeal, prompts you to write daily,&hellip;
---
---
title: FCC Pledges To Put In Place The Strongest Open Internet Protections It’s Ever Proposed
url: http://techcrunch.com/2015/02/04/fcc-pledges-to-put-in-place-the-strongest-open-internet-protections-its-ever-proposed/
date_saved: 07/18/2016 10:09-34
excerpt: In an op-ed published this morning, Federal Communications Commission (FCC) Chairman Tom Wheeler&#xA0;publicly&#xA0;announced that his agency will use Title II of the Communications Act to&hellip;
---
---
title: Flynn's taxonomy
url: https://en.wikipedia.org/wiki/Flynn%27s_taxonomy
date_saved: 07/18/2016 10:37-33
excerpt: Flynn's taxonomy is a classification of computer architectures, proposed by Michael Flynn in 1966.[1][2] The classification system has stuck, and has been used as a tool in design of modern&hellip;
---
---
title: frankmcsherry/blog
url: https://github.com/frankmcsherry/blog/blob/master/posts/2015-12-24.md
date_saved: 07/18/2016 11:27-15
excerpt: "Graph processing" is one of many areas of big data research that make you feel like we've gone backwards in time. The class of graph algorithms modern systems typically express is quite limited, and&hellip;
---
---
title: FreeBSD 10.1 x64 WiFi Captive Portal
url: http://www.unixmen.com/freebsd-10-1-x64-wifi-captive-portal/
date_saved: 07/18/2016 10:57-54
excerpt: Our goal is to build a FreeBSD server Captive Portal as it is in hotels and airports. Guest joins to wifi without entering a username or password, but when trying to join internet the user will be&hellip;
---
---
title: From SMM to userland in a few bytes
url: https://scumjr.github.io/2016/01/10/from-smm-to-userland-in-a-few-bytes/
date_saved: 07/18/2016 10:48-48
excerpt: 10 January 2016 In 2014, @coreykal, @xenokovah, @jwbutterworth3 @ssc0rnwell gave a talk entitled Extreme Privilege Escalation on Windows 8/UEFI Systems at Black Hat USA. They introduced the idea of a&hellip;
---
---
title: Fun C Micro-optimizations - restrict
url: http://jcdav.is/2015/11/23/Fun-C-Micro-optimizations-restrict/
date_saved: 07/18/2016 11:19-13
excerpt: 23 Nov 2015 Lets say we wanted to add a value to an every element of an array. Here&#x2019;s a slightly contrived example: void add_to_array(int* arr, int* v, int len) { for(int i = 0; i &lt; len;&hellip;
---
---
title: Futuristic UC Berkeley operating system uniquely controls discrete 'manycore' resources
url: http://www.networkworld.com/article/2167038/software/futuristic-uc-berkeley-operating-system-uniquely-controls-discrete--manycore--resources.html
date_saved: 07/18/2016 10:08-02
excerpt: AUSTIN, Texas -- Does the world need another operating system? Yes, according to the creative minds in the computer science department at the University of California at Berkeley, which have come up&hellip;
---
---
title: Fuzzing with american fuzzy lop
url: http://lwn.net/Articles/657959/
date_saved: 07/18/2016 11:13-50
excerpt: In September 2014 a serious security vulnerability that became known as Shellshock was found in Bash, which is the default shell in most Linux distributions. But it quickly turned out that the&hellip;
---
---
title: Gérard de Villiers, the Spy Novelist Who Knows Too Much
url: http://www.nytimes.com/2013/02/03/magazine/gerard-de-villiers-the-spy-novelist-who-knows-too-much.html
date_saved: 07/18/2016 10:13-48
excerpt: Last June, a pulp-fiction thriller was published in Paris under the title &#x201C;Le Chemin de Damas.&#x201D; Its lurid green-and-black cover featured a busty woman clutching a pistol, and its plot&hellip;
---
---
title: Gert's VGA Adapter
url: https://www.raspberrypi.org/blog/gert-vga-adapter/
date_saved: 07/18/2016 10:03-15
excerpt: The Raspberry Pi has an HDMI port to connect a display. If your monitor only has VGA, you have to use an adapter. Because this requires a digital-to-analogue conversion, those adapters can be quite&hellip;
---
---
title: getiblog
url: http://blog.getify.com/concurrently-javascript-1/
date_saved: 07/18/2016 11:19-27
excerpt: What is concurrency? How is it different from parallelism? JavaScript is single-threaded on the event loop, so how does its asynchrony fit into the mix? These are great questions, but sadly, I think&hellip;
---
---
title: Getting Started Guide
url: http://docs.nativescript.org/start/getting-started
date_saved: 07/18/2016 11:20-28
excerpt: NativeScript Getting Started Guide Welcome to the NativeScript Getting Started Guide. In this tutorial you'll use NativeScript, a cross-platform JavaScript framework for building native mobile apps,&hellip;
---
---
title: Getting started with CRISPR experiments: Part I
url: http://genomics.quiltdata.com/2016/01/26/getting-started-with-crispr-experiments-part-i/
date_saved: 07/18/2016 10:24-50
excerpt: CRISPR as molecular debugging CRISPR technology is transforming how we manipulate genes to understand their function. To explain CRISPR&#x2019;s emerging role in genetic engineering, let&#x2019;s use&hellip;
---
---
title: Getting Started with Slack Bots
url: http://www.sitepoint.com/getting-started-slack-bots/
date_saved: 07/18/2016 10:39-15
excerpt: Slack is a popular tool for encouraging better communication among team members. It comes with a slew of helpful features and services including third-party integrations and webhook support. Slack&hellip;
---
---
title: GIMP - GIMP and GEGL in 2015
url: http://www.gimp.org/news/2015/12/31/2015-report/
date_saved: 07/18/2016 11:09-00
excerpt: We hope you are having great holidays. Here is our annual report about project activities in&#xA0;2015. It&#x2019;s been an interesting year for GIMP. For the most part, we focused on completing the&hellip;
---
---
title: GitHub's Scientist Softens the Terror of Updating Legacy Code
url: http://thenewstack.io/githubs-scientist-softens-terror-updating-legacy-code/
date_saved: 07/18/2016 10:05-16
excerpt: Every developer knows that moment of dread &#x2014; throwing the switch to move from an old system to one with updated code. No matter how many tests are run, there are always unexpected glitches&hellip;
---
---
title: GitLab Documentation
url: http://doc.gitlab.com/ee/workflow/gitlab_flow.html
date_saved: 07/18/2016 09:59-34
excerpt: Introduction Version management with git makes branching and merging much easier than older versioning systems such as SVN. This allows a wide variety of branching strategies and workflows. Almost&hellip;
---
---
title: GitLab Flow
url: https://about.gitlab.com/2014/09/29/gitlab-flow/
date_saved: 07/18/2016 09:59-44
excerpt: The most up to date version of the content of this blog post can be found in our documentation. Version management with git makes branching and merging much easier than older versioning systems such&hellip;
---
---
title: Git Source Code Review
url: http://fabiensanglard.net/git_code_review/diff.php
date_saved: 07/18/2016 11:19-46
excerpt: April 1st, 2014 I love you Hoi-En. To find the differences between two "things" is a difficult task that Git has to perform very often: Find the differences between two binaries files in order to&hellip;
---
---
title: Glow: Map Reduce for Golang
url: https://blog.gopheracademy.com/advent-2015/glow-map-reduce-for-golang/
date_saved: 07/18/2016 11:28-23
excerpt: Having been a Java developer for many years, I have simply lost interest in Java and want to code everything in Go, mostly due to Go&#x2019;s simplicity and performance. But it&#x2019;s Java that is&hellip;
---
---
title: Goldman Sachs Guide to being a man
url: http://thebaumlist.com/goldman-sachs-guide-to-being-a-man/
date_saved: 07/18/2016 10:24-14
excerpt: 
---
---
title: Good Leaders are game changers: Raft & Paxos
url: http://mysqlhighavailability.com/good-leaders-are-game-changers-raft-paxos/
date_saved: 07/18/2016 11:18-51
excerpt: Introduction Consensus is a key component to providing fault-tolerant services such as synchronously replicated data stores, non-blocking atomic commitment and Paxos and Raft are among the most&hellip;
---
---
title: go with Peter Bourgon
url: http://howistart.org/posts/go/1
date_saved: 07/18/2016 11:06-39
excerpt: Go is a lovely little programming language designed by smart people you can trust and continuously improved by a large and growing open-source community. Go is meant to be simple, but sometimes the&hellip;
---
---
title: group test: NAS distros
url: https://www.linuxvoice.com/group-test-nas-distros/
date_saved: 07/18/2016 10:28-03
excerpt: FreeNAS NAS4Free Open Media Vault Openfiler Community Edition EasyNAS Turnkey Linux File Server What&#x2019;s a terabyte to a data connoisseur? If you&#x2019;re like us, you probably have more data&hellip;
---
---
title: Guide to Linear Regression
url: http://alexhwoods.com/guide-to-linear-regression/
date_saved: 07/18/2016 10:54-38
excerpt: Linear regression is one of&#xA0;the first things you should try if you&#x2019;re modeling a linear relationship (actually, non-linear relationships too!).&#xA0;It&#x2019;s fairly simple, and&hellip;
---
---
title: Gun Violence Research
url: https://medium.com/@sbuss/gun-violence-research-f20b2adc18cb#.iwiszpyh7
date_saved: 07/18/2016 10:22-19
excerpt: I tried to educate myself about gun violence, so I spent a few hours researching the topic. All sources were as objective as I could find, with a strong bias in favor of governmental research&hellip;
---
---
title: Handwritten Parsers & Lexers in Go
url: https://blog.gopheracademy.com/advent-2014/parsers-lexers/
date_saved: 07/18/2016 11:28-09
excerpt: In these days of web apps and REST APIs it seems that writing parsers is a dying art. You may think parsers are a complex undertaking only reserved for programming language designers but I&#x2019;d&hellip;
---
---
title: HDLC configuration
url: http://www.packettracernetwork.com/labs/lab11-hdlc.html
date_saved: 07/18/2016 10:33-34
excerpt: Details Last Updated: Friday, 06 February 2015 21:57 Hits: 17476	This lab will test your ability to configure HDLC on a serial link. Practicing this labs will help you to get ready for your CCNA&hellip;
---
---
title: Hello World
url: https://guides.github.com/activities/hello-world/
date_saved: 07/18/2016 09:50-18
excerpt: The Hello World project is a time-honored tradition in computer programming. It is a simple exercise that gets you started when learning something new. Let&#x2019;s get started with GitHub!&hellip;
---
---
title: High Paying, Low-Stress Jobs
url: http://www.osoti.net/culture/high-paying-low-stress-jobs/
date_saved: 07/18/2016 11:19-07
excerpt: We&#x2019;ve all had days where we though, &#x201C;I need a new job&#x201D; well, with the right education and perseverance, you too could get a career in one of these ranked &#x201C;High Paying, Low&hellip;
---
---
title: HILARIOUS: ‘Atheists, Don’t You Understand That Sustained Space Flight is Impossible?’
url: http://aattp.org/hilarious-atheists-dont-you-understand-that-sustained-space-flight-is-impossible/
date_saved: 07/18/2016 10:09-17
excerpt: It can sometimes be hard to tell what is real, what is fake, and what is real masquerading as fake (or fake masquerading as real) on the Internet. Between&#xA0;satirists, both inept and adept, and&hellip;
---
---
title: H.
url: https://nplusonemag.com/issue-24/essays/h/
date_saved: 07/18/2016 09:44-31
excerpt: There is a photo of you standing outside the house in Borough Park, grin wide, head back, laughing. Slender in faded blue jeans against the brick and white stucco, your hair a mass of thick black&hellip;
---
---
title: How a business book from the ’80s became a cult classic in Silicon Valley
url: https://www.washingtonpost.com/news/on-leadership/wp/2015/11/18/how-a-business-book-from-the-80s-became-a-cult-classic-in-silicon-valley/
date_saved: 07/18/2016 10:19-26
excerpt: Airbnb CEO Brian Chesky has said it’s his primary reference book on management techniques. Twitter co-founder Evan Williams is said to have recommended it to employees. Facebook founder Mark&hellip;
---
---
title: How Addiction Works, and What You Can Do About It
url: http://lifehacker.com/how-addiction-works-and-what-you-can-do-about-it-1583759577
date_saved: 07/18/2016 10:08-48
excerpt: For many of us, topics like addiction and substance abuse seem far removed, like they affect other people and don't (or will never) concern us&#x2014;the same way depression, anxiety, or other issues&hellip;
---
---
title: How a Mexican Drug Cartel Makes Its Billions
url: http://www.nytimes.com/2012/06/17/magazine/how-a-mexican-drug-cartel-makes-its-billions.html
date_saved: 07/18/2016 10:13-42
excerpt: One afternoon last August, at a hospital on the outskirts of Los Angeles, a former beauty queen named Emma Coronel gave birth to a pair of heiresses. The twins, who were delivered at 3:50 and 3:51,&hellip;
---
---
title: How Can I Balance Multiple Jobs Without Losing My Mind?
url: http://lifehacker.com/how-can-i-balance-multiple-jobs-without-losing-my-mind-506383398
date_saved: 07/18/2016 09:35-59
excerpt: Dear Lifehacker,I'm fresh out of college and already working multiple part-time jobs. Altogether, I'm pulling down about 60-70 hours a week. How can I keep from getting burned out ruining my chances&hellip;
---
---
title: How People Learn to Become Resilient
url: http://www.newyorker.com/science/maria-konnikova/the-secret-formula-for-resilience
date_saved: 07/18/2016 10:06-16
excerpt: Perception is key to resilience: Do you conceptualize an event as traumatic, or as a chance to learn and grow? Credit Illustration by Gizem Vural
---
---
title: How the Bitcoin protocol actually works
url: http://www.michaelnielsen.org/ddi/how-the-bitcoin-protocol-actually-works/
date_saved: 07/18/2016 10:58-57
excerpt: Many thousands of articles have been written purporting to explain Bitcoin, the online, peer-to-peer currency. Most of those articles give a hand-wavy account of the underlying cryptographic&hellip;
---
---
title: How the Internet Has Changed Bullying
url: http://www.newyorker.com/science/maria-konnikova/how-the-internet-has-changed-bullying
date_saved: 07/18/2016 10:18-43
excerpt: Before the Internet, bullying ended when you withdrew from whatever environment you were in. But now, the bullying dynamic is harder to contain and harder to ignore. Credit Illustration by Min Heo
---
---
title: How to animate "box-shadow" with silky smooth performance
url: http://tobiasahlin.com/blog/how-to-animate-box-shadow/
date_saved: 07/18/2016 10:26-39
excerpt: How do you animate the box-shadow property in CSS without causing re-paints on every frame, and heavily impacting the performance of your page? Short answer: you don't. Animating a change of&hellip;
---
---
title: How to Build an High Availability 
MQTT Cluster for the Internet of Things
url: https://medium.com/@lelylan/how-to-build-an-high-availability-mqtt-cluster-for-the-internet-of-things-8011a06bd000#.zc7ouz3xl
date_saved: 07/18/2016 10:25-27
excerpt: Create a scalable MQTT infrastructure using Node.js, Redis, HAProxy and nscale to make the deployment phase a piece of cake &#x263A;
---
title: How to Build A Slackbot + Deploy an App to Heroku for Absolute Beginners
url: http://blog.npmjs.org/post/128237577345/how-to-build-a-slackbot-deploy-an-app-to-heroku
date_saved: 07/18/2016 10:39-11
excerpt: Back in ye olde days of the internet, there was IRC (Internet Relay Chat), a chat network with channels and servers for every microcosm in the world. Folks would make these little bots or&hellip;
---
---
title: How to C in 2016
url: https://matt.sh/howto-c
date_saved: 07/18/2016 10:58-49
excerpt: This is a draft I wrote in early 2015 and never got around to publishing. Here's the mostly unpolished version because it wasn't doing anybody any good sitting in my drafts folder. The simplest&hellip;
---
---
title: How To Create a Text Portrait Effect in Photoshop
url: http://blog.spoongraphics.co.uk/tutorials/how-to-create-a-text-portrait-effect-in-photoshop
date_saved: 07/18/2016 11:25-54
excerpt: In today&#x2019;s Photoshop tutorial we&#x2019;re going to create a cool portrait effect using a long passage of text that bends and deforms around the contours of the face. Known as a Calligram,&hellip;
---
---
title: How to Earn Bitcoin Through Arbitrage Software (AKA a bot)
url: http://www.bitcoinbulls.net/how-to-earn-bitcoins-through-arbitrage-software-aka-bot/
date_saved: 07/18/2016 11:18-39
excerpt: Interested in automated bitcoin trading software? In 2013 I developed an arbitrage bot to automatically earn bitcoins in a low-risk way. I’ve never been in to day trading or forex trading. It’s&hellip;
---
---
title: How to Find Evidence to Support Any Argument
url: http://lifehacker.com/how-to-find-evidence-to-support-any-argument-1454627815
date_saved: 07/18/2016 10:07-27
excerpt: Information is knowledge, and knowledge is power. If you want someone to rally to your cause, support your position, or put you in a position of authority, you need to be able to back up your&hellip;
---
---
title: How To Infer Topology
url: https://bost.ocks.org/mike/topology/
date_saved: 07/18/2016 09:58-27
excerpt: bl.ocks.org/6406992 As its name implies, TopoJSON is a topological geospatial data format. In contrast to a geometry, where each shape is encoded with separate (and often redundant) arrays of&hellip;
---
---
title: How to make any plot in ggplot2?
url: http://r-statistics.co/ggplot2-Tutorial-With-R.html
date_saved: 07/18/2016 11:15-27
excerpt: ggplot2 is the most elegant and aesthetically pleasing graphics framework available in R. It has a nicely planned structure to it. This tutorial focusses on exposing this underlying structure you can&hellip;
---
---
title: How to make Bitcoin home mining profitable again in 4 easy steps.
url: http://blog.bitheat.io/bitheater/
date_saved: 07/18/2016 10:58-54
excerpt: 27 November 2015 Shrink BTC miner to fit into a pipe Fit pipeMiner as a replacement heating element for electric water heaters bin CAs Profit The first challenge is the size of this miner. In order to&hellip;
---
---
title: How to Make Money Doing (Almost) Nothing
url: http://lifehacker.com/how-to-make-money-doing-almost-nothing-1462909872
date_saved: 07/18/2016 10:07-20
excerpt: There's almost no limit to the ways you can make money, but most of them require work (that particular balance is known as "the human condition"). However, there are ways to make extra cash without&hellip;
---
---
title: How To Set Up a Deis Cluster on DigitalOcean
url: https://deis.com/blog/2016/deis-cluster-digitalocean
date_saved: 07/18/2016 10:36-19
excerpt: In a previous post, we used Rigger to deploy Deis on DigitalOcean. In this post, we take a different and more detailed approach. Introduction Deis is an open source private Platform as a Service&hellip;
---
---
title: "How to stay anonymous online"
url: "http://news.mit.edu/2016/stay-anonymous-online-0711"
date_saved: "07/19/2016 07:59-36"
excerpt: "Anonymity networks protect people living under repressive regimes from surveillance of their Internet use. But the recent discovery of vulnerabilities in the most popular of these networks &#x2014;&hellip;"
thumbnail: [![](png/how_to_stay_anonymous_online.png)](png/full/how_to_stay_anonymous_online.png)
---
title: How to use an Xbox 360 controller with OS X Yosemite
url: http://www.jacobtomlinson.co.uk/2014/10/17/use-xbox-360-pad-with-yosemite/
date_saved: 07/18/2016 11:11-20
excerpt: Want to use an Xbox 360 controller to play games on Mac OS X 10.10 Yosemite? Here are simple instructions to get you started in no time. Driver To get your Xbox 360 pad working you'll need to install&hellip;
---
---
title: HTTP Security Best Practice
url: https://httpsecurityreport.com/best_practice.html
date_saved: 07/18/2016 10:40-27
excerpt: SSL/TLS Transport Layer Security (TLS) and its predecessor Secure Sockets Layer (SSL), facilitates confidential communications on the web by providing end-to-end encryption between browsers and web&hellip;
---
---
title: hub makes git better with GitHub
url: https://hub.github.com/
date_saved: 07/18/2016 11:09-53
excerpt: hub is a command-line wrapper for git that makes you better at GitHub. $ brew install hub $ git clone https://github.com/github/hub.git &amp;&amp; cd hub $ script/build -o ~/bin/hub $ alias git=hub $&hellip;
---
---
title: I feel naked.
url: https://www.ifeelnaked.org/
date_saved: 07/18/2016 10:13-04
excerpt: And I shouldn't. Our private moments belong to us. We should never, ever have to worry the government is watching. Yet the NSA is collecting and reviewing our lives every day. Congress will vote by&hellip;
---
---
title: If you're alive in 30 years, chances are good you may also be alive in 1000 years
url: http://haakonsk.blogg.no/1456259429_if_youre_alive_in_30_.html
date_saved: 07/18/2016 09:44-57
excerpt: - Norwegian version: Hvis du lever om 30 &#xE5;r, er det gode sjanser for at du ogs&#xE5; kan leve om 1000 &#xE5;r&#13;Sounds unlikely? It's not - it's actually quite likely.&#13;The only way to get&hellip;
---
---
title: Ignore Your Feelings
url: http://www.theatlantic.com/health/archive/2015/09/fuck-feelings/403792/
date_saved: 07/18/2016 10:34-25
excerpt: Put down the talking stick. Stop fruitlessly seeking "closure" with your peevish co-worker. And please, don't bother telling your spouse how annoying you find their tongue-clicking&hellip;
---
---
title: Immediately-Invoked Function Expression (IIFE)
url: http://benalman.com/news/2010/11/immediately-invoked-function-expression/
date_saved: 07/18/2016 09:50-53
excerpt: In case you hadn&#x2019;t noticed, I&#x2019;m a bit of a stickler for terminology. So, after hearing the popular, yet misleading, JavaScript term &#x201C;self-executing anonymous function&#x201D; (or&hellip;
---
---
title: Impact Journals presents
url: http://www.impactaging.com/papers/v6/n9/full/100690.html
date_saved: 07/18/2016 10:03-30
excerpt: INTRODUCTION Magnitude of the problem Cognitive decline is a major concern of the aging population, and Alzheimer's disease is the major cause of age-related cognitive decline, with approximately 5.4&hellip;
---
---
title: ImperialViolet
url: https://www.imperialviolet.org/2015/12/24/rlwe.html
date_saved: 07/18/2016 11:30-52
excerpt: If large quantum computers can be built (and not of the D-Wave variety) then they'll make quite a mess of public-key cryptography. RSA and systems based on discrete logarithms (i.e. finite-field and&hellip;
---
---
title: Incentivizing Quality and Impact in Computing Research
url: http://cacm.acm.org/magazines/2015/5/186027-incentivizing-quality-and-impact-in-computing-research/fulltext
date_saved: 07/18/2016 10:12-16
excerpt: Communications of the ACM By Moshe Y. Vardi Communications of the ACM, Vol. 58 No. 5, Page 5 10.1145/2753507 Comments Over the past few years, the computing-research community has been conducting a&hellip;
---
---
title: Influence of the IBM PC on the personal computer market
url: https://en.wikipedia.org/wiki/Influence_of_the_IBM_PC_on_the_personal_computer_market#Before_the_IBM_PC.27s_introduction
date_saved: 07/18/2016 10:37-37
excerpt: The IBM Personal Computer (model 5150) Following the introduction of the IBM Personal Computer, or IBM PC, many other
---
---
title: Install, configure and automatically renew Let's Encrypt SSL certificate (English) - Blog
url: https://vincent.composieux.fr/article/install-configure-and-automatically-renew-let-s-encrypt-ssl-certificate
date_saved: 07/18/2016 11:26-59
excerpt: I've recentelly passed https://vincent.composieux.fr over HTTPS using a Let's Encrypt free SSL certificate so this blog articles will explain you how I've done it, how I also renew the certificate&hellip;
---
---
title: Install NetBeez software agent
url: https://netbeez.net/product/install-netbeez-software-agent/
date_saved: 07/18/2016 10:57-03
excerpt: SOFTWARE AGENT 1- Add the NetBeez software repository, update the database, and install the netbeez-agent package:
---
---
title: Interfaces configuration
url: http://www.packettracernetwork.com/labs/lab2-switchinterfacesconfig.html
date_saved: 07/18/2016 10:34-06
excerpt: Details Last Updated: Friday, 06 February 2015 21:57 Hits: 44660	Lab instructionsThis lab will test your ability to configure speed, duplex, and vlan settings on a cisco switch interfaces.1. Connect&hellip;
---
---
title: Internet Census 2012
url: http://internetcensus2012.bitbucket.org/paper.html
date_saved: 07/18/2016 09:58-04
excerpt: Internet Census 2012 Port scanning /0 using insecure embedded devices Carna Botnet Abstract While playing around with the Nmap Scripting Engine (NSE) we discovered an amazing number of open embedded&hellip;
---
---
title: Introducing d3-scale
url: https://medium.com/@mbostock/introducing-d3-scale-61980c51545f#.ksp3lylvr
date_saved: 07/18/2016 11:28-19
excerpt: I’d like D3 to become the standard library of data visualization: not just a tool you use directly to visualize data by writing code, but also a suite of tools that underpin more powerful software.To&hellip;
---
---
title: Introducing immutable collections of ImmutableJS
url: http://webuilddesign.com/introducing-immutable-collections-of-immutablejs/
date_saved: 07/18/2016 09:46-36
excerpt: ImmutableJS is a library that allows us to manage different collections and add immutable qualities. It was created by Facebook in 2013 and is complemented perfectly with&hellip;
---
---
title: Introducing Lemur
url: http://techblog.netflix.com/2015/09/introducing-lemur.html
date_saved: 07/18/2016 11:12-25
excerpt: by: Kevin Glisson, Jason Chan&#xA0;and&#xA0;Ben Hagen Netflix is pleased to announce the open source release of our x.509 certificate orchestration framework : Lemur! The Challenge of Certificate&hellip;
---
---
title: Introducing Tamper
url: http://nytimes.github.io/tamper/
date_saved: 07/18/2016 11:20-07
excerpt: What is Tamper? Tamper is a serialization protocol for categorical data. It achieves high compression ratios by finding the smallest possible binary representation for each category. How does it&hellip;
---
---
title: Introduction
url: https://serviceworke.rs/
date_saved: 07/18/2016 10:40-31
excerpt: The Service Worker Cookbook is a collection of working, practical examples of using service workers in modern web apps. Tip: Open your Developer Tools console to view fetch events and informative&hellip;
---
---
title: Introduction to Monte Carlo Tree Search
url: http://jeffbradberry.com/posts/2015/09/intro-to-monte-carlo-tree-search/
date_saved: 07/18/2016 11:12-12
excerpt: The subject of game AI generally begins with so-called perfect information games. These are turn-based games where the players have no information hidden from each other and there is no element of&hellip;
---
---
title: Intro to Windows kernel exploitation 1/N: Kernel Debugging
url: https://www.whitehatters.academy/intro-to-kernel-exploitation-part-1/
date_saved: 07/18/2016 10:35-21
excerpt: By Sam Brown (@_samdb_) I've been learning Windows kernel exploitation recently and decided to turn my notes into a rough tutorial. Obviously I'm only just learning all of this myself so any&hellip;
---
---
title: James Anthony Majeski, M.D., Ph.D. Obituary
url: http://hosting-25037.tributes.com/obituary/show/James-Anthony-Majeski-101385279
date_saved: 07/18/2016 10:08-52
excerpt: James Anthony Majeski, M.D., Ph.D., 69, of Mount Pleasant, South Carolina, husband of Elizabeth Durst Majeski, Ed.D passed away at home on Saturday, May 24, 2014. A Mass of Christian Burial will be&hellip;
---
---
title: JS
url: http://www.jstherightway.org/#patterns
date_saved: 07/18/2016 09:55-07
excerpt: Object Oriented JavaScript has strong object-oriented programming capabilities, even though some debates have taken place due to the differences in object-oriented JavaScript compared to other&hellip;
---
---
title: JS Objects: Inherited a Mess
url: https://davidwalsh.name/javascript-objects
date_saved: 07/18/2016 11:06-55
excerpt: JS Objects: TL;DR JavaScript has been plagued since the beginning with misunderstanding and awkwardness around its "prototypal inheritance" system, mostly due to the fact that "inheritance" isn't how&hellip;
---
---
title: karpathy/neuraltalk2
url: https://github.com/karpathy/neuraltalk2
date_saved: 07/18/2016 11:10-45
excerpt: Recurrent Neural Network captions your images. Now much faster and better than the original NeuralTalk. Compared to the origianl NeuralTalk this implementation is batched, uses Torch, runs on a GPU,&hellip;
---
---
title: kevoree-modeling/framework
url: https://github.com/kevoree-modeling/framework
date_saved: 07/18/2016 11:10-06
excerpt: What's new? Versions: The versioning strategy of KMF is lead by the version of the runtime. It means that the runtime version will have a version 4.., like 4.26.4. According to that, all compatible&hellip;
---
---
title: Lab 1 : Basic switch setup
url: http://www.packettracernetwork.com/labs/lab1-basicswitchsetup.html
date_saved: 07/18/2016 10:34-13
excerpt: Details Last Updated: Saturday, 23 January 2016 16:20 Hits: 71209	IntroductionA new switch just purchased from Cisco contains no default configuration in it. You need to configure the switch with&hellip;
---
---
title: Lab 6 : Basic router setup
url: http://www.packettracernetwork.com/labs/lab6-basicroutersetup.html
date_saved: 07/18/2016 10:33-40
excerpt: Details Last Updated: Friday, 08 May 2015 09:02 Hits: 2448	Lab instructionsThe aim of this lab is to test your ability to perform a basic router setup. You have 15 minutes to complete this&hellip;
---
---
title: Labelling Form Elements
url: http://bitsofco.de/labelling-form-elements/
date_saved: 07/18/2016 10:51-01
excerpt: One context in which providing the correct labels for elements can be crucial is in HTML forms. Because users are interacting with forms more directly unlike with some UI elements, it is important&hellip;
---
---
title: Learn ES2015 · Babel
url: https://babeljs.io/docs/learn-es2015/
date_saved: 07/18/2016 10:40-35
excerpt: es6features This document was originally taken from Luke Hoban's excellent es6features repo. Go give it a star on GitHub! REPL Be sure to try these features out in the online REPL. Introduction&hellip;
---
---
title: Learn
url: http://feathersjs.com/learn/
date_saved: 07/18/2016 11:31-47
excerpt: So you're ready to learn more about Feathers, eh? If you haven't checked out the Quick Start guide head over there first to get a brief intro to the basic parts of a Feathers app. On this page you'll&hellip;
---
---
title: Lessons from Douglass North, plus an amazing GDP chart
url: http://andrewbatson.com/2015/11/27/lessons-from-douglass-north-plus-an-amazing-gdp-chart/
date_saved: 07/18/2016 10:20-08
excerpt: I was sad to hear of the passing of the great Douglass North earlier this week (there are obituaries from the Economist, New York Times&#xA0;and Washington University in St. Louis, the last focusing&hellip;
---
---
title: Lessons Learned in Software Development
url: http://henrikwarne.com/2015/04/16/lessons-learned-in-software-development/
date_saved: 07/18/2016 10:12-00
excerpt: Here is my list of heuristics and rules of thumb for software development that I have found useful&#xA0;over the years: Development 1. Start small, then extend.&#xA0;Whether creating a new system, or&hellip;
---
---
title: Let’s Build A Simple Interpreter. Part 6.
url: http://ruslanspivak.com/lsbasi-part6/
date_saved: 07/18/2016 11:30-56
excerpt: Date Mon, November 02, 2015 Today is the day :) &#x201C;Why?&#x201D; you might ask. The reason is that today we&#x2019;re wrapping up our discussion of arithmetic expressions (well, almost) by adding&hellip;
---
---
title: Let’s Build A Simple Interpreter. Part 7.
url: http://ruslanspivak.com/lsbasi-part7/
date_saved: 07/18/2016 11:28-28
excerpt: Date Tue, December 15, 2015 As I promised you last time, today I will talk about one of the central data structures that we&#x2019;ll use throughout the rest of the series, so buckle up and&hellip;
---
---
title: Let’s Make a Bubble Map
url: https://bost.ocks.org/mike/bubble-map/
date_saved: 07/18/2016 09:58-18
excerpt: My previous Let&#x2019;s Make a Map tutorial describes how to make a basic map with D3 and TopoJSON; now it&#x2019;s time to cover thematic mapping in the form of a graduated symbol map. The simplest&hellip;
---
---
title: Let’s Make a Map
url: https://bost.ocks.org/mike/map/
date_saved: 07/18/2016 09:58-33
excerpt: In this tutorial, I&#x2019;ll cover how to make a modest map from scratch using D3 and TopoJSON. I&#x2019;ll show you a few places where you can find free geographic data online, and how to convert&hellip;
---
---
title: libdlo
url: https://libdlo.freedesktop.org/wiki/
date_saved: 07/18/2016 10:01-05
excerpt: A fully open source (GPL) driver which supports all ?DisplayLink devices to date (all DL1xx devices) is in the mainline of the Linux 2.6.38 kernel, and can be compiled as a module for certain older&hellip;
---
---
title: Linear Regression Proof
url: http://www.eggie5.com/63-linear-regression-proof
date_saved: 07/18/2016 10:25-58
excerpt: Source: https://github.com/eggie5/ipython-notebooks/blob/master/linregress/Linear%20Regression%20Proof.ipynb Using the linear regression algorithm, we can approximate a function that will model a&hellip;
---
---
title: Linode Blog » The Twelve Days of Crisis – A Retrospective on Linode’s Holiday DDoS Attacks
url: https://blog.linode.com/2016/01/29/christmas-ddos-retrospective/
date_saved: 07/18/2016 10:35-56
excerpt: January 29, 2016 4:30 pm View a printable version of this post here. Over the twelve days between December 25th and January 5th, Linode saw more than a hundred denial-of-service attacks against every&hellip;
---
---
title: Little man computer
url: https://en.wikipedia.org/wiki/Little_man_computer
date_saved: 07/18/2016 10:37-24
excerpt: The Little Man Computer (LMC) is an instructional model of a computer, created by Dr. Stuart Madnick in 1965.[1] The LMC is generally used to teach students, because it models a simple von Neumann&hellip;
---
---
title: Logging with Day One, geek style
url: http://brettterpstra.com/2012/01/16/logging-with-day-one-geek-style/
date_saved: 07/18/2016 11:10-17
excerpt: I have long kept a journal&#x2013;more precisely, a log&#x2013;using VoodooPad with the Scratchpad scripts by Ian Beck. It&#x2019;s been a great system, but after years of usage it&#x2019;s started&hellip;
---
---
title: Looking at open source PaaS technologies
url: https://gdstechnology.blog.gov.uk/2015/10/27/looking-at-open-source-paas-technologies/
date_saved: 07/18/2016 11:13-53
excerpt: I&#x2019;ve been working on a prototype of what a Platform as a Service (PaaS) for government might look like, as we wrote about in a previous post. One of the first things we did was look at the&hellip;
---
---
title: LukeB42/Emissary
url: https://github.com/LukeB42/Emissary
date_saved: 07/18/2016 11:29-22
excerpt: A democracy thing for researchers, programmers and news junkies who want personally curated news archives. Emissary is a web content extractor that has a RESTful API and a scripting system. Emissary&hellip;
---
---
title: Macbook charger teardown: The surprising complexity inside Apple's power adapter
url: http://www.righto.com/2015/11/macbook-charger-teardown-surprising.html
date_saved: 07/18/2016 11:19-39
excerpt: Have you ever wondered what's inside your Macbook's charger? There's a lot more circuitry crammed into the compact power adapter than you'd expect, including a microprocessor. This charger teardown&hellip;
---
---
title: Make a Self-Training, NLP-Driven Slack Bot
url: http://blog.templeton.host/self-training-nlp-enabled-slack-bot-tutorial/
date_saved: 07/18/2016 10:38-45
excerpt: Slack has taken the world by storm, growing to be one of the hottest companies around seemingly overnight. Originally just a "messaging app for teams" (their words), Slack now touts a vibrant&hellip;
---
---
title: Making 20% Time Work
url: http://begriffs.com/posts/2016-01-29-making-twenty-percent-time-work.html
date_saved: 07/18/2016 10:36-29
excerpt: Following Google&#x2019;s lead many companies have instituted &#x201C;20% time&#x201D; for their employees. This is one day per week in which employees can work on projects of their own choosing. The&hellip;
---
---
title: Making Parametric Models in Fusion 360
url: https://hackaday.com/2016/02/02/making-parametric-models-in-fusion-360/
date_saved: 07/18/2016 10:30-21
excerpt: We all know and love&#xA0;OpenSCAD&#xA0;for its sweet sweet parametrical goodness. However, it&#x2019;s possible to get some of that same goodness out of Fusion 360. To do this we will be making a&hellip;
---
---
title: maptime-ams/animated-borders-d3js
url: https://github.com/maptime-ams/animated-borders-d3js
date_saved: 07/18/2016 09:58-11
excerpt: This is a step-by-step tutorial on making an animated map of the changing borders of U.S. states through history, using D3.js. This tutorial was made for Maptime Amsterdam's fourth Meetup, on&hellip;
---
---
title: marvelm/rabbit-ex
url: https://github.com/marvelm/rabbit-ex
date_saved: 07/18/2016 11:29-15
excerpt: Rabbit synchronizes videos between partners To start: Install dependencies with mix deps.get &amp;&amp; npm install Create and migrate your database with mix ecto.create &amp;&amp; mix ecto.migrate&hellip;
---
---
title: mateogianolio/nblas
url: https://github.com/mateogianolio/nblas
date_saved: 07/18/2016 11:10-41
excerpt: C++ bindings for CBLAS (Basic Linear Algebra Subprograms). Developed in parallel with vectorious, where it will eventually be included. $&#xA0;npm install mateogianolio/nblas $ npm test $&#xA0;npm&hellip;
---
---
title: Meet the woman in charge of the FBI’s most controversial high-tech tools
url: https://www.washingtonpost.com/world/national-security/meet-the-woman-in-charge-of-the-fbis-most-contentious-high-tech-tools/2015/12/08/15adb35e-9860-11e5-8917-653b65c809eb_story.html
date_saved: 07/18/2016 10:22-08
excerpt: In the aftermath of Wednesday’s shooting rampage in San Bernardino, FBI teams recovered computer hard drives, flash drives and crushed cellphones left by the attackers. They flew the evidence to&hellip;
---
---
title: Memory Loss Associated with Alzheimer’s Reversed for First Time
url: http://neurosciencenews.com/alzheimers-memory-loss-reversal-1377/
date_saved: 07/18/2016 10:09-04
excerpt: Small trial from UCLA and Buck Institute succeeds using systems approach to memory disorders. Patient one had two years of progressive memory loss. She was considering quitting her job, which&hellip;
---
---
title: Metabase Documentation
url: http://www.metabase.com/docs/v0.12.0/getting-started.html
date_saved: 07/18/2016 11:11-12
excerpt: Metabase is a simple and powerful analytics tool which lets anyone learn and make decisions from their company's data. No technical knowledge required! We hope you love it. Logging in The way you log&hellip;
---
---
title: MIPSfpga programme opens up the MIPS architecture to universities worldwide - Imagination Blog
url: http://blog.imgtec.com/mips-processors/mipsfpga-opens-up-the-mips-architecture-to-universities-worldwide
date_saved: 07/18/2016 10:12-23
excerpt: Please please please don&#x2019;t obfuscate it! said a famous professor when I mentioned the outline of MIPSfpga, an exciting project part of the Imagination University Programme (IUP) I was working&hellip;
---
---
title: Modern Methods for Sentiment Analysis
url: http://districtdatalabs.silvrback.com/modern-methods-for-sentiment-analysis?cmp=em-data-na-na-newsltr_20150415_oreilly_data&imm_mid=0d030b
date_saved: 07/18/2016 10:11-12
excerpt: Sentiment analysis is a common application of Natural Language Processing (NLP) methodologies, particularly classification, whose goal is to extract the emotional content in text. In this way,&hellip;
---
---
title: Modern Microprocessors - A 90 Minute Guide!
url: http://www.lighterra.com/papers/modernmicroprocessors/
date_saved: 07/18/2016 09:56-32
excerpt: WARNING: This article is meant to be informal and fun! Okay, so you're a CS graduate and you did a hardware course as part of your degree, but perhaps that was a few years ago now and you haven't&hellip;
---
---
title: Monads Explained Quickly
url: http://www.breck-mckye.com/blog/2016/04/monads-explained-quickly/
date_saved: 07/18/2016 09:36-39
excerpt: Most monad tutorials are long, confusing, and ineffective. I cannot promise this one will be more clear, more interesting, or even more effective, but I can at least promise to make it brisk. You&hellip;
---
---
title: More evidence emerges for 'transmissible Alzheimer's' theory
url: http://www.nature.com/news/more-evidence-emerges-for-transmissible-alzheimer-s-theory-1.19229
date_saved: 07/18/2016 10:24-42
excerpt: Nature | News Sharing Autopsies reveal plaques in the brains of people who died after receiving gr
---
---
title: Motion with Meaning: Semantic Animation in Interface Design
url: http://alistapart.com/article/motion-with-meaning-semantic-animation-in-interface-design
date_saved: 07/18/2016 10:51-20
excerpt: Animation is fast becoming an essential part of interface design, and it&#x2019;s easy to see why. It gives us a whole new dimension to play with&#x2014;time. This creates opportunities to make our&hellip;
---
---
title: MouseController Records and Automates Mouse Actions
url: http://lifehacker.com/mousecontroller-records-and-automates-mouse-actions-658839566
date_saved: 07/18/2016 10:07-53
excerpt: Windows: We love Autohotkey for its ability to automate keyboard tasks. Mouse movements are another thing, though. Thankfully, MouseController is up to the task. The app records your mouse's&hellip;
---
---
title: Mulchman's Blog
url: http://mulchman.org/blog/?tag=displaylink
date_saved: 07/18/2016 10:02-21
excerpt: For the longest time I&#x2019;ve been trying to get a triple head setup working (&#x201C;triple head&#x201D; referring to 3 monitors attached to one computer). This is a trivial feat if using Windows&hellip;
---
---
title: My simplified response to Paul Graham's simplified essay
url: http://blog.rongarret.info/2016/01/my-simplified-response-to-paul-grahams.html
date_saved: 07/18/2016 11:09-27
excerpt: Paul Graham published a simplified version of his essay on income inequality. &#xA0;Here's my simplified response: It is true that many socially worthwhile activities (like developing technology, and&hellip;
---
---
title: N1 Email Client -- A User-Friendly Option
url: https://www.linux.com/learn/tutorials/880351-n1-email-client-a-user-friendly-option
date_saved: 07/18/2016 10:28-31
excerpt: If you&#x2019;ve paid close enough attention to the news, you know that the Mozilla Foundation has cut the cord to Thunderbird. Considering that, for years, Thunderbird has been the most&hellip;
---
---
title: Naive Bayes Classifier Implementation
url: http://www.eggie5.com/66-naive-bayes-classifier-implementation
date_saved: 07/18/2016 10:26-19
excerpt: The Bayesian approach to classifying a new instance is to assign the most probable target value, $v_{nb}$, given the attribute values $ \langle a_1, a_2... a_n\rangle $ that describe the instance. $$&hellip;
---
---
title: Natural Language Basics with TextBlob
url: http://rwet.decontextualize.com/book/textblob/
date_saved: 07/18/2016 11:11-54
excerpt: by Allison Parrish In this chapter, we&#x2019;ll use a Python library called TextBlob to perform simple natural language processing tasks. &#x201C;Natural Language Processing&#x201D; is a field at&hellip;
---
---
title: Netflow configuration
url: http://www.packettracernetwork.com/tutorials/packet-tracer-netflow.html
date_saved: 07/18/2016 10:33-29
excerpt: Details Last Updated: Friday, 06 February 2015 21:57 Hits: 4276	What is Netflow?Netflow is a network analysis protocol that was initially created by Cisco to give the ability to collect detailled&hellip;
---
---
title: No nationality, no religion
url: https://medium.com/@benwerd/no-nationality-no-religion-6a556d718e3e#.3qiddmlqc
date_saved: 07/18/2016 10:23-53
excerpt: My future children, should I have any, will come from a tapestry of places. From my side of their lineage alone, they will come from three continents. They will have multiple passports.&hellip;
---
---
title: Non-root GPU passthrough setup
url: http://www.evonide.com/non-root-gpu-passthrough-setup/
date_saved: 07/18/2016 09:59-11
excerpt: If you want to use Linux as your main operating system and don&#x2019;t want to do compromises like using a dual-boot solution with Windows there is an alternative called GPU passthrough. You&hellip;
---
---
title: Now We Know What Causes Tinnitus, That Never-Ending Ringing In Your Ears
url: http://motherboard.vice.com/read/now-we-know-what-causes-tinnitus-that-never-ending-ringing-in-your-ears
date_saved: 07/18/2016 10:17-17
excerpt: Chronic pain and tinnitus, the incessant ear ringing that affects up to 30 percent of the adult population, may share a common source, new research shows. The finding may bring millions of people who&hellip;
---
---
title: null
url: null
date_saved: 07/18/2016 11:29-26
excerpt: null
---
---
title: Numbers don’t lie—it’s time to build your own router
url: http://arstechnica.com/gadgets/2016/01/numbers-dont-lie-its-time-to-build-your-own-router/
date_saved: 07/18/2016 10:56-35
excerpt: I've noticed a trend lately. Rather than replacing a router when it literally stops working, I've needed to act earlier—swapping in new gear because an old router could no longer keep up with&hellip;
---
---
title: On chain rule, computational graphs, and backpropagation
url: http://outlace.com/Computational-Graph/
date_saved: 07/18/2016 10:16-56
excerpt: ...Another post on backpropagation? Sort of. I know, everyone and their brother has a post on backpropagation. In fact, I already have a post on backpropagation here, so why am I writing another&hellip;
---
---
title: Open Modules for Open Minds
url: http://www.horizontalpitch.com/2015/09/1271/
date_saved: 07/18/2016 10:17-23
excerpt: Intro I can&#x2019;t hide it, I&#x2019;ve always been attracted by the idea of "openness", be it open content, software or hardware. My first encounter with this world was &#x2013; as for most people&hellip;
---
---
title: "OpenPGP Best Practices"
url: "https://help.riseup.net/en/security/message-security/openpgp/best-practices"
date_saved: "07/19/2016 07:58-47"
excerpt: "How to use this guide. We have gathered here a lot of information about configuring GnuPG. There are detailed explanations for each configuration suggestion. Many of these changes require you to make&hellip;"
thumbnail: [![](png/openpgp_best_practices.png)](png/full/openpgp_best_practices.png)
---
title: Open Source Flow Collecting with Elastic, Logstash, and Kibana
url: https://developer.wordpress.com/2016/02/08/open-source-netflow-with-elastic-logstash-kibana/
date_saved: 07/18/2016 10:26-54
excerpt: Today, most open source network flow tools lack a flexible and easy to use interface. Using Logstash&#x2019;s built-in netflow codec,&#xA0;Kibana&#x2019;s great looking and powerful web interface,&hellip;
---
---
title: Our Community's Top 100 Games
url: https://www.igdb.com/top-100/games
date_saved: 07/18/2016 10:25-05
excerpt: HomeTop 100GamesPlatform:From Year:To Year:#NameScore1
---
---
title: Output voltage control of DC/DC converters
url: http://www.fischl.de/dcdccontrol/
date_saved: 07/18/2016 10:30-28
excerpt: Some applications needs to control the output voltage of a dc/dc converter instead using a fixed output voltage. For example battery chargers has to adjust the output voltage to the current battery&hellip;
---
---
title: Overview | Adafruit Powerboost 1000C
url: https://learn.adafruit.com/adafruit-powerboost-1000c-load-share-usb-charge-boost?view=all
date_saved: 07/18/2016 10:37-02
excerpt: PowerBoost 1000C is the perfect power supply for your portable project! With a built-in load-sharing battery charger circuit, you'll be able to keep your power-hungry project running even while&hellip;
---
---
title: Overview
url: https://www.tensorflow.org/versions/master/tutorials/index.html
date_saved: 07/18/2016 11:14-33
excerpt: MNIST For ML Beginners If you're new to machine learning, we recommend starting here. You'll learn about a classic problem, handwritten digit classification (MNIST), and get a gentle introduction to&hellip;
---
---
title: Overview | USB, DC & Solar Lipoly Charger
url: https://learn.adafruit.com/usb-dc-and-solar-lipoly-charger?view=all
date_saved: 07/18/2016 10:36-55
excerpt: Make your projects to go green this summer with our specialized USB/Solar Lithium Ion Polymer Battery charger! This charger is a very unique design, perfect for outdoor projects, or DIY iPod&hellip;
---
---
title: Overview | Wave Shield
url: https://learn.adafruit.com/adafruit-wave-shield-audio-shield-for-arduino?view=all
date_saved: 07/18/2016 10:27-39
excerpt: Adding quality audio to an electronic project is surprisingly difficult. People tend to end up either using low-quality ISD chips (you might get 8Khz sampling rate for 30seconds out of these, if&hellip;
---
---
title: Packet Tracer lab 3 : VLAN and VTP
url: http://www.packettracernetwork.com/labs/lab3-vlanvtpconfig.html
date_saved: 07/18/2016 10:34-01
excerpt: Details Last Updated: Friday, 06 February 2015 21:57 Hits: 47298	Lab instructionsThe aim of this lab is to check your ability to configure VTP and VLAN on a small network of four switches. This lab&hellip;
---
---
title: Packet Tracer lab 4 : Port security
url: http://www.packettracernetwork.com/labs/lab4-portsecurity.html
date_saved: 07/18/2016 10:33-55
excerpt: Details Last Updated: Friday, 06 February 2015 21:57 Hits: 29694	IntroductionA growing challenge for network administrators is to be able to control who is allowed - and who isn't - to access the&hellip;
---
---
title: Payments with Stripe Checkout
url: https://themeteorchef.com/recipes/payments-with-stripe-checkout/
date_saved: 07/18/2016 10:50-30
excerpt: What we're going to learn In this recipe, we'll learn how to integrate payments using Stripe Checkout. We'll learn how to wire the interface up on the client, how to make it accept Bitcoin, and even&hellip;
---
---
title: Pee-wee’s Big Comeback
url: http://www.nytimes.com/2016/02/14/magazine/pee-wees-big-comeback.html
date_saved: 07/18/2016 09:59-23
excerpt: Paul Reubens wanted to show me his favorite Walgreens. I had asked to visit a place of personal significance, and although he has lived and worked in Los Angeles since the 1970s, he didn&#x2019;t&hellip;
---
---
title: Plugable
url: http://plugable.com/products/USB-VGA-165/
date_saved: 07/18/2016 10:02-15
excerpt: &#x201C;Awesome Productivity Tool&#x2026;Video is so important to me, that I didn&#x2019;t even experiment &#x2013; I just did it. This thing just works. I&#x2019;m so, sooo very happy. Thank you&hellip;
---
---
title: Practical Recursion Schemes
url: https://medium.com/@jaredtobin/practical-recursion-schemes-c10648ec1c29#.53n1ucixq
date_saved: 07/18/2016 10:16-44
excerpt: Recursion schemes are elegant and useful patterns for expressing general computation. In particular, they allow you to ‘factor recursion out’ of whatever semantics you may be trying to express when&hellip;
---
---
title: Principal Component Analysis in 4 Steps
url: http://alexhwoods.com/pca/
date_saved: 07/18/2016 10:52-03
excerpt: Recently I wrote a couple posts about&#xA0;eigenvectors&#xA0;and&#xA0;eigenvalues. I thought it would be cool to go from that slightly more theoretical material and show something super useful in&hellip;
---
---
title: Promises - A gentle introduction
url: http://bytearcher.com/articles/es6-promise-then-beginner-tutorial/
date_saved: 07/18/2016 09:47-05
excerpt: In order to get anything done in Node.js, you are destined to use asynchronous functions. They prepare an operation and accept a callback that is to be called when the results are in. For your&hellip;
---
---
title: PTSD: The Wound That Never Heals
url: http://nautil.us/issue/23/dominoes/ptsd-the-wound-that-never-heals
date_saved: 07/18/2016 10:11-44
excerpt: 
---
---
title: Rancher Documentation
url: http://docs.rancher.com/os/running-rancheros/server/install-to-disk/
date_saved: 07/18/2016 11:30-15
excerpt: RancherOS comes with a simple installer that will install RancherOS on a given target disk. To install RancherOS on a new disk, you can use the ros install command. Before installing, you&#x2019;ll&hellip;
---
---
title: Read A Go Developer's Notebook
url: https://leanpub.com/GoNotebook/read
date_saved: 07/18/2016 09:38-27
excerpt: It was a cold, dark night at the tail-end of 1980 and I was attending an open evening for a local secondary school when I first met a digital computer, one of a series of steel-framed rack-mount&hellip;
---
---
title: Read D3 Tips and Tricks
url: https://leanpub.com/D3-Tips-and-Tricks/read
date_saved: 07/18/2016 09:56-42
excerpt: Acknowledgements Mike First and foremost I would like to express my thanks to Mike Bostock, the driving force behind d3.js. His efforts are tireless and his altruism in making his work open and&hellip;
---
---
title: Read Express.js Guide | Leanpub
url: https://web.archive.org/web/20140621124403/https://leanpub.com/express/read
date_saved: 07/18/2016 09:53-00
excerpt: Foreword Dear reader, You are reading a book which will lead you to the understanding and fluent use of the Express.js framework &#x2014; the de facto standard in web application programming on&hellip;
---
---
title: ReadText
url: http://readtext.org/
date_saved: 07/18/2016 11:14-37
excerpt: ReadText About Daily Yearly Artwork Computers Conspiracy Food
---
---
title: Read Understanding ECMAScript 6
url: https://leanpub.com/understandinges6/read#leanpub-auto-introduction
date_saved: 07/18/2016 10:02-45
excerpt: Introduction The JavaScript core language features are defined in a standard called ECMA-262. The language defined in this standard is called ECMAScript, of which the JavaScript in the browser and&hellip;
---
---
title: Recipe for Disaster: The Formula That Killed Wall Street
url: http://www.wired.com/2009/02/wp-quant/
date_saved: 07/18/2016 10:22-34
excerpt: In the mid-'80s, Wall Street turned to the quants&#x2014;brainy financial engineers&#x2014;to invent new ways to boost profits. Their methods for minting money worked brilliantly&#x2026; until one of&hellip;
---
---
title: Reinventing online reviews
url: http://gearoidoconnor.ie/blog/2015/10/27/Reinventing-online-reviews.html
date_saved: 07/18/2016 10:57-43
excerpt: Online reviews for products are majorly influencing purchasers buying decisions. 70% of people now consult online reviews prior to purchasing products. With this being said information overload for&hellip;
---
---
title: Related BlogsSee All
url: https://developer.ibm.com/open/openwhisk/
date_saved: 07/18/2016 09:49-18
excerpt: Microservice architectures have emerged as the preferred way to engineer robust, scalable cloud-native solutions. Microservices hold application logic in small, loosely coupled distributed services,&hellip;
---
---
title: Relativity and Faster Than Light Travel
(1992)
url: http://readtext.org/science/relativity-faster-than-light-travel/
date_saved: 07/18/2016 10:49-28
excerpt: Finally, here it is. It is a length discussion, 794 lines by my count, but it is fairly complete for what I intended to do. Also, if you are only interested in a particular part, you can just skip&hellip;
---
title: Remote work tips from Chargify’s distributed team
url: https://www.chargify.com/blog/remote-work-tips/
date_saved: 07/18/2016 10:22-00
excerpt: December 10th, 2015 I recently read Buffer&#x2019;s post about ditching their office and going 100% distributed. It reminded me of a great post our own Eric Farkas wrote, where he shared his&hellip;
---
---
title: Riddle of cement’s structure is finally solved
url: http://news.mit.edu/2016/cement-structure-solved-0208
date_saved: 07/18/2016 10:26-47
excerpt: Concrete is the world&#x2019;s most widely used construction material, so abundant that its production is one of the leading sources of greenhouse gas emissions. Yet answers to some fundamental&hellip;
---
---
title: rLoop: We Are Pushing the Limits of the Open Source, Online Think Tank Model - PSFK
url: http://www.psfk.com/2016/02/rloop-open-source-online-think-tank-model-hyperloop-spacex-design-weekend-winners.html
date_saved: 07/18/2016 10:27-56
excerpt: rLoop team member and moderator of /r/SpaceX Richard Behiel on evolving from brainstorming on subreddit to building a Hyperloop pod in Sacramento Last June, the SpaceX fan subreddit (not affiliated&hellip;
---
---
title: Roll Your Own Authentication
url: https://themeteorchef.com/recipes/roll-your-own-authentication/
date_saved: 07/18/2016 10:50-08
excerpt: What we're going to learn In this recipe we'll be helping our client, Don Carlton, add custom authentication to his sales management application. We'll make use of Meteor's own Accounts Password&hellip;
---
---
title: rvikmanis/fastflux
url: https://github.com/rvikmanis/fastflux
date_saved: 07/18/2016 11:10-32
excerpt: A lightweight message driven flux implementation written in ES6, inspired by FRP, the original Flux and Redux. Introduction Architecture Installation Getting Started
---
---
title: Schema
url: http://jsonresume.org/schema/
date_saved: 07/18/2016 11:30-20
excerpt: What is it? JSON Resume is a community driven open source initiative to create JSON-based standard for resumes. Why JSON? We believe that the strengths of the JSON format makes it a good fit for&hellip;
---
---
title: Scrapy Tips from the Pros: February 2016 Edition
url: https://blog.scrapinghub.com/2016/02/24/scrapy-tips-from-the-pros-february-2016-edition/
date_saved: 07/18/2016 09:47-47
excerpt: Welcome to the February Edition of Scrapy Tips from the Pros. Each month we&#x2019;ll release a few tips and hacks that we&#x2019;ve developed to help make your Scrapy workflow go more smoothly. This&hellip;
---
---
title: Screw motivation, what you need is discipline.
url: http://www.wisdomination.com/screw-motivation-what-you-need-is-discipline/
date_saved: 07/18/2016 10:09-23
excerpt: If you want to get anything done, there are two basic ways to&#xA0;get yourself to do it. The first, more popular and devastatingly wrong option is to try to motivate yourself. The second, somewhat&hellip;
---
---
title: Sense2vec with spaCy and Gensim
url: https://spacy.io/blog/sense2vec-with-spacy
date_saved: 07/18/2016 09:56-06
excerpt: If you were doing text analytics in 2015, you were probably using word2vec. Sense2vec (Trask et al., 2015) is a new twist on word2vec that lets you learn more interesting, detailed and&hellip;
---
---
title: Shape A shape is a three dimensional object displayed on a two dimensional plane
url: http://semantic-ui.com/modules/shape.html#/definition
date_saved: 07/18/2016 11:20-37
excerpt: Menu A shape is a three dimensional object including any flat content as a side. A cube shape is formatted so that each side is the face of a cube A text shape is formatted to allow for sides of text&hellip;
---
---
title: Share 360 Panosphere Images on Facebook and YouTube
url: http://climbcodecreate.com/2016/01/27/share-360-panosphere-images-on-facebook-and-youtube/
date_saved: 07/18/2016 10:35-16
excerpt: Here&#x2019;s a tutorial that shows you how to share your&#xA0;360 panosphere images that you&#x2019;ve taken with your Android phone onto Facebook or YouTube. Skill Level: Intermediate&hellip;
---
---
title: Slack + SuperScript — Rise of the Bots
url: https://medium.com/@rob_ellis/slack-superscript-rise-of-the-bots-bba8506a043c#.5zax6gvkk
date_saved: 07/18/2016 10:38-37
excerpt: This article has been updated to work with SuperScript 0.6.8. If you are interested into Slack+Bots. The SuperScript Editor comes with built-in Slack Support.Two days after I announced&hellip;
---
---
title: SLOTH
url: http://www.mitls.org/pages/attacks/SLOTH
date_saved: 07/18/2016 11:07-20
excerpt: Security Losses from Obsolete and Truncated Transcript Hashes (CVE-2015-7575) TL;DR If your TLS 1.2 client or server supports RSA-MD5 signatures, then client authentication is broken, and server&hellip;
---
---
title: Softwar
url: http://www.softwar.net/stupid.html
date_saved: 07/18/2016 09:49-42
excerpt: BEWARE OF STUPID &#xA0; A MESSAGE FROM OUR FOUNDER AND CEO - Stupid has struck again and this time its target was the premier US law enforcement agency - the FBI. Hackers penetrated computers at the&hellip;
---
---
title: Space.js
url: http://www.slashie.org/articles/space.js/
date_saved: 07/18/2016 10:48-58
excerpt: Creating content on the Internet is not just about the contents. It&#x2019;s about reaching out with a message, telling a story, trying to translate an emotion into bits and communicating them to the&hellip;
---
---
title: spectro… adventures in Go (lang)
url: http://markcrossfield.co.uk/2015-08-22-spectro-adventures-in-go.html
date_saved: 07/18/2016 11:18-57
excerpt: My latest spare time project has been writing a general purpose command line heat map tool designed to visualise the distribution of streams of decimal numbers (not necessarily integers) representing&hellip;
---
---
title: Speed Up SSH by Reusing Connections
url: https://puppetlabs.com/blog/speed-up-ssh-by-reusing-connections
date_saved: 07/18/2016 09:37-01
excerpt: Republished with permission from our friends at the Rackspace Developers blog. Establishing a new SSH connection usually takes only a few seconds, but if you're connecting to a server multiple times&hellip;
---
---
title: Sponsor Content: Cocainenomics
url: http://www.wsj.com/ad/cocainenomics/
date_saved: 07/18/2016 10:17-30
excerpt: 2015 Medell&#xED;n: A Post-Pablo Economy By Fara Warner and Christine Sanders By Fara Warner and Christine Sanders Medell&#xED;n is a study in contrasts. Visit the El Poblado comuna (or&hellip;
---
---
title: SSH: Best practices
url: https://blog.0xbadc0de.be/archives/300
date_saved: 07/18/2016 10:27-17
excerpt: 17/01/16 - 12:45am The comments around the last OpenSSH issue (CVE 2016-0777, you must read excellent Qualys&#x2019; analysis if you&#x2019;re interested with the details), I noticed that many people&hellip;
---
---
title: Stack Overflow's Bosun Architecture
url: http://kbrandt.com/post/bosun_arch/
date_saved: 07/18/2016 09:38-06
excerpt: Bosun is a significant piece of our monitoring infrastructure at Stack Overflow. In forums such as Bosun&#x2019;s Slack Chat Room, we are frequently asked to describe how Bosun is set up in our&hellip;
---
---
title: stamparm/maltrail
url: https://github.com/stamparm/maltrail
date_saved: 07/18/2016 10:25-50
excerpt: General Maltrail is a malicious traffic monitoring system, utilizing publicly available blacklists containing malicious (or generally suspicious) trails (i.e. domain names, URLs and/or IPs), along&hellip;
---
---
title: Standard Configs to use with Rollup.js
url: https://gist.github.com/chimon2000/d79a018a725d17ec4d42
date_saved: 07/18/2016 10:31-51
excerpt: Skip to content Create a gist now Instantly share code, notes, and snippets. Something went wrong with that request. Please try again.
---
---
title: thalesmello/exploring-async
url: https://github.com/thalesmello/exploring-async/blob/master/exploring_async.md
date_saved: 07/18/2016 11:11-08
excerpt: During the past few months, I've been exploring a few different techniques that can be use to write asynchronous programs. I'd like to share my experience via this essay. Even though we are using&hellip;
---
---
title: The Anatomy of an SSH Connection
url: http://necrux.com/the-anatomy-of-an-ssh-connection/
date_saved: 07/18/2016 10:38-00
excerpt: Over the last couple of days I have become increasingly interested in unraveling the mysteries behind establishing an SSH connection. The process is very intricate and some of the documentation seems&hellip;
---
---
title: The Beginner’s Guide to Github and Git
url: https://webdesignviews.com/beginners-guide-github-and-git/
date_saved: 07/18/2016 10:56-13
excerpt: Paula Borowska | January 10, 2016 | CodingIn short, Git is a version control software. It means it helps manage changes to a project without overwrites and loss of work. Therefore, if something gets&hellip;
---
---
title: The blessing and curse of the people who never forget
url: http://www.bbc.com/future/story/20160125-the-blessing-and-curse-of-the-people-who-never-forget?ocid=global_future_rss
date_saved: 07/18/2016 09:49-48
excerpt: For most of us, memory is a kind of scrapbook, a mess of blurred and faded snapshots of our lives. As much as we would like to cling on to our past, even the most poignant moments can be washed away&hellip;
---
---
title: The Collective Legal Guide For Designers (Contract Samples) – Smashing Magazine
url: https://www.smashingmagazine.com/2013/04/legal-guide-contract-samples-for-designers/
date_saved: 07/18/2016 09:35-54
excerpt: Rule number one for designers of all kinds: use a contract. Sometimes, this is easier said than done. Should I use a service agreement? A retainer? A licensing contract? With the help of Docracy1, we&hellip;
---
---
title: The End of Twitter
url: http://www.newyorker.com/tech/elements/the-end-of-twitter
date_saved: 07/18/2016 10:35-50
excerpt: It wasn&#x2019;t that long ago that I&#x2014;and many other people I know&#x2014;would have argued that Twitter was more than just another social network. I would have told you that Twitter was more&hellip;
---
---
title: The Father of Online Anonymity Has a Plan to End the Crypto War
url: http://www.wired.com/2016/01/david-chaum-father-of-online-anonymity-plan-to-end-the-crypto-wars/
date_saved: 07/18/2016 11:08-43
excerpt: It&#x2019;s been more than 30 years since David Chaum launched the ideas that would serve as much of the groundwork for anonymity online. In doing so, he also helped spark the debate that&#x2019;s&hellip;
---
---
title: The HTML 5 Mega Cheat Sheet
url: http://makeawebsitehub.com/the-html-5-mega-cheat-sheet/
date_saved: 07/18/2016 10:42-22
excerpt: Posted at 13:04h in Web Cheat Sheets by Jamie 2 Comments Cheat sheets; don&#x2019;t you just love them? I love them as they offer me a simple way to recall a software program or help me to learn a&hellip;
---
---
title: The introverts guide to getting noticed
url: http://www.pauldessert.com/blog/the-introverts-guide-to-getting-noticed.php
date_saved: 07/18/2016 10:09-46
excerpt: As artists and technologists, we're in our own world. We're a unique breed. We're creating, designing and dreaming. That's part of our DNA. It's what we do best. Interacting with other humans... not&hellip;
---
---
title: The Issue With Global Node Packages – Smashing Magazine
url: https://www.smashingmagazine.com/2016/01/issue-with-global-node-npm-packages/
date_saved: 07/18/2016 10:58-03
excerpt: Node.js brought about a great revolution for JavaScript developers by allowing us to write code that runs directly on our machines; our skills were no longer limited to browsers alone. At first, many&hellip;
---
---
title: The Ketamine Connection
url: http://www.bbc.co.uk/news/resources/idt-bc7d54e7-88f6-4026-9faa-2a36d3359bb0
date_saved: 07/18/2016 10:13-28
excerpt: The clinic's peppy promotional video boasts that Baiyun has &#x201C;cured&#x201D; more than 10,000 patients. Group rehabilitation at the Baiyun clinic Yang explains that up to a third of ketamine&hellip;
---
---
title: The Kolmogorov-Smirnov Test¶
url: http://daithiocrualaoich.github.io/kolmogorov_smirnov/
date_saved: 07/18/2016 11:15-00
excerpt: A visit to a data and statistical technique useful to software engineers. We learn about some Rust too along the way. The code and examples here are available on Github. The Rust library is on&hellip;
---
---
title: The libraries of Babel, Mendel and Turing
url: http://haggstrom.blogspot.com/2015/04/the-libraries-of-babel-mendel-and-turing.html
date_saved: 07/18/2016 10:11-06
excerpt: There is much disagreement concerning the dangers associated with a breakthrough in artificial intelligence. Could such an event lead to our extinction, or the End of the Human Era as James Barrat&hellip;
---
---
title: The man behind Jon Stewart's secret project lays out the future of media — and it's riveting
url: http://www.businessinsider.com/the-man-behind-jon-stewarts-secret-project-with-otoy-lays-out-the-future-of-media
date_saved: 07/18/2016 10:19-54
excerpt: OtoyOTOY CEO Jules Urbach.When Jules Urbach starts talking about the future of media, it&#x2019;s hard for me not to get&#xA0;swept up in a wave of eagerness. Urbach says he&#x2019;s used to that&hellip;
---
---
title: The man who made Bond
url: http://www.intelligentlifemagazine.com/culture/the-man-who-made-bond
date_saved: 07/18/2016 10:22-14
excerpt: The record-breaking success of &#x201C;Spectre&#x201D; may reinforce James Bond&#x2019;s status as the most glamorous of all secret agents, but he&#x2019;s still not as glamorous as his creator. An&hellip;
---
---
title: The Man Who Would Tame Cancer
url: http://nautil.us/issue/32/space/the-man-who-would-tame-cancer
date_saved: 07/18/2016 10:35-29
excerpt: For the loved ones we&#x2019;ve all lost, for the families that we can still save, let&#x2019;s make America the country that cures cancer once and for all. &#x2014;President Barack Obama, State of&hellip;
---
---
title: The Mission To Save The Internet By Rewiring It From The Name Up
url: http://motherboard.vice.com/read/the-internet-of-names
date_saved: 07/18/2016 10:13-11
excerpt: While most of us have been binge-streaming or strapping computers to our bodies or wrapping our heads around the ins and outs of net neutrality, an international team of academics and some of the&hellip;
---
---
title: The Power of PCAP & Retrospection in Practice
url: https://www.protectwise.com/blog/the-power-of-pcap-and-retrospection-in-practice/
date_saved: 07/18/2016 11:13-36
excerpt: One of the core benefits of our Cloud Network DVR is that it creates a full fidelity network memory. This memory provides two powerful capabilities: The ability to validate and reconstruct security&hellip;
---
---
title: The rEFInd Boot Manager:rEFInd and System Integrity Protection
url: http://www.rodsbooks.com/refind/sip.html
date_saved: 07/18/2016 09:59-18
excerpt: by Roderick W. Smith, rodsmith@rodsbooks.com Originally written: 11/8/2015; last Web page update: 1/26/2016, referencing rEFInd 0.10.2 This Web page is provided free of charge and with no annoying&hellip;
---
---
title: There's a lot of vulnerable OS X applications out there.
url: https://vulnsec.com/2016/osx-apps-vulnerabilities/
date_saved: 07/18/2016 10:35-36
excerpt: Lately, I was doing research connected with different updating strategies, and I tested a few applications working under Mac OS X. This short weekend research revealed that we have many insecure&hellip;
---
---
title: The researcher programmer, a new species?
url: http://dirkgorissen.com/2012/03/26/the-researcher-programmer-a-new-species/
date_saved: 07/18/2016 09:57-51
excerpt: Update: There has been some good discussion on this post at the LinkedIn group on Scientific Software Development and Management.&#xA0;See also&#xA0;the papers by Victoria Stodden&#xA0;and the great&hellip;
---
---
title: The Rise of Hate Search
url: http://www.nytimes.com/2015/12/13/opinion/sunday/the-rise-of-hate-search.html
date_saved: 07/18/2016 10:22-25
excerpt: HOURS after the massacre in San Bernardino, Calif., on Dec. 2, and minutes after the media first reported that at least one of the shooters had a Muslim-sounding name, a
---
---
title: The Scooter Computer
url: http://blog.codinghorror.com/the-scooter-computer/
date_saved: 07/18/2016 10:29-07
excerpt: When we initially deployed our handbuilt colocated servers for Discourse in 2013, I needed a way to provide an isolated VPN channel in for secure remote access and troubleshooting. Rather than&hellip;
---
---
title: These Gorgeous Buildings Showcase the Surprisingly Innovative Future of Wood
url: http://gizmodo.com/these-gorgeous-buildings-showcase-the-surprisingly-inno-1757398349
date_saved: 07/18/2016 10:27-24
excerpt: Wood is the future. That&#x2019;s the feeling you get after looking through the 2016 award winners named by WoodWorks, the United States wood building council. All of these structures are made from&hellip;
---
---
title: The Villain of CRISPR
url: http://www.michaeleisen.org/blog/?p=1825
date_saved: 07/18/2016 10:49-07
excerpt: There is something mesmerizing about an evil genius at the height of their craft, and Eric Lander is an evil genius at the height of his craft. Lander&#x2019;s recent essay in Cell entitled&hellip;
---
---
title: The Wolf of Wall Tweet
url: http://www.slate.com/articles/business/moneybox/2015/04/bot_makes_2_4_million_reading_twitter_meet_the_guy_it_cost_a_fortune.html
date_saved: 07/18/2016 10:12-11
excerpt: Illustration by Robert Neubecker On the afternoon of Friday, March 27, as several news outlets reported at the time, somebody apparent
---
---
title: This article relates to…
url: https://chroniclevitae.com/news/1242-code-switching-to-improve-your-writing-and-productivity
date_saved: 07/18/2016 10:59-48
excerpt: Image: Twentieth Century Culture and Deportment, by Maude C. Cooke (National Publishing Co., 1899) Right now, as I write this, I have three other Word documents open on my desktop. I am scuttling&hellip;
---
---
title: Timeline Highlights
url: http://www.computerhistory.org/timeline/networking-the-web/
date_saved: 07/18/2016 10:55-12
excerpt: 1933 1934 1945
---
---
title: turingbirds/con-pcb-slot
url: https://github.com/turingbirds/con-pcb-slot
date_saved: 07/18/2016 10:26-59
excerpt: PCB slot connector for JTAG/ISP programming README.md Primary application: JTAG/ISP programming Zero parts count Small footprint Full version: 0.1 sq. inch Minimal version: 0.07 sq. inch 0.05" pitch,&hellip;
---
---
title: Understanding the box model by building a navigation bar
url: http://www.chenhuijing.com/blog/that-navigation-bar-design/
date_saved: 07/18/2016 09:54-46
excerpt: Working in an agency means that most of the work I do is project-based. This means building a new design every couple of months (or less, if you know what I mean). The interesting part is, after a&hellip;
---
---
title: Understanding the GitHub Flow
url: https://guides.github.com/introduction/flow/
date_saved: 07/18/2016 09:50-15
excerpt: GitHub Flow is a lightweight, branch-based workflow that supports teams and projects where deployments are made regularly. This guide explains how and why GitHub Flow works. Create a branch When&hellip;
---
---
title: Unhealthy Fixation
url: http://www.slate.com/articles/health_and_science/science/2015/07/are_gmos_safe_yes_the_case_against_them_is_full_of_fraud_lies_and_errors.html
date_saved: 07/18/2016 10:16-01
excerpt: Is genetically engineered food dangerous? Many people seem to think it is. In the past five years, companies have submitted more than 27,000 products to the Non-GMO Project, which certifies goods&hellip;
---
---
title: Unified Inbox & Label Editing Arrive in Open-Source E-mail App ‘N1’
url: http://www.omgubuntu.co.uk/2016/02/nylas-n1-email-client-4-4-features
date_saved: 07/18/2016 10:04-51
excerpt: The N1 email client is one of our favourite apps A major&#xA0;update is rolling out to hackable&#xA0;open source&#xA0;e-mail client&#xA0;N1. So important are the changes that the developers&hellip;
---
---
title: U.S. can't ban encryption because it's a global phenomenon, Harvard study finds
url: http://www.dailydot.com/politics/worldwide-survey-of-encryption-products/
date_saved: 07/18/2016 10:04-03
excerpt: After a two-year campaign from the FBI, U.S. intelligence officials, and powerful politicians calling for backdoor access into Americans&#x2019; encrypted data, a new Harvard study argues that&hellip;
---
---
title: Using an offline GnuPG master key
url: http://www.incenp.org/notes/2015/using-an-offline-gnupg-master-key.html
date_saved: 07/18/2016 11:12-57
excerpt: OpenPGP subkeys have many benefits (well summarized on this Debian wiki page), one of them being that if you have both an encryption subkey and a signing subkey (at least), you don&#x2019;t need your&hellip;
---
---
title: Using the Collection2 Package
url: https://themeteorchef.com/snippets/using-the-collection2-package/
date_saved: 07/18/2016 10:50-42
excerpt: What we're going to learn Join The Meteor Chef on Slack If you get confused or stuck while reading&#x2014;or just want to talk about Meteor&#x2014;join us on Slack! Get an invite now. What is&hellip;
---
---
title: Verizon Routing Millions of IP Addresses for Cybercrime Gangs
url: http://www.spamhaus.org/news/article/726/
date_saved: 07/18/2016 10:58-25
excerpt: Over the past few years, spammers have sought out large ranges of IP addresses. By spreading out their sending patterns across a wide range of IP addresses, they can attempt to defeat spam filters&hellip;
---
---
title: "VivaGraphJS"
url: "https://github.com/anvaka/VivaGraphJS"
date_saved: "07/19/2016 07:58-21"
excerpt: "VivaGraphJS is a free graph drawing library for JavaScript. It is designed to be extensible and to support different rendering engines and layout algorithms. At the moment it supports rendering&hellip;"
thumbnail: [![](png/vivagraphjs.png)](png/full/vivagraphjs.png)
---
title: Von Neumann architecture
url: https://en.wikipedia.org/wiki/Von_Neumann_architecture
date_saved: 07/18/2016 10:37-28
excerpt: See also: Stored-program computer and Universal Turing machine § Stored-program computer
---
---
title: We need more scientific mavericks
url: https://www.theguardian.com/science/2014/mar/18/we-need-more-scientific-mavericks
date_saved: 07/18/2016 10:08-24
excerpt: Mavericks like the American Nobel prize winner for physics Richard Feynman &#x2013; seen here dancing with his wife at the Nobel ball in Stockholm, Sweden &#x2013; once played an essential role in&hellip;
---
---
title: What do you mean ‘we need more time’??
url: https://blogs.dropbox.com/tech/2015/10/what-do-you-mean-you-need-more-time/
date_saved: 07/18/2016 10:04-08
excerpt: In tech, we spend little time talking about the softer skills like communication, project management, and prioritization. These are the skills that elevate someone from a good programmer to a great&hellip;
---
---
title: What is a 'unikernel'?
url: https://ma.ttias.be/what-is-a-unikernel/
date_saved: 07/18/2016 11:20-21
excerpt: If you've been following the Devops Weekly newsletter, DevOps-like conferences or if you're just really interested in technology, you've probably heard of unikernels being mentioned a few times. In&hellip;
---
---
title: What Is the Self? It Depends
url: http://opinionator.blogs.nytimes.com/2016/02/08/the-self-in-east-and-west/
date_saved: 07/18/2016 10:05-50
excerpt: The Stone is a forum for contemporary philosophers and other thinkers on issues both timely and timeless. I recently took my self to a gathering of a dozen selves to discuss the idea of self, East&hellip;
---
---
title: What It Feels Like When Everyone Is Making Art But You
url: http://www.buzzfeed.com/jwray/surrounded-by-legends#.ixZnZJ5xKq
date_saved: 07/18/2016 10:03-41
excerpt: View this image ›
---
---
title: What It’s Like As A Software Developer
url: http://www.theglobalfilipino.com/what-its-like-as-a-software-developer/
date_saved: 07/18/2016 10:15-53
excerpt: I feel like I can speak with some clarity being on both sides as a freelance developer &amp; product owner. Often times when I talk to people who are not familiar with software development and how&hellip;
---
---
title: What's next for open source? Physical products.
url: https://opensource.com/business/15/4/makerspace-next-open-source-frontier
date_saved: 07/18/2016 10:10-36
excerpt: Welcome back, folks, to our third installment of my Six Degrees column. Thanks for the wondrous support over the past two installments. As always, keep your feedback flowing in the comments and feel&hellip;
---
---
title: When Addiction Has a White Face
url: http://www.nytimes.com/2016/02/09/opinion/when-addiction-has-a-white-face.html
date_saved: 07/18/2016 10:26-24
excerpt: WHEN crack hit America in the mid-1980s, for African-Americans, to borrow from Ta-Nehisi Coates, civilization fell. Crack embodied instant and fatal addiction; we saw endless
---
---
title: When Anxiety Attacks
url: http://www.feld.com/archives/2015/09/anxiety-strikes.html
date_saved: 07/18/2016 10:17-06
excerpt: Three weeks ago, Mardy Fish wrote an amazing article on The Players&#x2019; Tribute site titled&#xA0;The Weight. I stopped halfway through the article and took a deep breath. &#x201C;This is a story&hellip;
---
---
title: whose xterm is it anyway?
url: http://www.tedunangst.com/flak/post/whose-xterm-is-it-anyway
date_saved: 07/18/2016 11:11-59
excerpt: As part of the effort to find idle hogs, I noticed some xterms were heavier than others. 9960 tedu 2 0 7056K 12M sleep select 0:08 0.00% xterm 15257 tedu 2 0 6808K 12M sleep select 0:01 0.00% xterm&hellip;
---
---
title: Why Google’s new quantum computer could launch an artificial intelligence arms race
url: https://www.washingtonpost.com/news/innovations/wp/2015/12/10/why-googles-new-quantum-computer-could-launch-an-artificial-intelligence-arms-race/
date_saved: 07/18/2016 10:21-53
excerpt: The D-Wave 2X quantum computer promises exponential gains in computing power. (Stephen Lam/Reuters) Ever since the 1980s, researchers have been working on the development of a quantum computer that&hellip;
---
---
title: Why We Buy Into Ideas: How to Convince Others of Our Thoughts
url: https://blog.bufferapp.com/why-we-buy-into-ideas-how-to-convince-others-of-our-thoughts
date_saved: 07/18/2016 10:07-10
excerpt: This is a guestpost by&#xA0;Iris Shoor, co-founder and VP Product and marketing at&#xA0;Takipi, more about Iris at the bottom of the post. If you think about it, each one of us has different natural&hellip;
---
---
title: Why We Fear the IRS
url: http://www.bloombergview.com/articles/2016-01-04/why-we-fear-the-irs
date_saved: 07/18/2016 11:08-37
excerpt: Lisa Bennett was at home on an ordinary afternoon when she received a call from Officer Jason Dean of the Investigative Office of the Treasury. He told her that an arrest warrant had been issued for&hellip;
---
---
title: "Wildhoney/Dory"
url: "https://github.com/Wildhoney/Dory"
date_saved: "07/19/2016 07:58-26"
excerpt: "Dory should have a blog to write before she forgets. So don't be like her else you'll have many regrets. And don't tell Dory she needs the internets. &#xA0;"
thumbnail: [![](png/wildhoneydory.png)](png/full/wildhoneydory.png)
---
title: with — Organize Complex Queries
url: https://modern-sql.com/feature/with
date_saved: 07/18/2016 11:19-56
excerpt: In imperative programming it is common practice to group instructions in small and easily comprehensible units&#x2014;namely functions or methods. Often to enable code reuse but also to improve&hellip;
---
---
title: "Working with Strings"
url: "https://www.microsoft.com/net/tutorials/csharp/getting-started/strings"
date_saved: "07/19/2016 07:59-15"
excerpt: "by Steve Smith Strings in C# Strings in C# are a built-in type, as well as a standard .NET type. The string keyword in C# is the same as the System.String type, and you can declare variables using&hellip;"
thumbnail: [![](png/working_with_strings.png)](png/full/working_with_strings.png)
---
title: Worried well
url: https://aeon.co/essays/anxiety-isn-t-just-a-useless-emotion-it-s-also-a-moral-goad
date_saved: 07/18/2016 10:09-52
excerpt: At a dinner party, you find yourself seated next to a man named Sam. He&#x2019;s a new acquaintance, but it turns out the two of you have several friends in common &#x2013; so you&#x2019;re keen to&hellip;
---
---
title: Wrap-Up
url: https://deis.com/blog/2016/coreos-overview-p3
date_saved: 07/18/2016 09:59-50
excerpt: This is the third and final post in a series looking at CoreOS. In my last post, we looked at the cloud-config file, running etcd in proxy mode, and some common etcd cluster setups. In this post, we&hellip;
---
---
title: Writing an Async Logger in Nim
url: http://hookrace.net/blog/writing-an-async-logger-in-nim/
date_saved: 07/18/2016 10:35-45
excerpt: 2016-01-28 Surprisingly I'm working on HookRace again. I might share a few interesting code snippets and thoughts in this blog along the way. I'm still going with Nim as the programming language. For&hellip;
---
---
title: Writing an OS in Rust · phil-opp's blog
url: http://os.phil-opp.com/
date_saved: 07/18/2016 11:28-45
excerpt: A minimal x86 kernel 18 Aug 2015 This post explains how to create a minimal x86 operating system kernel. In fact, it will just boot and print OK to the screen. The following blog posts we will extend&hellip;
---
---
title: Writing a Package
url: https://themeteorchef.com/recipes/writing-a-package/
date_saved: 07/18/2016 10:50-00
excerpt: What we're going to learn In this recipe, we'll learn how to write a package. We'll take a look at setting up a package.js file, writing and organizing your code, and preparing tests. We'll even&hellip;
---
---
title: Writing manual pages
url: http://liw.fi/manpages/
date_saved: 07/18/2016 11:27-47
excerpt: Introduction Manual pages are the canonical type of documentation for Unix systems. They are a bit arcane, but for a technology several decades old, they've held up quite well. The arcane bit is the&hellip;
---
---
title: Writing my own init with Go - Part 1
url: http://www.mustafaak.in/2016/02/08/writing-my-own-init-with-go.html
date_saved: 07/18/2016 10:26-35
excerpt: 08 Feb 2016 You may be wondering why would someone need to do that. I just want to experiment with Linux and build stuff with Go, so this is a nice option. I also found Linux distros to be completely&hellip;
---
---
title: You Can Have Millions Of Subscribers On YouTube—And Still Be Flat Broke
url: http://fusion.net/story/244545/famous-and-broke-on-youtube-instagram-social-media/
date_saved: 07/18/2016 10:22-39
excerpt: t was all so painfully awkward. That night, Brittany Ashley, a lesbian stoner in red lipstick, was at Eveleigh, a popular farm-to-table spot in West Hollywood. The restaurant was hosting&hellip;
---
---
title: zer0n/deepframeworks
url: https://github.com/zer0n/deepframeworks/
date_saved: 07/18/2016 11:10-28
excerpt: Abstract. In this study, I evaluate some popular deep learning toolkits. The candidates are listed in alphabetical order: Caffe, CNTK, TensorFlow, Theano, and Torch. This is a dynamic document and&hellip;
---
